{
  "name": "AllocateDedicatedHosts",
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ActionOnMaintenance",
      "description": "The policy used to migrate the instances deployed on the dedicated host when the dedicated host fails or needs to be repaired online. Valid values:\n\n*   Migrate: The instances are migrated to another physical server and restarted.\n\n    If cloud disks are attached to the dedicated host, the default value is Migrate.\n\n*   Stop: The instances are stopped. If the dedicated host cannot be repaired, the instances are migrated to another physical machine and then restarted.\n\n    If local disks are attached to the dedicated host, the default value is Stop.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "AutoPlacement",
      "description": "Specifies whether to add the dedicated host to the resource pool for automatic deployment. If you create an ECS instance on a dedicated host without specifying the **DedicatedHostId** parameter, Alibaba Cloud selects a dedicated host from the resource pool to host the instance. For more information, see [Automatic deployment](~~118938~~). Valid values:\n\n*   on: adds the dedicated host to the resource pool for automatic deployment.\n*   off: does not add the dedicated host to the resource pool for automatic deployment.\n\nDefault value: on.\n\n> If you do not want to add the dedicated host to the resource pool for automatic deployment, set this parameter to off.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "AutoReleaseTime",
      "description": "The time when to automatically release the dedicated host. Specify the time in the `ISO 8601` standard in the yyyy-MM-ddTHH:mm:ssZ format. The time must be in UTC.\n\n> \n\n*   It must be at least half an hour later than the current time.\n\n*   It must be at most three years later than the current time.\n\n*   If the value of seconds (ss) is not 00, it is automatically set to 00.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "AutoRenew",
      "description": "Specifies whether to automatically renew the subscription dedicated host.\n\n> The **AutoRenew** parameter takes effect only when the **ChargeType** parameter is set to PrePaid.\n\nDefault value: false",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "AutoRenewPeriod",
      "description": "The auto-renewal duration of the dedicated host. The **AutoRenewPeriod** parameter takes effect and is required only when the **AutoRenew** parameter is set to true. Valid values:\n\nValid values when PeriodUnit is set to Month: 1, 2, 3, 6, and 12.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "ChargeType",
      "description": "The billing method of the dedicated host. Valid values:\n\n*   PrePaid: subscription. If you set this parameter to PrePaid, make sure that you have sufficient account balance or credits. Otherwise, `InvalidPayMethod` is returned.\n*   PostPaid: pay-as-you-go.\n\nDefault value: PostPaid.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request. You can use the client to generate the token, but you must make sure that the token is unique among different requests. The **token** can contain only ASCII characters and cannot exceed 64 characters in length. For more information, see [How to ensure idempotence](~~25693~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "CpuOverCommitRatio",
      "description": "The CPU overcommit ratio. You can configure CPU overcommit ratios only for the following dedicated host types: g6s, c6s, and r6s. Valid values: 1 to 5.\n\nThe CPU overcommit ratio affects the number of available vCPUs on a dedicated host. You can use the following formula to calculate the number of available vCPUs on a dedicated host: Number of available vCPUs = Number of physical CPU cores × 2 × CPU overcommit ratio. For example, the number of physical CPU cores on each g6s dedicated host is 52. If you set the CPU overcommit ratio of a g6s dedicated host to 4, the number of available vCPUs on the dedicated host is 416. For scenarios that have minimal requirements on CPU stability or where CPU load is not heavy, such as development and test environments, you can increase the number of available vCPUs on a dedicated host by increasing the CPU overcommit ratio. This way, you can deploy more ECS instances of the same specifications on the dedicated host and reduce the unit deployment cost.",
      "position": "Query",
      "type": "Float",
      "required": false
    },
    {
      "name": "DedicatedHostClusterId",
      "description": "The ID of the dedicated host cluster in which to create the dedicated host.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DedicatedHostName",
      "description": "The name of the dedicated host. The name must be 2 to 128 characters in length, It must start with a letter and cannot start with `http://` or `https://`. It can contain letters, digits, colons (:), underscores (\\_), and hyphens (-).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DedicatedHostType",
      "description": "The dedicated host type. You can call the [DescribeDedicatedHostTypes](~~134240~~) operation to query the most recent list of dedicated host types.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Description",
      "description": "The description of the dedicated host. The description must be 2 to 256 characters in length and cannot start with `http://` or `https://`.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "MinQuantity",
      "description": "The minimum number of dedicated hosts to create. Valid values: 1 to 100.\n\n> If the number of available dedicated hosts is less than the minimum number of dedicated hosts to create, the dedicated hosts fail to be created.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "NetworkAttributes.SlbUdpTimeout",
      "description": "The timeout period for a UDP session between a Server Load Balancer (SLB) instance and the dedicated host. Unit: seconds. Valid values: 15 to 310.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "NetworkAttributes.UdpTimeout",
      "description": "The timeout period for a UDP session between a user and an Alibaba Cloud service on the dedicated host. Unit: seconds. Valid values: 15 to 310.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "Period",
      "description": "The subscription duration of the dedicated host. The `Period` parameter is required and takes effect only when the `ChargeType` parameter is set to `PrePaid`. Valid values:\n\n*   Valid values when the PeriodUnit parameter is set to Month: 1, 2, 3, 4, 5, 6, 7, 8, 9, 12, 24, 36, 48, and 60.\n*   Valid values when the PeriodUnit parameter is set to Year: 1, 2, 3, 4, and 5.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "PeriodUnit",
      "description": "The unit of the subscription duration of the dedicated host. Valid values:\n\n*   Month\n*   Year\n\nDefault value: Month.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Quantity",
      "description": "The number of dedicated hosts that you want to create. Valid values: 1 to 100.\n\nDefault value: 1.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The ID of the region in which to create the dedicated host. You can call the [DescribeRegions](~~25609~~) operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ResourceGroupId",
      "description": "The ID of the resource group to which to assign the dedicated host.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Tag",
      "description": "The tags to add to the dedicated host.",
      "position": "Query",
      "type": "RepeatList",
      "required": false,
      "sub_parameters": [
        {
          "name": "Key",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "Value",
          "position": "Query",
          "type": "String",
          "required": false
        }
      ]
    },
    {
      "name": "ZoneId",
      "description": "The ID of the zone in which to create the dedicated host.\n\nThis parameter is empty by default. If you do not specify a zone, the system selects a zone.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}