{
  "name": "AttachDisk",
  "deprecated": false,
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Bootable",
      "description": "Specifies whether to attach the disk as a system disk.\n\nDefault value: false.\n\n> If you set `Bootable` to true, the instance must be in the No System Disk state.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "DeleteWithInstance",
      "description": "Specifies whether to release the disk when the instance is released. Valid values:\n\n*   true: releases the disk when the instance is released.\n*   false: does not release the data disk when the instance is released. The disk is retained as a pay-as-you-go data disk.\n\nDefault value: false.\n\nWhen you specify this parameter, take note of the following items:\n\n*   If `OperationLocks` in the DescribeInstances response contains `\"LockReason\" : \"security\"` for the instance to which the disk is attached, the instance is locked for security reasons. Regardless of whether you set `DeleteWithInstance` to `false`, the DeleteWithInstance parameter is ignored, and the disk is released when the instance is released.\n*   You cannot specify this parameter for disks for which the multi-attach feature is enabled.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "Device",
      "description": "The device name of the disk.\n\n> This parameter will be removed in the future. We recommend that you use other parameters to ensure compatibility.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DiskId",
      "description": "The ID of the disk. The disk specified by the `DiskId` parameter and the instance specified by the `InstanceId` parameter must reside in the same zone.\n\n> For more information about the limits on attaching a data disk and a system disk, see the \"Usage notes\" section of this topic.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "InstanceId",
      "description": "The ID of the instance to which you want to attach the disk.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "KeyPairName",
      "description": "The name of the SSH key pair that you bind to the Linux instance when you attach the system disk.\n\n*   Windows instances do not support logons based on SSH key pairs. The `Password` parameter takes effect even if the KeyPairName parameter is specified.\n*   For Linux instances, the username and password-based logon method is disabled by default.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Password",
      "description": "The password that is set when you attach the system disk. The password is applicable only to the administrator and root users. The password must be 8 to 30 characters in length and must contain at least three of the following character types: uppercase letters, lowercase letters, digits, and special characters. The following special characters are supported:\n\n    ()`~!@#$%^&*-_+=|{}[]:;'<>,.?/\n\nFor Windows instances, passwords cannot start with a forward slash (/).\n\n> If `Password` is configured, we recommend that you send requests over HTTPS to prevent password leaks.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}