{
  "name": "CreateImage",
  "deprecated": false,
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Architecture",
      "description": "The system architecture of the system disk. If you specify a data disk snapshot to create the system disk of the custom image, you must use Architecture to specify the system architecture of the system disk. Valid values:\n\n*   i386\n*   x86\\_64\n*   arm64\n\nDefault value: x86\\_64.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "BootMode",
      "description": "The boot mode of the image. Valid values:\n\n*   BIOS\n*   UEFI\n\n> You must be familiar with the boot modes supported by the specified image. When you use this parameter to change the boot mode of the image, specify a boot mode supported by the image to ensure that instances that use this image can be started as expected.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request. You can use the client to generate the token, but you must make sure that the token is unique among different requests. The value of **ClientToken** can contain only ASCII characters and cannot exceed 64 characters in length. For more information, see [How to ensure idempotence](~~25693~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Description",
      "description": "The image description. The description must be 2 to 256 characters in length and cannot start with [http:// or https://.](http://https://。)",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DetectionStrategy",
      "description": "The mode that you want to use to check the source image. If you do not specify this parameter, the source image is not checked. Only Linux images can be checked. Set the value to Standard, which indicates standard check mode.\n\nThe following items are checked in standard check mode:\n\n*   Virtio: whether the virtio driver is installed.\n*   Fstab: whether mounting configurations in the fstab file are correct.\n*   Grub: whether GRand Unified Bootloader (GRUB) configurations are correct.\n*   SystemImage: whether the image is valid. Do not import images that are in the ISO format or empty.\n*   CloudInit: whether cloud-init is installed.\n*   NVMe: whether the Non-Volatile Memory Express (NVMe) driver is installed.\n*   Selinux: whether SElinux is enabled.\n*   OnlineResizeFS: whether the root partition can be automatically resized.\n*   Dhcp: whether Dynamic Host Configuration Protocol (DHCP) is enabled for network interface controllers (NICs).\n*   RtcTimeMode: the RTC time mode.\n*   Platform: the platform. Examples: Linux and Windows.\n*   OSVersion: the operating system version. Example: Centos 7.9.\n*   Architecture: the architecture. Examples: ARM and x86\\_64.\n*   BootMode: the boot mode. Examples: UEFI and Legacy.\n*   KernelVersion: the kernel version.\n*   CloudAssistant: whether the Cloud Assistant client is installed.\n*   SecurityCenterAgent: whether the Security Center agent is installed.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DiskDeviceMapping",
      "description": "The custom images.",
      "position": "Query",
      "type": "RepeatList",
      "required": false,
      "sub_parameters": [
        {
          "name": "Device",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "DiskType",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "Size",
          "position": "Query",
          "type": "Integer",
          "required": false
        },
        {
          "name": "SnapshotId",
          "position": "Query",
          "type": "String",
          "required": false
        }
      ]
    },
    {
      "name": "ImageFamily",
      "description": "The name of the image family. The name must be 2 to 128 characters in length and can contain digits, colons (:), underscores (\\_), and hyphens (-). The name must start with a letter and cannot start with acs: or aliyun. It cannot contain [http:// or https://.](http://https://。、（:）、（\\_）（-）。)",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ImageName",
      "description": "The image name. The name must be 2 to 128 characters in length and can contain digits, colons (:), underscores (\\_), and hyphens (-). The name must start with a letter but cannot start with [http:// or https://.](http://https://。、（:）、（\\_）（-）。)",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ImageVersion",
      "description": "The image version.\n\n> If you specify an instance by configuring `InstanceId`, and the instance uses an Alibaba Cloud Marketplace image or a custom image that is created from an Alibaba Cloud Marketplace image, you must leave this parameter empty or set this parameter to the value of ImageVersion of the instance.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "InstanceId",
      "description": "The instance ID.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Platform",
      "description": "The distribution of the operating system for the system disk in the custom image. If you specify a data disk snapshot to create the system disk of the custom image, you must use Platform to specify the distribution of the operating system for the system disk. Valid values:\n\n*   CentOS\n*   Ubuntu\n*   SUSE\n*   OpenSUSE\n*   RedHat\n*   Debian\n*   CoreOS\n*   Aliyun\n*   Windows Server 2012\n*   Windows 7\n*   Customized Linux\n*   Others Linux\n\nDefault value: Others Linux.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the custom image that you want to create. You can call the [DescribeRegions](~~25609~~) operation to query the most recent list of regions.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ResourceGroupId",
      "description": "The ID of the resource group to which you want to assign the custom image. If you leave this parameter empty, the image is assigned to the default resource group.\n\n> If you call the CreateImage operation as a RAM user who is not authorized to manage the default resource group and leave `ResourceGroupId` empty, the `Forbidden: User not authorized to operate on the specified resource` error message is returned. Before you call the CreateImage operation again, you must specify the ID of a resource group that the RAM user is authorized to manage or authorize the RAM user to manage the default resource group.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SnapshotId",
      "description": "The ID of the snapshot that is used to create the custom image.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Tag",
      "description": "The tags.",
      "position": "Query",
      "type": "RepeatList",
      "required": false,
      "sub_parameters": [
        {
          "name": "Key",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "Value",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "key",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "value",
          "position": "Query",
          "type": "String",
          "required": false
        }
      ]
    }
  ]
}