{
  "name": "CreateCapacityReservation",
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotency of the request. You can use the client to generate the token, but you must make sure that the token is unique among different requests. The `token` can contain only ASCII characters and cannot exceed 64 characters in length. For more information, see [How to ensure idempotence](~~25693~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Description",
      "description": "The description of the capacity reservation. The description must be 2 to 256 characters in length and cannot start with `http://` or `https://`.\n\nThis parameter is empty by default.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EndTime",
      "description": "The time when the capacity reservation expires. Specify the time in the ISO 8601 standard in the `yyyy-MM-ddTHH:mm:ssZ` format. The time must be in UTC. For more information, see [ISO 8601](~~25696~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EndTimeType",
      "description": "The release mode of the capacity reservation. Valid values:\n\n*   Limited: The capacity reservation is automatically released at a specified time. If you specify this parameter, you must specify the `EndTime` parameter.\n*   Unlimited: The capacity reservation is manually released. The capacity reservation can be released anytime.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "InstanceAmount",
      "description": "The total number of instances for which the capacity of an instance type is reserved.",
      "position": "Query",
      "type": "Integer",
      "required": true
    },
    {
      "name": "InstanceType",
      "description": "The instance type. You can create a capacity reservation to reserve the capacity of only one instance type. You can call the [DescribeInstanceTypes](~~25620~~) operation to query the instance types provided by ECS.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Platform",
      "description": "The operating system of the image used by the instance. This parameter corresponds to the `Platform` parameter of regional reserved instances. If the operating system of a capacity reservation matches the operating system of a regional reserved instance, you can apply the regional reserved instance to offset fees of the unused capacity of the capacity reservation. Valid values:\n\n*   Windows: Windows Server operating system\n*   Linux: Linux and UNIX-like operating system\n\nDefault value: Linux.\n\n> This parameter is unavailable.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "PrivatePoolOptions.MatchCriteria",
      "description": "The type of the private pool to generate after the capacity reservation takes effect. Valid values:\n\n*   Open: open private pool\n*   Target: targeted private pool\n\nDefault value: Open.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "PrivatePoolOptions.Name",
      "description": "The capacity reservation name. The name must be 2 to 128 characters in length. It must start with a letter but cannot start with `http://` or `https://`. The name can contain letters, digits, colons (:), underscores (\\_), and hyphens (-).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The ID of the region in which to create the capacity reservation. You can call the [DescribeRegions](~~25609~~) operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ResourceGroupId",
      "description": "The ID of the resource group to which you want to assign the capacity reservation.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "StartTime",
      "description": "The mode in which the capacity reservation takes effect. You can call the CreateCapacityReservation operation to create only immediate capacity reservations.\n\n> If you do not specify this parameter, the capacity reservation immediately takes effect.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Tag",
      "description": "The tags to add to the capacity reservation.",
      "position": "Query",
      "type": "RepeatList",
      "required": false,
      "sub_parameters": [
        {
          "name": "Key",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "Value",
          "position": "Query",
          "type": "String",
          "required": false
        }
      ]
    },
    {
      "name": "ZoneId",
      "description": "The ID of the zone in which you want to create the capacity reservation. A capacity reservation can reserve resources within only one zone.",
      "position": "Query",
      "type": "RepeatList",
      "required": true
    }
  ]
}