{
  "name": "DeleteInstances",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request. You can use the client to generate the token, but you must make sure that the token is unique among different requests. **The token can contain only ASCII characters and cannot exceed 64 characters in length.** For more information, see [How to ensure idempotence](~~25693~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DryRun",
      "description": "Specifies whether to perform only a dry run, without performing the actual request.\n\n*   true: performs only a dry run. The system checks the request for potential issues, including invalid AccessKey pairs, unauthorized Resource Access Management (RAM) users, and missing parameter values. If the request fails the dry run, an error message is returned. If the request passes the dry run, the DRYRUN.SUCCESS error code is returned.\n*   false: performs a dry run and performs the actual request. If the request passes the dry run, a 2xx HTTP status code is returned and the operation is performed.\n\nDefault value: false.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "Force",
      "description": "Specifies whether to forcefully release the ECS instance in the **Running** (`Running`) state. Valid values:\n\n*   true: forcefully releases the ECS instance in the **Running** (`Running`) state.\n*   false: normally releases the ECS instance. This value is valid only if the instance is in the **Stopped** (`Stopped`) state.\n\nDefault value: false.\n\n**\n\n**Warning** When Force is set to true, this operation is equivalent to a power-off operation. Temporary data in the memory and storage of the instance is erased and cannot be restored.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "ForceStop",
      "description": "Specifies whether to forcefully stop the ECS instance in the **Running** (`Running`) state before the instance is released. This parameter takes effect only when `Force` is set to true. Valid values:\n\n*   true: forcefully stops and releases the ECS instance. In this case, this operation is equivalent to a power-off operation. The instance directly enters the resource release process.\n\n    **\n\n    **Warning** A forceful stop and release is equivalent to a power-off operation. Temporary data in the memory and storage of the instance is erased and cannot be restored.\n\n*   false: stops the ECS instance in the normal stop process and then releases the instance. In this case, the release process takes several minutes to complete. You can configure business drainage actions to reduce the noise of the business system on operating system shutdown.\n\nDefault value: true.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "InstanceId",
      "description": "The IDs of ECS instances. You can specify 1 to 100 ECS instances.",
      "position": "Query",
      "type": "RepeatList",
      "required": true
    },
    {
      "name": "RegionId",
      "description": "The region ID of the instance. You can call the [DescribeRegions](~~25609~~) operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "TerminateSubscription",
      "description": "Specifies whether to release the expired subscription instance.\n\n*   true\n*   false\n\nDefault value: false.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    }
  ]
}