{
  "name": "DescribeSendFileResults",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "InstanceId",
      "description": "The ID of the instance for which you want to query file sending records.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "InvocationStatus",
      "description": "The overall sending status of the file. The overall sending status of the file varies based on the sending status of the file on all destination instances. Valid values:\n\n*   Pending: The file is being verified or sent. If the sending state of the file on at least one instance is Pending, the overall sending state of the file is Pending.\n*   Running: The file is being sent to the instances. If the sending state of the file on at least one instance is Running, the overall sending state of the file is Running.\n*   Success: The file is sent. If the sending state of the file on all instances is Success, the overall sending state of the file is Success.\n*   Failed: The file fails to be sent. If the sending state of the file on all instances is Failed, the overall sending state of the file is Failed.\n*   PartialFailed: The file sending task succeeds on some instances and fails on other instances. If the sending state of the file is Success on some instances and is Failed on other instances, the overall sending state of the file is PartialFailed.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "InvokeId",
      "description": "The ID of the file sending task.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "MaxResults",
      "description": "The maximum number of entries per page.\n\nValid values: 1 to 50.\n\nDefault value: 10.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "Name",
      "description": "The name of the file whose sending records you want to query.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "NextToken",
      "description": "The pagination token that is used in the next request to retrieve a new page of results. You must specify the token that is obtained from the previous query as the value of NextToken.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "PageNumber",
      "description": ">  This parameter will be removed in the future. We recommend that you use NextToken and MaxResults for a paged query.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "PageSize",
      "description": ">  This parameter will be removed in the future. We recommend that you use NextToken and MaxResults for a paged query.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the ECS instance. You can call the [DescribeRegions](~~25609~~) operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ResourceGroupId",
      "description": "The ID of the resource group. After you set this parameter, file sending results in the specified resource group are queried.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Tag",
      "description": "The tags of the file sending task.",
      "position": "Query",
      "type": "RepeatList",
      "required": false,
      "sub_parameters": [
        {
          "name": "Key",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "Value",
          "position": "Query",
          "type": "String",
          "required": false
        }
      ]
    }
  ]
}