{
  "name": "DescribeSpotPriceHistory",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "EndTime",
      "description": "The end of the time range to query. Specify the time in the [ISO 8601 standard](~~25696~~) in the `yyyy-MM-ddTHH:mm:ssZ` format. The time must be in UTC.\n\nThis parameter is empty by default. If this parameter is empty, the current time is used.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "InstanceType",
      "description": "The beginning of the time range to query. Specify the time in the [ISO 8601](~~25696~~) standard in the `yyyy-MM-ddTHH:mm:ssZ` format. The time must be in UTC. The specified time can be up to 30 days earlier than the specified EndTime value.\n\nThis parameter is empty by default. If this parameter is empty, the time that is 3 hours earlier than the specified EndTime value is used.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "IoOptimized",
      "description": "Specifies whether the instance is I/O optimized. Valid values:\n\n*   optimized: The instance is I/O optimized.\n*   none: The instance is not I/O optimized.\n\nFor instances of generation I instance families, the default value is none.\n\nFor instances of other instance families, the default value is optimized.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "NetworkType",
      "description": "The network type of the spot instance. Valid values:\n\n*   classic: classic network\n*   vpc: Virtual Private Cloud (VPC)",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "OSType",
      "description": "The type of the operating system platform. Valid values:\n\n- linux\n- windows",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Offset",
      "description": "The line from which the query starts.\n\nDefault value: 0",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The zone ID of the spot instance.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "SpotDuration",
      "description": "The protection period of the spot instance. Unit: hours. Default value: 1. Valid values:\n\n*   1: After a spot instance is created, Alibaba Cloud ensures that the instance is not automatically released within 1 hour. After the 1-hour protection period ends, the system compares the bid price with the market price and checks the resource inventory to determine whether to retain or release the instance.\n*   0: After a spot instance is created, Alibaba Cloud does not ensure that the instance runs for 1 hour. The system compares the bid price with the market price and checks the resource inventory to determine whether to retain or release the instance.\n\nAlibaba Cloud sends an ECS system event to notify you 5 minutes before the instance is released. Spot instances are billed by second. We recommend that you specify a protection period based on your business requirements.\n\n>  This parameter takes effect only if you set SpotStrategy to SpotWithPriceLimit or SpotAsPriceGo.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "StartTime",
      "description": "The beginning of the time range to query. The value of this parameter and the value of EndTime can be up to 30 days apart. Specify the time in the [ISO 8601 standard](~~25696~~) in the `yyyy-MM-ddTHH:mm:ssZ` format. The time must be in UTC.\n\nThis parameter is left empty by default. If this parameter is empty, the time that is 3 hours earlier than the value of EndTime is used.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ZoneId",
      "description": "The spot price (market price) of the spot instance.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}