{
  "name": "DescribeInstanceTypes",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AdditionalAttributes",
      "description": "",
      "position": "Query",
      "type": "RepeatList",
      "required": false
    },
    {
      "name": "CpuArchitecture",
      "description": "The CPU architecture. Valid values:\n\n*   X86\n*   ARM",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "CpuArchitectures",
      "description": "The CPU architectures of instance types. You can specify 1 or 2 CPU architectures.",
      "position": "Query",
      "type": "RepeatList",
      "required": false
    },
    {
      "name": "GPUSpec",
      "description": "The GPU model.\n\n>  Fuzzy match is supported. For example, if an instance type provides NVIDIA V100 GPUs and you set this parameter to NVIDIA, information about the instance type is queried.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "GpuSpecs",
      "description": "The GPU models of instance types. You can specify 1 to 10 GPU models.",
      "position": "Query",
      "type": "RepeatList",
      "required": false
    },
    {
      "name": "InstanceCategories",
      "description": "The categories of instance types. You can specify 1 to 10 categories of instance types.",
      "position": "Query",
      "type": "RepeatList",
      "required": false
    },
    {
      "name": "InstanceCategory",
      "description": "The category of the instance type. Valid values:\n\n*   General-purpose: general-purpose instance type\n*   Compute-optimized: compute-optimized instance type\n*   Memory-optimized: memory-optimized instance type\n*   Big data: big data instance type\n*   Local SSDs: instance type with local SSDs\n*   High Clock Speed: instance type with high clock speeds\n*   Enhanced: enhanced instance type\n*   Shared: shared instance type\n*   Compute-optimized with GPU: GPU-accelerated compute-optimized instance type\n*   Visual Compute-optimized: visual compute-optimized instance type\n*   Heterogeneous Service: heterogeneous service instance type\n*   Compute-optimized with FPGA: FPGA-accelerated compute-optimized instance type\n*   Compute-optimized with NPU: NPU-accelerated compute-optimized instance type\n*   ECS Bare Metal: ECS Bare Metal Instance type\n*   Super Computing Cluster: Super Computing Cluster (SCC) instance type\n*   High Performance Compute: high-performance computing instance type",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "InstanceFamilyLevel",
      "description": "The level of the instance family. Valid values:\n\n*   EntryLevel: entry level (shared)\n*   EnterpriseLevel: enterprise level\n*   CreditEntryLevel: credit-based entry level",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "InstanceTypeFamilies",
      "description": "The instance families. You can specify 1 to 10 instance families.",
      "position": "Query",
      "type": "RepeatList",
      "required": false
    },
    {
      "name": "InstanceTypeFamily",
      "description": "The instance family to which the instance type belongs. For information about the valid values of this parameter, see [DescribeInstanceTypeFamilies](~~25621~~).\n\nFor more information about instance families, see [Instance families](~~25378~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "InstanceTypes",
      "description": "The instance types. You can specify 1 to 10 instance types. If this parameter is empty, information about all instance types is queried.",
      "position": "Query",
      "type": "RepeatList",
      "required": false
    },
    {
      "name": "LocalStorageCategories",
      "description": "The categories of local disks used by instance types. You can specify 1 or 2 categories of local disks.",
      "position": "Query",
      "type": "RepeatList",
      "required": false
    },
    {
      "name": "LocalStorageCategory",
      "description": "The category of local disks. For more information, see [Local disks](~~63138#section_n2w\\_8yc\\_5u1~~). Valid values:\n\n*   local_hdd_pro: local Serial Advanced Technology Attachment (SATA) HDDs, which are attached to d1ne or d1 instances.\n*   local_ssd_pro: local Non-Volatile Memory Express (NVMe) SSDs, which are attached to i2, i2g, i1, ga1, or gn5 instances.\n\nValid values:\n\n*   local_hdd_pro\n*   local_ssd_pro",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "MaxResults",
      "description": "The maximum number of entries per page. Valid values: 1 to 1600.\n\nDefault value: 1600.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "MaximumCpuCoreCount",
      "description": "The maximum number of vCPUs. The value must be a positive integer.\n\n>  If an instance type has more vCPUs than the specified value, information about the instance type is not queried.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "MaximumCpuSpeedFrequency",
      "description": "The maximum clock speed.\n\n>  If an instance type uses processors that have a higher clock speed than the specified value, information about the instance type is not queried.",
      "position": "Query",
      "type": "Float",
      "required": false
    },
    {
      "name": "MaximumCpuTurboFrequency",
      "description": "The maximum turbo frequency.\n\n>  If an instance type uses processors that deliver a higher turbo frequency than the specified value, information about the instance type is not queried.",
      "position": "Query",
      "type": "Float",
      "required": false
    },
    {
      "name": "MaximumGPUAmount",
      "description": "The maximum number of GPUs. The value must be a positive integer.\n\n>  If an instance type provides more GPUs than the specified value, information about the instance type is not queried.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "MaximumMemorySize",
      "description": "The maximum memory size. Unit: GiB.\n\n>  If the memory size of an instance type is larger than the specified value, information about the instance type is not queried.",
      "position": "Query",
      "type": "Float",
      "required": false
    },
    {
      "name": "MinimumBaselineCredit",
      "description": "The minimum baseline CPU performance (overall baseline performance of all vCPUs) of a t5 or t6 burstable instance.\n\n>  If a t5 or t6 instance type provides baseline CPU performance lower than the specified value, information about the instance type is not queried.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "MinimumCpuCoreCount",
      "description": "The minimum number of vCPUs. The value must be a positive integer.\n\n>  If an instance type has fewer vCPUs than the specified value, information about the instance type is not queried.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "MinimumCpuSpeedFrequency",
      "description": "The minimum clock speed.\n\n>  If an instance type uses processors that have a lower clock speed than the specified value, information about the instance type is not queried.",
      "position": "Query",
      "type": "Float",
      "required": false
    },
    {
      "name": "MinimumCpuTurboFrequency",
      "description": "The minimum turbo frequency.\n\n>  If an instance type uses processors that deliver a lower turbo frequency than the specified value, information about the instance type is not queried.",
      "position": "Query",
      "type": "Float",
      "required": false
    },
    {
      "name": "MinimumDiskQuantity",
      "description": "The minimum number of cloud disks per instance.\n\n>  If an instance type supports fewer cloud disks than the specified value, information about the instance type is not queried.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "MinimumEniIpv6AddressQuantity",
      "description": "The minimum number of IPv6 addresses per ENI.\n\n>  If an instance type supports fewer IPv6 addresses per ENI than the specified value, information about the instance type is not queried.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "MinimumEniPrivateIpAddressQuantity",
      "description": "The minimum number of IPv4 addresses per ENI.\n\n>  If an instance type supports fewer IPv4 addresses per ENI than the specified value, information about the instance type is not queried.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "MinimumEniQuantity",
      "description": "The minimum number of elastic network interfaces (ENIs) per instance.\n\n>  If an instance type supports fewer ENIs than the specified value, information about the instance type is not queried.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "MinimumEriQuantity",
      "description": "The minimum number of ERIs per instance.\n\n>  If an instance type supports fewer ERIs than the specified value, information about the instance type is not queried.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "MinimumGPUAmount",
      "description": "The minimum number of GPUs. The value must be a positive integer.\n\n>  If an instance type provides fewer GPUs than the specified value, information about the instance type is not queried.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "MinimumInitialCredit",
      "description": "The minimum initial CPU credits of a t5 or t6 burstable instance.\n\n>  If a t5 or t6 instance type provides less initial vCPU credits than the specified value, information about the instance type is not queried.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "MinimumInstanceBandwidthRx",
      "description": "The minimum inbound internal bandwidth. Unit: Kbit/s.\n\n>  If an instance type provides an inbound internal bandwidth that is lower than the specified value, information about the instance type is not queried.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "MinimumInstanceBandwidthTx",
      "description": "The minimum outbound internal bandwidth. Unit: Kbit/s.\n\n>  If an instance type provides an outbound internal bandwidth that is lower than the specified value, information about the instance type is not queried.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "MinimumInstancePpsRx",
      "description": "The minimum inbound packet forwarding rate over the internal network. Unit: pps.\n\n>  If an instance type provides an inbound packet forwarding rate over the internal network that is lower than the specified value, information about the instance type is not queried.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "MinimumInstancePpsTx",
      "description": "The minimum outbound packet forwarding rate over the internal network. Unit: pps.\n\n>  If an instance type provides an outbound packet forwarding rate over the internal network that is lower than the specified value, information about the instance type is not queried.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "MinimumLocalStorageAmount",
      "description": "The minimum number of local disks per instance.\n\n>  If an instance type supports fewer local disks than the specified value, information about the instance type is not queried.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "MinimumLocalStorageCapacity",
      "description": "The capacity of each local disk attached per instance. Unit: GiB.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "MinimumMemorySize",
      "description": "The minimum memory size. Unit: GiB.\n\n>  If the memory size of an instance type is smaller than the specified value, information about the instance type is not queried.",
      "position": "Query",
      "type": "Float",
      "required": false
    },
    {
      "name": "MinimumPrimaryEniQueueNumber",
      "description": "The minimum default number of queues per primary network interface controller (NIC).\n\n>  If an instance type supports fewer queues per primary NIC than the specified value, information about the instance type is not queried.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "MinimumQueuePairNumber",
      "description": "The minimum number of queue pair (QP) queues per elastic RDMA interface (ERI).\n\n>  If an instance type supports fewer QP queues per ERI than the specified value, information about the instance type is not queried.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "MinimumSecondaryEniQueueNumber",
      "description": "The minimum default number of queues per secondary NIC.\n\n>  If an instance type supports fewer queues per secondary NIC than the specified value, information about the instance type is not queried.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "NextToken",
      "description": "The query token. Set the value to the NextToken value returned in the previous call to the DescribeInstanceTypes operation. You do not need to specify this parameter for the first request.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "NvmeSupport",
      "description": "Specifies whether cloud disks can be attached by using the NVMe protocol. Valid values:\n\n*   required: Cloud disks can be attached by using the NVMe protocol.\n*   unsupported: Cloud disks cannot be attached by using the NVMe protocol.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "PhysicalProcessorModel",
      "description": "The CPU model.\n\n>  Fuzzy match is supported. For example, if an instance type uses Intel Xeon (Ice Lake) Platinum 8369B processors and you set this parameter to Intel, information about the instance type is queried.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "PhysicalProcessorModels",
      "description": "The CPU models of instance types. You can specify 1 to 10 CPU models.",
      "position": "Query",
      "type": "RepeatList",
      "required": false
    }
  ]
}