{
  "name": "DescribeDedicatedHosts",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "DedicatedHostClusterId",
      "description": "The ID of the dedicated host cluster.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DedicatedHostIds",
      "description": "The list of DDH IDs. You can specify up to 100 deployment set IDs in each request. Separate the deployment set IDs with commas (,).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DedicatedHostName",
      "description": "The name of the dedicated host.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DedicatedHostType",
      "description": "The type of the DDH. You can call the [DescribeDedicatedHostTypes](~~134240~~) operation to query the most recent list of DDH types.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "LockReason",
      "description": "The reason why the dedicated host is locked. Valid values:\n\n*   financial: The dedicated host is locked due to overdue payments.\n*   security: The dedicated host is locked due to security reasons.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "MaxResults",
      "description": "The maximum number of entries per page. If you specify this parameter, both MaxResults and NextToken are used for a paged query.\n\nValid values: 1 to 100.\n\nDefault value: 10.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "NextToken",
      "description": "The pagination token that is used in the next request to retrieve a new page of results. You do not need to specify this parameter for the first request. You must specify the token that is obtained from the previous query as the value of NextToken.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "PageNumber",
      "description": ">  This parameter will be removed in the future. You can use NextToken and MaxResults for a paged query.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "PageSize",
      "description": ">  This parameter will be removed in the future. You can use NextToken and MaxResults for a paged query.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "QueryInventory",
      "description": "",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the dedicated host. You can call the [DescribeRegions](~~25609~~) operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ResourceGroupId",
      "description": "The ID of the resource group to which the dedicated host belongs. When this parameter is specified to query resources, up to 1,000 resources that belong to the specified resource group can be displayed in the response.\n\n> Resources in the default resource group are displayed in the response regardless of how this parameter is set.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SocketDetails",
      "description": "Specifies whether to display socket information. You can view the remaining resources (vCPUs, memory usage, remaining resources, and total resources) based on the capacity information of the socket dimension. Then you can determine whether ECS instances of the corresponding specifications can be created. Valid values:\n\n*   true Only some DDHs support the information about resources in the socket dimension. For more information, see [View and export information about DDHs](~~68989~~).\n*   false\n\n>  Each DDH generally has two CPUs, and each CPU corresponds to Socket 0 and Socket 1. To maximize the performance of an ECS instance on a DDH, ECS instances are not created across sockets.\n\n*   If one socket has available computing resources for creating the ECS instance, creation succeeds.\n\n*   If not, creation fails even if the combined available resources of both sockets are sufficient. Although the remaining resources of the two sockets on the DDH are larger than the ECS instance type, the ECS instance cannot be created.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Status",
      "description": "The service state of the dedicated host. Valid values:\n\n*   Available: The dedicated host is running normally.\n*   UnderAssessment: The dedicated host is available but has potential risks that may cause the ECS instances on the dedicated host to fail.\n*   PermanentFailure: The dedicated host encounters permanent failures and is unavailable.\n*   TempUnavailable: The dedicated host is temporarily unavailable.\n*   Redeploying: The dedicated host is being restored.\n\nDefault value: Available.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Tag",
      "description": "The list of tags. The list length ranges from 0 to 20.",
      "position": "Query",
      "type": "RepeatList",
      "required": false,
      "sub_parameters": [
        {
          "name": "Key",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "Value",
          "position": "Query",
          "type": "String",
          "required": false
        }
      ]
    },
    {
      "name": "ZoneId",
      "description": "The zone ID of the dedicated host. You can call the [DescribeZones](~~25610~~) operation to query the most recent zone list.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}