{
  "name": "ModifyImageAttribute",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "BootMode",
      "description": "The new boot mode of the image. Valid values:\n\n*   BIOS: BIOS mode\n*   UEFI: Unified Extensible Firmware Interface (UEFI) mode\n*   UEFI-Preferred: BIOS mode and UEFI mode\n\n>  Before you change this parameter, make sure that you are familiar with the boot modes supported by the image. If you specify a boot mode that is not supported by the image, ECS instances created from the image cannot start as expected. For information about the boot modes of images, see the [Boot modes of custom images](~~2244655#b9caa9b8bb1wf~~) section of the \"Best practices for ECS instance boot modes\" topic.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Description",
      "description": "The new description of the custom image. The description must be 2 to 256 characters in length It cannot start with [http:// or https://.](http://https://。)\n\nThis parameter is empty by default, which specifies that the original description is retained.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DryRun",
      "description": "",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "Features",
      "description": "The attributes of the custom image.",
      "position": "Query",
      "type": "Struct",
      "required": false
    },
    {
      "name": "ImageFamily",
      "description": "The name of the image family. The name must be 2 to 128 characters in length. It must start with a letter and cannot start with acs: or aliyun. [It cannot contain http:// or https://. It can contain letters, digits, periods (.), colons (:), underscores (\\_), and hyphens (-).](http://https://。、（.）、（:）、（\\_）（-）。)\n\nBy default, this parameter is empty.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ImageId",
      "description": "The ID of the custom image.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ImageName",
      "description": "The name of the custom image. The name must be 2 to 128 characters in length. It must start with a letter and cannot start with acs: or aliyun. [It cannot contain http:// or https://. It can contain letters, digits, periods (.), colons (:), underscores (\\_), and hyphens (-).](http://https://。、（.）、（:）、（\\_）（-）。)\n\nBy default, this parameter is empty. In this case, the original name is retained.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "LicenseType",
      "description": "The type of the license that is used to activate the operating system after the image is imported. Set the value to BYOL.\n\nBYOL: The license that comes with the source operating system is used. When you use the BYOL license, make sure that your license key is supported by Alibaba Cloud.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the custom image. You can call the [DescribeRegions](~~25609~~) operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Status",
      "description": "The new state of the custom image. Valid values:\n\n*   Deprecated: puts the image into the Deprecated state. If the custom image is shared, you must unshare it before you can put it into the Deprecated state. Images in the Deprecated state cannot be shared or copied, but can be used to create instances or replace system disks.\n*   Available: puts the image into the Available state. You can restore an image from the Deprecated state to the Available state.\n\n> If you want to roll back a custom image in the image family to a previous version, you can put the latest available custom image into the Deprecated state. If no custom images are in the Available state within the image family, an image family cannot be used to create instances. Proceed with caution if only a single custom image is in the Available state within the image family.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}