{
  "name": "ModifyDiskAttribute",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "BurstingEnabled",
      "description": "Specifies whether to enable performance burst for the disk if the disk supports performance burst. Valid values:\n\n*   true\n*   false\n\n>  An error is reported if you specify this parameter for a disk that does not support performance burst.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "DeleteAutoSnapshot",
      "description": "Specifies whether to delete the automatic snapshots of the disk when the disk is released. Valid values:\n\n*   true\n*   false\n\nThis parameter is empty by default, which indicates that the current value remains unchanged.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "DeleteWithInstance",
      "description": "Specifies whether to release the disk together with the associated instance. This parameter is empty by default, which indicates that the current value remains unchanged.\n\nAn error is returned if you set `DeleteWithInstance` to `false` in one of the following cases:\n\n*   The disk is a local disk.\n*   The disk is a basic disk and is not removable. If the Portable attribute of a disk is set to false, the disk is not removable.\n\n**\n\n**Warning** If you set DeleteWithInstance to false and the instance to which the disk is attached is locked for security reasons, the DeleteWithInstance attribute of the disk is ignored and the disk is released together with the instance. If \"LockReason\" : \"security\" is displayed in the response when you query information about an instance, the instance is locked for security reasons.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "Description",
      "description": "The description of the disk. The description must be 2 to 256 characters in length. It cannot start with `http://` or `https://`.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DiskId",
      "description": "The ID of the disk whose attributes you want to modify.\n\n>  You can specify `DiskId` or `DiskIds.N`, but not both.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DiskIds",
      "description": "The IDs of the disks whose attributes you want to modify. Valid values of N: 0 to 100.\n\n>  You can specify `DiskId` or `DiskIds.N`, but not both.",
      "position": "Query",
      "type": "RepeatList",
      "required": false
    },
    {
      "name": "DiskName",
      "description": "The name of the disk. The name must be 2 to 128 characters in length and can contain Unicode characters under the Decimal Number category and the categories whose names contain Letter. The name can also contain colons (:), underscores (\\_), periods (.), and hyphens (-).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EnableAutoSnapshot",
      "description": "Specifies whether to enable the automatic snapshot policy feature. Valid values:\n\n*   true: enables the automatic snapshot policy feature for the cloud disk.\n*   false: disables the automatic snapshot policy feature for the cloud disk.\n\nThis parameter is empty by default, which indicates that the current value remains unchanged.\n\n>  This parameter is deprecated. By default, the automatic snapshot policy feature is enabled for cloud disks. You only need to apply an automatic snapshot policy to a cloud disk before you can use the automatic snapshot policy.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the command. You can call the [DescribeRegions](~~25609~~) operation to query the most recent list of regions.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}