{
  "name": "ModifyInstanceDeployment",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Affinity",
      "description": "Specifies whether to associate the instance with a dedicated host. Valid values:\n\n*   host: associates the instance with a dedicated host. When you start a stopped instance in economical mode, the instance remains on its original dedicated host.\n*   default: does not associate the instance with a dedicated host. When you start a stopped instance in economical mode, the instance can be automatically deployed to another dedicated host in the automatic deployment resource pool if the resources of the original dedicated host are insufficient.\n\nIf you want to migrate the instance from a shared host to a dedicated host, use the default value. Default value: default.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DedicatedHostClusterId",
      "description": "The ID of the dedicated host cluster.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DedicatedHostId",
      "description": "The ID of the destination dedicated host. You can call the [DescribeDedicatedHosts](~~134242~~) operation to query the most recent list of dedicated hosts.\n\nWhen you migrate an instance from a shared host to a dedicated host or between dedicated hosts, take note of the following items:\n\n*   To migrate the instance to a specific dedicated host, specify this parameter.\n*   To migrate the instance to a system-selected dedicated host, leave this parameter empty and set `Tenancy` to host.\n\nFor information about the automatic deployment feature, see [Functions and features](~~118938~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DeploymentSetGroupNo",
      "description": "The number of the deployment set group in which to deploy the instance in the destination deployment set. This parameter is valid only when the destination deployment set uses the high availability group strategy (AvailabilityGroup). Valid values: 1 to 7.\n\n> If you call this operation to deploy an instance to a deployment set that uses the high availability group strategy (`AvailablilityGroup`) and leave this parameter empty, the system evenly distributes instances among the deployment set groups in the deployment set. If you call this operation to change the deployment set of an instance and specify the current deployment set of the instance as the destination deployment set, the system evenly distributes instances again among the deployment set groups in the deployment set.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "DeploymentSetId",
      "description": "The ID of the destination deployment set.\n\nThis parameter is required when you add an instance to a deployment set or change the deployment set of an instance.\n\n> You cannot change the deployment set when you modify dedicated host configurations, including the `Tenancy`, `Affinity`, and `DedicatedHostId` parameters.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Force",
      "description": "Specifies whether to forcefully change the host of the instance when the deployment set of the instance is changed. Valid values:\n\n*   true: forcefully changes the host of the instance when the deployment set of the instance is changed. Hosts can be forcefully changed only for instances in the Running (Running) or Stopped (Stopped) state. The instances that are in the Stopped (Stopped) state do not include pay-as-you-go instances that are stopped in economical mode.\n\n    **\n\n    **Note** If the specified instance has local disks attached, the local disks are forcefully changed when the host of the instance is forcefully changed. This may cause data loss in the local disks. Proceed with caution.\n\n*   false: does not forcefully change the host of the instance when the deployment set of the instance is changed. You can add the instance to a deployment set only when the instance remains on the current host. When the Force parameter is set to false, the deployment set may fail to be changed.\n\nDefault value: false.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "InstanceId",
      "description": "The ID of the instance.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "InstanceType",
      "description": "The instance type to which the instance is changed. You can call the [DescribeInstanceTypes](~~25620~~) operation to query the most recent list of instance types.\n\nYou can change the instance type of an instance when you migrate the instance to a dedicated host. The new instance type must match the type of the specified dedicated host. For more information, see [Dedicated host types](~~68564~~).\n\n*   If you specify this parameter, you must also specify `DedicatedHostId`.\n*   You cannot change the instance type of an instance if you use the automatic deployment feature to migrate the instance.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "MigrationType",
      "description": "Specifies whether to stop the instance before it is migrated to the destination dedicated host. Valid values:\n\n*   reboot: stops the instance before it is migrated.\n*   live: migrates the instance without stopping it. If you set MigrationType to live, you must specify DedicatedHostId. In this case, you cannot change the instance type of the instance when the instance is migrated.\n\nDefault value: reboot.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the instance. You can call the [DescribeRegions](~~25609~~) operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "RemoveFromDeploymentSet",
      "description": "Specifies whether to remove the specified instance from the specified deployment set. Valid values:\n\n*   true\n*   false\n\nDefault value: false.\n\n> If you set this parameter to true, you must specify InstanceId and DeploymentSetId and make sure that the specified instance belongs to the specified deployment set.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "Tenancy",
      "description": "Specifies whether to deploy the instance on a dedicated host. Set the value to host, which indicates that the instance is deployed on a dedicated host.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}