{
  "name": "ModifyInstanceVpcAttribute",
  "deprecated": false,
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "InstanceId",
      "description": "The ID of the instance.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "PrivateIpAddress",
      "description": "The new private IP address of the instance.\n\n> The value of `PrivateIpAddress` depends on the value of `VSwitchId`. The specified IP address must be within the CIDR block of the specified vSwitch.\n\nBy default, if this parameter is not specified, a private IP address is randomly assigned from the CIDR block of the specified vSwitch.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SecurityGroupId",
      "description": "The ID of security group N to which the instance belongs after the VPC is changed. This parameter is required only when the `VpcId` parameter is specified.\n\n*   The specified security groups must be of the same type.\n*   You can specify one or more security groups. The valid values of N depend on the maximum number of security groups to which an instance can belong. For more information, see [Limits](~~25412~~).\n*   The specified security groups must belong to the VPC specified by the `VpcId` parameter.",
      "position": "Query",
      "type": "RepeatList",
      "required": false
    },
    {
      "name": "VSwitchId",
      "description": "The ID of the vSwitch.\n\n*   If this parameter is set to the ID of the current vSwitch, the vSwitch of the instance remains unchanged.\n*   If this parameter is set to the ID of a different vSwitch and the `VpcId` parameter is not specified, the new vSwitch must belong to the same zone and VPC as the current vSwitch.\n*   If the `VpcId` parameter is specified, the vSwitch specified by this parameter must belong to the specified VPC and the same zone as the current vSwitch.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "VpcId",
      "description": "The ID of the new VPC.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}