{
  "name": "ModifyDiskSpec",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "DiskCategory",
      "description": "The new category of the disk. Valid values:\n\n*   cloud_essd: ESSD\n*   cloud_auto: ESSD AutoPL disk\n*   cloud_ssd: standard SSD\n*   cloud_efficiency: ultra disk\n\nThis parameter is empty by default, which indicates that the disk category is not changed.\n\n>  The preceding values are listed in descending order of disk performance. Subscription disks cannot be downgraded.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DiskId",
      "description": "The disk ID.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "DryRun",
      "description": "Specifies whether to perform only a dry run, without performing the actual request. Valid values:\n\n*   true: performs only a dry run. The system checks the request for potential issues, including missing parameter values, incorrect request syntax, service limits, and insufficient ECS resources. If the request fails the dry run, an error message is returned. If the request passes the dry run, the `DryRunOperation` error code is returned.\n*   false: performs a dry run and performs the actual request. If the request passes the dry run, a 2xx HTTP status code is returned and the operation is performed.\n\nDefault value: false.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "PerformanceControlOptions",
      "description": "A collection of disk performance control parameters",
      "position": "Query",
      "type": "Struct",
      "required": false
    },
    {
      "name": "PerformanceLevel",
      "description": "The new performance level of the ESSD. Valid values:\n\n*   PL0: An ESSD can deliver up to 10,000 random read/write IOPS.\n*   PL1: An ESSD can deliver up to 50,000 random read/write IOPS.\n*   PL2: An ESSD can deliver up to 100,000 random read/write IOPS.\n*   PL3: An ESSD delivers up to 1,000,000 random read/write IOPS.\n\nDefault value: PL1.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ProvisionedIops",
      "description": "The provisioned read/write IOPS of the ESSD AutoPL disk. Valid values: 0 to min{50,000, 1,000 × Capacity - Baseline IOPS}\n\nBaseline IOPS = min{1,800 + 50 × Capacity, 50,000}\n\n>  This parameter is available only if the DiskCategory parameter is set to cloud_auto. For more information, see [ESSD AutoPL disks](~~368372~~) and [Modify the performance configurations of an ESSD AutoPL disk](~~413275~~).",
      "position": "Query",
      "type": "Long",
      "required": false
    }
  ]
}