{
  "name": "ModifyDedicatedHostsChargeType",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AutoPay",
      "description": "Specifies whether to automatically complete the payment. Valid values:\n\n*   true: The payment is automatically completed. Make sure that your account balance is sufficient. Otherwise, your order becomes invalid and will be canceled.\n*   false: An order is generated but no payment is made.\n\nDefault value: true.\n\n> If you do not have sufficient balance in your account, you can set `AutoPay` to `false` to generate an unpaid order. Then, you can pay for the order.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request. You can use the client to generate the token, but you must make sure that the token is unique among different requests. The `token` can contain only ASCII characters and cannot exceed 64 characters in length. For more information, see [How to ensure idempotence](~~25693~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DedicatedHostChargeType",
      "description": "The new billing method of the dedicated hosts. Valid values:\n\n*   PrePaid: changes the billing method from pay-as-you-go to subscription.\n*   PostPaid: changes the billing method from subscription to pay-as-you-go.\n\nDefault value: PrePaid.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DedicatedHostIds",
      "description": "The IDs of the dedicated hosts. The value can be a JSON array that consists of up to 20 dedicated host IDs. Separate the IDs with commas (,).",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "DetailFee",
      "description": "Specifies whether to return the billing details of the order when the billing method is changed from subscription to pay-as-you-go.\n\nDefault value: false.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "DryRun",
      "description": "Specifies whether to perform only a dry run, without performing the actual request. Valid values:\n\n*   true: performs only a dry run. The system checks your AccessKey pair, the permissions of the RAM user, and the required parameters. If the request fails the dry run, an error message is returned. If the request passes the dry run, the `DryRunOperation` error code is returned.\n*   false: performs a dry run and performs the actual request. If the request passes the dry run, a 2xx HTTP status code is returned and the operation is performed.\n\nDefault value: false.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "Period",
      "description": "The renewal duration of the subscription dedicated hosts. Valid values:\n\n*   If you set `PeriodUnit` to Week, valid values of `Period` are 1, 2, 3, and 4.\n*   If you set `PeriodUnit` to Month, valid values of `Period` are 1, 2, 3, 4, 5, 6, 7, 8, 9, 12, 24, 36, 48, and 60.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "PeriodUnit",
      "description": "The unit of the renewal duration specified by `Period`. Valid values:\n\n*   Week\n*   Month\n\nDefault value: Month.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the dedicated hosts. You can call the [DescribeRegions](~~25609~~) operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}