{
  "name": "ModifyDiskDeployment",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "DiskCategory",
      "description": "The new disk category. The parameter can be used only when you migrate a disk between dedicated block storage clusters. Only ESSDs can be created in dedicated block storage clusters. Set this parameter to cloud_essd.\n\nThis parameter is empty by default, which indicates that the disk category is not changed.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DiskId",
      "description": "The ID of the disk.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "DryRun",
      "description": "Specifies whether to perform only a dry run, without performing the actual request. Valid values:\n\n*   true: performs only a dry run. The system checks the request for potential issues, including missing parameter values, incorrect request syntax, service limits, and unavailable ECS resources. If the request fails the dry run, an error message is returned. If the request passes the dry run, the DryRunOperation error code is returned.\n*   false: performs a dry run and performs the actual request. If the request passes the dry run, a 2xx HTTP status code is returned and the operation is performed.\n\nDefault value: false.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "PerformanceLevel",
      "description": "The new performance level of the ESSD. The parameter can be used only when you migrate data between dedicated block storage clusters. Valid values:\n\n*   PL0: A single ESSD can deliver up to 10000 random read/write IOPS.\n*   PL1: A single ESSD can deliver up to 50000 random read/write IOPS.\n\nThis parameter is empty by default, which indicates that the performance level is not modified.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "StorageClusterId",
      "description": "The ID of the dedicated block storage cluster to which data disk N belongs.\n\n*   When you migrate a disk to a dedicated block storage cluster, the`  StorageClusterId ` parameter must be specified.\n*   When you migrate a disk to a public block storage cluster, the `StorageClusterId` parameter must be left empty.\n\nThis parameter is empty by default, which indicates that the disk is migrated to a public block storage cluster.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}