{
  "name": "ModifyPrepayInstanceSpec",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AutoPay",
      "description": "Specifies whether to enable automatic payment when you upgrade the instance type. Valid values:\n\n*   true: enables automatic payment.\n\n    **\n\n    **Make sure that your payment account has sufficient balance. Otherwise, your order becomes invalid and is canceled.** If your account balance is insufficient, you can set the AutoPay parameter to false to generate an unpaid order. Then, you can log on to the ECS console to pay for the order.````\n\n*   false: An order is generated but no payment is made.\n\nDefault value: true.\n\nWhen `OperatorType` is set to `downgrade`, `AutoPay` is ignored.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "ClientToken",
      "description": "The client token that you want to use to ensure the idempotency of the request. You can use the client to generate the value, but make sure that the value is unique among different requests. This value allows only ASCII characters and is up to 64 characters in length. For more information, see [How do I ensure the idempotence of a request?](~~25693~~)",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Disk",
      "description": ">该参数暂未开放使用。",
      "position": "Query",
      "type": "RepeatList",
      "required": false,
      "sub_parameters": [
        {
          "name": "Category",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "DiskId",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "PerformanceLevel",
          "position": "Query",
          "type": "String",
          "required": false
        }
      ]
    },
    {
      "name": "EndTime",
      "description": "The end time of the temporary change. Specify the time in the [ISO 8601](~~25696~~) standard in the yyyy-MM-ddTHH:mm:ssZ format. The time must be in UTC.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "InstanceId",
      "description": "The instance ID.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "InstanceType",
      "description": "The new instance type. For information about available instance types, see [Instance families](~~25378~~) or call the [DescribeInstanceTypes](~~25620~~) operation.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "MigrateAcrossZone",
      "description": "Specifies whether to support cross-cluster instance type upgrades.\n\nDefault value: false.\n\nWhen you set `MigrateAcrossZone` to `true` and you upgrade the instance based on the returned information, take note of the following items:\n\nInstances of the classic network type:\n\n*   For retired instance types, when a non-I/O optimized instance is upgraded to an I/O optimized instance, the private IP address, disk device names, and software license codes of the instance are changed. For more information, see [Retired instance types](~~55263~~). For Linux instances, basic disks (cloud) are identified by the prefix xvd. Ultra disks (cloud_efficiency) and standard SSDs (cloud_ssd) are identified by the prefix vd.\n*   For [instance families available for purchase](~~25378~~), when the instance type of an instance is changed, the private IP address of the instance changes.\n\nInstances of the Virtual Private Cloud (VPC) type: For retired instance types, when a non-I/O optimized instance is upgraded to an I/O optimized instance, the disk device names and software license codes of the instance are changed. For Linux instances, basic disks (cloud) are identified by the prefix xvd. Ultra disks (cloud_efficiency) and standard SSDs (cloud_ssd) are identified by the prefix vd.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "ModifyMode",
      "description": ">该参数暂未开放使用。",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "OperatorType",
      "description": "The type of the change to the instance. Valid values:\n\n>  This parameter is optional. The system can automatically determine whether the instance change is an upgrade or a downgrade. If you want to specify this parameter, refer to the following valid values of the parameter.\n\n*   upgrade: upgrades the instance type. Make sure that the balance in your account is sufficient.\n*   downgrade: downgrades the instance type. When the new instance type specified by the `InstanceType` parameter has lower specifications than the current instance type, set `OperatorType` to downgrade.\n\n>  You can refer to the preceding usage notes on how to upgrade or downgrade the instance type.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RebootTime",
      "description": "The restart time of the instance. Specify the time in the [ISO 8601](~~25696~~) standard in the yyyy-MM-ddTHH:mm:ssZ format. The time must be in UTC.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RebootWhenFinished",
      "description": "Specifies whether to restart the instance immediately after the instance type is changed. Valid values:\n\n*   true: restart the instance immediately after the instance type is changed.\n*   false: does not restart the instance immediately after the instance type is changed.\n\nDefault value: false.\n\n>  If the instance is in the **Stopping** state, the instance status remains unchanged and no operations are performed after the instance type is change regardless of whether you set the `RebootWhenFinished` parameter to true.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the instance. You can call the [DescribeRegions](~~25609~~) operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "SystemDisk.Category",
      "description": "The new category of the system disk. This parameter is applicable only when you upgrade an instance from a retired instance type to a currently available instance type or when you upgrade a non-I/O optimized instance to an I/O optimized instance. For more information, see [Retired instance types](~~55263~~) and [Instance families](~~25378~~). Valid values:\n\n*   cloud_efficiency: ultra disk.\n*   cloud_ssd: standard SSD.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}