{
  "name": "ModifyInstanceVpcAttribute",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "InstanceId",
      "description": "The ID of the ECS instance.\n\n>  When you call this operation, the ECS instance must be in the **Stopped** (`Stopped`) state. For other limits on the ECS instance, see the **Usage notes** section of this topic.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "PrivateIpAddress",
      "description": "The new private IP address of the ECS instance.\n\n>  The value of `PrivateIpAddress` depends on the value of `VSwitchId`. The specified IP address must be within the CIDR block of the specified vSwitch.\n\nBy default, if this parameter is empty, a private IP address is randomly assigned from the CIDR block of the specified vSwitch.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SecurityGroupId",
      "description": "The IDs of new security groups to which the ECS instance belongs after the VPC is changed. This parameter is required only if `VpcId` is specified.\n\n*   The security groups that you specify must belong to the new VPC.\n*   You can specify one or more security groups. The valid values of N vary based on the maximum number of security groups to which an ECS instance can belong. For more information, see [Limits](~~25412#SecurityGroupQuota1~~).\n*   The specified security groups must be of the same type.\n*   You can switch the ECS instance to security groups of a different type. To ensure network connectivity, we recommend that you understand the differences in rule configurations of the two security group types before you switch the ECS instance to security groups of a different type. For more information, see [Overview of security groups](~~25387~~).",
      "position": "Query",
      "type": "RepeatList",
      "required": false
    },
    {
      "name": "VSwitchId",
      "description": "The ID of the new vSwitch.\n\n*   If you set this parameter to the ID of the current vSwitch, the vSwitch of the ECS instance remains unchanged.\n*   If you set this parameter to the ID of a different vSwitch and leave `VpcId` empty, the new vSwitch must belong to the same zone and VPC as the current vSwitch.\n*   If you specify `VpcId`, the vSwitch specified by this parameter must belong to the specified VPC and the same zone as the current vSwitch.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "VpcId",
      "description": "The ID of the new VPC.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}