{
  "name": "ReInitDisk",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AutoStartInstance",
      "description": "Specifies whether to automatically start the instance after the disk is re-initialized. Valid values:\n\n*   true\n*   false\n\nDefault value: false.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "DiskId",
      "description": "The ID of the disk.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "KeyPairName",
      "description": "The name of the key pair. This parameter is empty by default.\n\n> The parameter is applicable only to Linux instances. You can bind an SSH key pair to an instance as the logon credential when you re-initialize the system disk of the instance. After the SSH key pair is bound, the username and password-based logon method is disabled for the instance.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Password",
      "description": "Specifies whether to reset the password of the instance when you re-initialize its system disk. The password must be 8 to 30 characters in length and must contain at least three of the following character types: uppercase letters, lowercase letters, digits, and special characters. Special characters include:\n\n    ()`~!@#$%^&*-_+=|{}[]:;'<>,.?/\n\nFor Windows instances, passwords cannot start with a forward slash (/).\n\n> If the `Password` parameter is specified, we recommend that you send requests over HTTPS to prevent password leaks.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SecurityEnhancementStrategy",
      "description": "Specifies whether to use Security Center free of charge after the system disk is re-initialized. Valid values:\n\n*   Active: uses Security Center free of charge after the system disk is re-initialized. This value is applicable to only public images.\n*   Deactive: does not use Security Center free of charge after the system disk is re-initialized. This value is applicable to all images.\n\nDefault value: Deactive.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}