{
  "name": "ResizeDisk",
  "deprecated": false,
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ClientToken",
      "description": "The ID of the order.\n\n> This parameter is returned only when you resize subscription disks.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DiskId",
      "description": "The method that you want to use to resize the disk. Default value: offline. Valid values:\n\n*   offline: resizes the disk offline. After you resize a disk offline, you must restart its associated instance by using the Elastic Compute Service (ECS) console or by calling the [RebootInstance](~~25502~~) operation to make the resizing operation take effect. For information about how to restart an ECS instance in the ECS console, see [Restart an instance](~~25440~~).\n*   online: resizes the disk online. After you resize a disk online, the resizing operation takes effect immediately and you do not need to restart the instance. Ultra disks, standard SSDs, and ESSDs can be resized online.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "NewSize",
      "description": "32768",
      "position": "Query",
      "type": "Integer",
      "required": true
    },
    {
      "name": "Type",
      "description": "The new disk capacity. Unit: GiB. Valid values:\n\n*   System disk: 20 to 500.\n\n*   Data disk:\n\n    *   Ultra disk (cloud_efficiency): 20 to 32768.\n\n    *   Standard SSD (cloud_ssd): 20 to 32768.\n\n    *   ESSD (cloud_essd): Valid values when the NewSize parameter is set to cloud_essd depend on the `PerformanceLevel` value. You can call the [DescribeDisks](~~25514~~) operation to query disk information and check the `PerformanceLevel` value in the response.\n\n        *   Valid values when PerformanceLevel is set to PL0: 40 to 32768.\n        *   Valid values when PerformanceLevel is set to PL1: 20 to 32768.\n        *   Valid values when PerformanceLevel is set to PL2: 461 to 32768.\n        *   Valid values when PerformanceLevel is set to PL3: 1261 to 32768.\n\n    *   Basic disk (cloud): 5 to 2000.\n\nThe new disk capacity must be greater than the original disk capacity.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}