{
  "name": "RunCommand",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request. You can use the client to generate the value that is unique among different requests. The `ClientToken` value can only contain ASCII characters and cannot exceed 64 characters in length. For more information, see [How to ensure idempotence](~~25693~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "CommandContent",
      "description": "Specifies whether to retain the command after it is run. Valid values:\n\n*   true: The command is retained. You can call the InvokeCommand operation to run the command again. The retained command counts against the quota of Cloud Assistant commands.\n*   false: The command is not retained. The command is automatically deleted after it is run and does not count against the quota of Cloud Assistant commands.\n\nDefault value: false",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ContainerId",
      "description": "The value of tag N of the command. You can specify 1 to 20 tag keys for the command. The tag value can be an empty string.\n\nIt can be up to 128 characters in length and cannot contain `http://` or `https://`.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ContainerName",
      "description": "Runs a shell, PowerShell, or batch command on one or more Elastic Compute Service (ECS) instances.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ContentEncoding",
      "description": "Specifies whether to run the command on a schedule. Valid values:\n\n*   true: runs the command on the schedule specified by `Frequency`. The results of each execution of a command do not affect the subsequent executions of the command.\n*   false: runs the command only once.\n\nDefault value: false.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Description",
      "description": "The content of the command. The command content can be plaintext or Base64-encoded. Take note of the following items:\n\n*   If you want to retain the command, make sure that the Base64-encoded command content does not exceed 18 KB in size. If you do not want to retain the command, make sure that the Base64-encoded command content does not exceed 24 KB in size. You can set `KeepCommand` to specify whether to retain the command.\n\n*   If the command content is Base64-encoded, set `ContentEncoding` to Base64.\n\n*   When `EnableParameter` is set to true, the custom parameter feature is enabled and you can configure custom parameters based on the following rules:\n\n    *   Define custom parameters in the `{{}}` format. Within `{{}}`, the spaces and line feeds before and after the parameter names are ignored.\n    *   The number of custom parameters cannot exceed 20.\n    *   A custom parameter name can contain only letters, digits, underscores (\\_), and hyphens (-). The name is case-insensitive.\n    *   Each custom parameter name cannot exceed 64 bytes in length.\n\n*   You can specify built-in environment parameters as custom parameters. Then, when you run the command, the parameters are automatically specified by Cloud Assistant. You can specify the following built-in environment parameters:\n\n    *   `{{ACS::RegionId}}`: the ID of the region.\n\n    *   `{{ACS::AccountId}}`: the UID of the Alibaba Cloud account.\n\n    *   `{{ACS::InstanceId}}`: the ID of the instance. If you want to run the command on multiple instances and specify `{{ACS::InstanceId}}` as a built-in environment parameter, make sure that your Cloud Assistant is of the following versions or later:\n\n        *   Linux: 2.2.3.309\n        *   Windows: 2.1.3.309\n\n    *   `{{ACS::InstanceName}}`: the name of the instance. If you want to run the command on multiple instances and specify `{{ACS::InstanceName}}` as a built-in environment parameter, make sure that your Cloud Assistant is of the following versions or later:\n\n        *   Linux: 2.2.3.344\n        *   Windows: 2.1.3.344\n\n    *   `{{ACS::InvokeId}}`: the ID of the command task. If you want to specify `{{ACS::InvokeId}}` as a built-in environment variable, make sure that your Cloud Assistant is of the following versions or later:\n\n        *   Linux: 2.2.3.309\n        *   Windows: 2.1.3.309\n\n    *   `{{ACS::CommandId}}`: the ID of the command. If you want to specify `{{ACS::CommandId}}` as a built-in environment parameter, make sure that your Cloud Assistant is of the following versions or later:\n\n        *   Linux: 2.2.3.309\n        *   Windows: 2.1.3.309",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EnableParameter",
      "description": "The ID of the resource group to which you want to assign the command executions. When you set this parameter, take note of the following items:\n\n*   The instances specified by the InstanceId.N parameter must belong to the specified resource group.\n*   You can set this parameter to call the [DescribeInvocations](~~64840~~) or [DescribeInvocationResults](~~64845~~) operation to query execution results in the specified resource group.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "Frequency",
      "description": "The name of the command. The name supports all character sets and can be up to 128 characters in length.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "InstanceId",
      "description": "The name of the password to use to run the command on Windows instances.\n\nIf you do not want to use the default System user to run the command on Windows instances, you must specify both the WindowsPasswordName and `Username` parameters. The password is hosted in the parameter repository of Operation Orchestration Service (OOS) by using an encryption parameter to mitigate the risk of password leaks. Only the name of the encryption parameter that corresponds to the password is passed in by using the WindowsPasswordName parameter. For more information, see [Encrypt parameters](~~186828~~) and [Configure a regular user to run Cloud Assistant commands](~~203771~~).\n\n>  If you use the root username for Linux instances or the System username for Windows instances to run the command, you do not need to specify the WindowsPasswordName parameter.",
      "position": "Query",
      "type": "RepeatList",
      "required": true
    },
    {
      "name": "KeepCommand",
      "description": "The ID of instance N on which to run the command. Valid values of N: 1 to 50.\n\nIf one of the specified instances does not meet the conditions for running the command, the call fails. To ensure that the call is successful, specify only the IDs of instances that meet the conditions.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "Name",
      "description": "The ID of the command.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Parameters",
      "description": "The working directory of the command on the instance.\n\nDefault values:\n\n*   For Linux instances, the default value is `/root`, which is the home directory of the administrator (the root user).\n*   For Windows instances, the default value is the directory where the Cloud Assistant client process resides. Example: `C:\\Windows\\System32`.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The language type of the command. Valid values:\n\n*   RunBatScript: batch command, applicable to Windows instances\n*   RunPowerShellScript: PowerShell command, applicable to Windows instances\n*   RunShellScript: shell command, applicable to Linux instances",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "RepeatMode",
      "description": "root",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ResourceGroupId",
      "description": "The tags to add to the command.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Tag",
      "description": "The description of the command. The description supports all character sets and can be up to 512 characters in length.",
      "position": "Query",
      "type": "RepeatList",
      "required": false,
      "sub_parameters": [
        {
          "name": "Key",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "Value",
          "position": "Query",
          "type": "String",
          "required": false
        }
      ]
    },
    {
      "name": "Timed",
      "description": "The key-value pairs of custom parameters to pass in when the command includes custom parameters. For example, assume that the command content is `echo {{name}}`. You can use the `Parameter` parameter to pass in the `{\"name\":\"Jack\"}` key-value pair. The `name` key of the custom parameter is automatically replaced by the paired Jack value to generate a new command. As a result, the `echo Jack` command is actually run.\n\nNumber of custom parameters: 0 to 10. Take note of the following items:\n\n*   The key cannot be an empty string. It can be up to 64 characters in length.\n*   The value can be an empty string.\n*   If you want to retain the command, make sure that the size of the Base64-encoded command content (including custom parameters and original command content) does not exceed 18 KB. If you do not want to retain the command, make sure that the size of the Base64-encoded command content does not exceed 24 KB. You can set `KeepCommand` to specify whether to retain the command.\n*   The custom parameter names specified in the value of Parameters must all be included in the custom parameter names specified when you created the command. You can use empty strings to represent the parameters that are not passed in.\n\nThis parameter is empty by default. You can leave this parameter empty to disable the custom parameter feature.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "Timeout",
      "description": "The timeout period for the command execution. Unit: seconds.\n\nA timeout occurs when a command cannot be completed because the process gets stuck, the modules are missing, or the Cloud Assistant client is not installed on the instance. When an execution times out, the command process is forcefully terminated.\n\nDefault value: 60.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "Type",
      "description": "The region ID of the command. You can call the [DescribeRegions](~~25609~~) operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Username",
      "description": "Specifies whether to enable the the custom parameter feature.\n\nDefault value: false",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "WindowsPasswordName",
      "description": "The ID of instance N on which to run the command. Valid values of N: 1 to 50.\n\nIf one of the specified instances does not meet the conditions for running the command, the call fails. To ensure that the call is successful, specify only the IDs of instances that meet the conditions.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "WorkingDir",
      "description": "The ID of the command task.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}