{
  "name": "SendFile",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Content",
      "description": "The content of the remote file. The content must not exceed 32 KB in size after it is encoded in Base64.\n\n*   If `ContentType` is set to `PlainText`, the Content value is in plaintext.\n*   If `ContentType` is set to `Base64`, the Content value is Base64-encoded.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ContentType",
      "description": "The content type of the file. Valid values:\n\n*   PlainText: The file content is not encoded.\n*   Base64: The file content is Base64-encoded.\n\nDefault value: PlainText.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Description",
      "description": "The description of the file. The description supports all character sets and can be up to 512 characters in length.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "FileGroup",
      "description": "The user group of the file. This parameter takes effect only for Linux instances. Default value: root. The user group name can be up to 64 characters in length.\n\n>  If you want to use a non-root user group, make sure that the user group exists in the instances.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "FileMode",
      "description": "The permissions on the file. This parameter takes effect only for Linux instances. You can configure this parameter in the same way as you configure the chmod command.\n\nDefault value: 0644, which indicates that the owner of the file has the read and write permissions on the file and that the user group of the file and other users have the read-only permissions on the file.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "FileOwner",
      "description": "The owner of the file. This parameter takes effect only for Linux instances. Default value: root. The value can be up to 64 characters in length.\n\n>  If you want to use a non-root user, make sure that the user exists in the instances.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "InstanceId",
      "description": "The ID of instance N to which to send the file. Up to 50 instance IDs can be specified in each request. Valid values of N: 1 to 50.",
      "position": "Query",
      "type": "RepeatList",
      "required": true
    },
    {
      "name": "Name",
      "description": "The name of the file. The name supports all character sets and can be up to 255 characters in length.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Overwrite",
      "description": "Specifies whether to overwrite a file in the destination directory if the file has the same name as the sent file.\n\n*   true: overwrites the file.\n*   false: does not overwrite the file.\n\nDefault value: false.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the instance to which to send the file. You can call the [DescribeRegions](~~25609~~) operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ResourceGroupId",
      "description": "The ID of the resource group. When you specify this parameter, take note of the following items:\n\n*   The ECS instance specified by the InstanceId parameter must belong to this resource group.\n*   If you specify this parameter, you can call the [DescribeSendFileResults](~~184117~~) operation to query file sending results in the specified resource group.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Tag",
      "description": "The list of tags.",
      "position": "Query",
      "type": "RepeatList",
      "required": false,
      "sub_parameters": [
        {
          "name": "Key",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "Value",
          "position": "Query",
          "type": "String",
          "required": false
        }
      ]
    },
    {
      "name": "TargetDir",
      "description": "The destination directory on the instance to which to send the file. If the specified directory does not exist, the system creates the directory on the instance. The value supports all character sets and cannot exceed 255 characters in length.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Timeout",
      "description": "The timeout period for the file sending task. Unit: seconds.\n\n*   A timeout error occurs when a file cannot be sent because the process slows down or because a specific module or Cloud Assistant Agent does not exist.\n*   If the specified timeout period is less than 10 seconds, the system sets the timeout period to 10 seconds to ensure that the file can be sent to the instances.\n\nDefault value: 60.",
      "position": "Query",
      "type": "Long",
      "required": false
    }
  ]
}