{
  "name": "StopInstance",
  "deprecated": false,
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ConfirmStop",
      "description": "This parameter will be removed in the future and is retained only to ensure compatibility. We recommend that you ignore this parameter.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "DryRun",
      "description": "Specifies whether to perform only a dry run, without performing the actual request. Valid values:\n\n*   true: performs only a dry run. The system checks the request for potential issues, including missing parameter values, incorrect request syntax, service limits, and available ECS resources. If the request fails the dry run, an error message is returned. If the request passes the dry run, the `DryRunOperation` error code is returned.\n*   false: performs a dry run and performs the actual request.\n\nDefault value: false.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "ForceStop",
      "description": "Specifies whether to forcibly stop the instance. Valid values:\n\n*   true\n*   false\n\nDefault value: false.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "Hibernate",
      "description": "> This parameter is in invitational preview and is not publicly available.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "InstanceId",
      "description": "The ID of the instance.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "StoppedMode",
      "description": "The stop mode of the pay-as-you-go instance. Valid values:\n\n*   StopCharging: economical mode. For information about how `StopCharging` takes effect, see the \"Conditions for enabling economical mode\" section in [Economical mode](~~63353~~).\n*   KeepCharging: standard mode. You continue to be charged for instances that are stopped in standard mode.\n\nDefault value: If the conditions for enabling the economical mode are met and you have enabled this mode in the ECS console, the default value is [StopCharging](~~63353#default~~). For more information, see the \"Enable economical mode\" section in `Economical mode`. Otherwise, the default value is `KeepCharging`.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}