{
  "name": "StopInstances",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "BatchOptimization",
      "description": "The batch operation mode. Valid values:\n\n*   AllTogether: In this mode, if all instances are stopped, a success message is returned. If an instance fails the verification, all instances fail to stop and an error message is returned.\n*   SuccessFirst: In this mode, each instance is separately stopped. The response contains the operation results for each instance.\n\nDefault value: AllTogether.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DryRun",
      "description": "Specifies whether to perform only a dry run, without performing the actual request. Valid values:\n\n*   true: performs a dry run. The system checks the request for potential issues, including required parameters, request syntax, and instance status. If the request passes the dry run, `DRYRUN.SUCCESS` is returned. Otherwise, an error message is returned.\n\n> If you set `BatchOptimization` to `SuccessFirst` and `DryRun` to true, only `DRYRUN.SUCCESS` is returned regardless of whether the request passes the dry run.\n\n*   false: performs a dry run and performs the actual request.\n\nDefault value: false.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "ForceStop",
      "description": "Specifies whether to stop the instance in a forceful manner. Valid values:\n\n*   true: stops the instance in a forceful manner. This operation is equivalent to the power-off operation in common scenarios. Cache data that is not written to storage in the instance will be lost.\n*   false: stops the instance in a normal manner.\n\nDefault value: false.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "InstanceId",
      "description": "The IDs of instances.",
      "position": "Query",
      "type": "RepeatList",
      "required": true
    },
    {
      "name": "RegionId",
      "description": "The region ID of the instance. You can call the [DescribeRegions](~~25609~~) operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "StoppedMode",
      "description": "The stop mode of the pay-as-you-go instance. Valid values:\n\n*   StopCharging: economical mode. For information about how `StopCharging` takes effect, see the \"Prerequisites\" section in [Economical mode](~~63353~~).\n*   KeepCharging: standard mode. After the instance is stopped in standard mode, you continue to be charged for it.\n\nDefault value: If the prerequisites required for enabling economical mode are met and you have enabled the mode in the ECS console, the default value is [StopCharging](~~63353#default~~). For more information, see the \"Enable economical mode\" section in `Economical mode`. Otherwise, the default value is `KeepCharging`.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}