{
  "name": "ListSQLExecAuditLog",
  "deprecated": false,
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "EndTime",
      "description": "The end of the time range to query.\n\n>  The end time supports fuzzy match. Specify the time in the YYYY-MM-DD hh:mm:ss format. We recommend that you use the StartTime and EndTime parameters to specify a time range that does not exceed one day. The returned entries can be displayed by page to improve query efficiency.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ExecState",
      "description": "The execution status of the SQL statement. Valid values:\n\n*   **FAIL**: The SQL statement fails to be executed.\n*   **NOEXE**: The SQL statement has not been executed.\n*   **RUNNING**: The SQL statement is being executed.\n*   **CANCEL**: The execution of the SQL statement is canceled.\n*   **SUCCESS**: The SQL statement is executed.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "OpUserName",
      "description": "The nickname of the user who wrote the SQL statement.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "PageNumber",
      "description": "The number of the page to return.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "PageSize",
      "description": "The number of entries to return on each page. The value cannot exceed 100.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "SearchName",
      "description": "The name of the database or instance based on which you want to query SQL statements.\n\n>  If the SQL statements to be queried are at the instance level, you can set this parameter to an instance name. If the SQL statements to be queried are at the database level, you can set this parameter to a database name.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SqlType",
      "description": "The type of the SQL statement. Valid values:\n\n*   **SELECT**: the SQL statement that is used to query data.\n*   **INSERT**: the SQL statement that is used to insert data.\n*   **DELETE**: the SQL statement that is used to delete data.\n*   **CREATE_TABLE**: the SQL statement that is used to create tables.\n\n>  To view more types of SQL statements, log on to the DMS console and click Security and Specifications. In the left-side navigation pane, click **Operation Audit**. Then, you can view all supported types of SQL statements from the **SQL type** drop-down list.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "StartTime",
      "description": "The beginning of the time range to query.\n\n>  The start time supports fuzzy match. Specify the time in the YYYY-MM-DD hh:mm:ss format.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Tid",
      "description": "The ID of the tenant. You can call the [GetUserActiveTenant](~~198073~~) operation to obtain the tenant ID.",
      "position": "Query",
      "type": "Long",
      "required": false
    }
  ]
}