{
  "name": "SetOwners",
  "deprecated": false,
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "OwnerIds",
      "description": "The ID of the user whom you want to specify as an owner. Separate multiple IDs with commas (,). You can call the [GetUser](~~147098~~) or [ListUsers](~~141938~~) operation to query the ID of the user.\n\n>  The value of the OwnerIds parameter is that of the UserId parameter.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "OwnerType",
      "description": "The type of the owner. Valid values:\n\n*   INSTANCE: an owner of an instance.\n*   DATABASE: an owner of a physical database.\n*   LOGIC_DATABASE: an owner of a logical database.\n*   TABLE: an owner of a physical table.\n*   LOGIC_TABLE: an owner of a logical table.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ResourceId",
      "description": "The ID of the resource. The ID of the resource varies with the owner type. The owner types and resource IDs have the following mappings:\n\n*   INSTANCE: the ID of an instance. You can call the [ListInstances](~~141936~~) operation to query the ID of the instance.\n*   DATABASE: the ID of a physical database. You can call the [ListDatabases](~~141873~~) operation to query the ID of the physical database.\n*   LOGIC_DATABASE: the ID of a logical database. You can call the [ListLogicDatabases](~~141874~~) operation to query the ID of the logical database.\n*   TABLE: the ID of a physical table. You can call the [ListTables](~~141878~~) operation to query the ID of the physical table.\n*   LOGIC_DATABASE: the ID of a logical table. You can call the [ListLogicTables](~~141875~~) operation to query the ID of the logical table.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Tid",
      "description": "The ID of the tenant.\n\n>  To view the ID of the tenant, move the pointer over the profile picture in the upper-right corner of the Data Management (DMS) console. For more information, see the \"View information about the current tenant\" section of the [Manage DMS tenants](~~181330~~) topic.",
      "position": "Query",
      "type": "Long",
      "required": false
    }
  ]
}