{
  "name": "CreateApplicationScalingRule",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "POST",
  "pathPattern": "/pop/v1/sam/scale/applicationScalingRule",
  "parameters": [
    {
      "name": "AppId",
      "description": "The application ID.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "EnableIdle",
      "description": "",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "MinReadyInstanceRatio",
      "description": "The percentage of the minimum number of available instances. Valid values:\n\n*   **-1** (default value): The minimum number of available instances is not determined based on this parameter.\n*   **0 to 100**: The minimum number of available instances is calculated by using the following formula: Number of existing instances × Value of MinReadyInstanceRatio × 100%. The calculation result is rounded up to the nearest integer. For example, if the number of existing instances is 5 and MinReadyInstanceRatio is set to 50, the minimum number of available instances is 3.\n\n>  When **MinReadyInstance** and **MinReadyInstanceRatio** are passed at the same time and the **MinReadyInstanceRatio** value is not \\*\\*-1\\*\\*, the **MinReadyInstanceRatio** parameter takes precedence. **Note**When both **MinReadyInstance** and **MinReadyInstanceRatio** are specified and **MinReadyInstanceRatio** is set to a number from 0 to 100, the value of **MinReadyInstanceRatio** takes precedence.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "MinReadyInstances",
      "description": "The minimum number of available instances. Special values:\n\n*   If you set the value to **0**, business is interrupted when the application is updated.\n*   If you set this property to -1, the system calculates a recommended value as the minimum number of available instances by using the following formula: Recommended value = Number of existing instances × 25%. The calculation result is rounded up to the nearest integer. For example, if the number of existing instances is 5, the recommended value is calculated by using the following formula: 5 × 25% = 1.25. In this case, the minimum number of available instances is 2.\n\n>  To ensure business continuity, make sure that at least one instance is available during application deployment and rollback.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "ScalingRuleEnable",
      "description": "Specifies whether to enable the auto scaling policy. Valid values:\n\n*   **true**: The auto scaling policy is enabled.\n*   **false**: The auto scaling policy is disabled.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "ScalingRuleMetric",
      "description": "The configurations of the metric-based auto scaling policy. This parameter is required if you set the ScalingRuleType parameter to metric.\n\nThe following list describes the involved parameters:\n\n*   **maxReplicas**: the maximum number of instances in the application.\n\n*   **minReplicas**: the minimum number of instances in the application.\n\n*   **metricType**: the metric that is used to trigger the auto scaling policy.\n\n    *   **CPU**: the CPU utilization.\n    *   **MEMORY**: the memory usage.\n    *   **QPS**: the average QPS within 1 minute per Java application instance.\n    *   **RT**: the average response time of all API operations within 1 minute in the Java application.\n    *   **tcpActiveConn**: the average number of active TCP connections within 30 seconds per instance.\n    *   **SLB_QPS**: the average QPS of the Internet-facing SLB instance within 15 seconds per instance.\n    *   **SLB_RT**: the average response time of the Internet-facing SLB instance within 15 seconds.\n    *   **INTRANET_SLB_QPS**: the average QPS of the internal-facing SLB instance within 15 seconds per instance.\n    *   **INTRANET_SLB_RT**: the average response time of the internal-facing SLB instance within 15 seconds.\n\n*   **metricTargetAverageUtilization**: the limit on the metric that is specified by **metricType**. You can specify following limits:\n\n    *   The limit on the CPU utilization. Unit: percentage.\n    *   The limit on the memory usage. Unit: percentage.\n    *   The limit on the QPS.\n    *   The limit on the response time. Unit: milliseconds.\n    *   The limit on the average number of active TCP connections per second.\n    *   The limit on the QPS of the Internet-facing SLB instance.\n    *   The limit on the response time of the Internet-facing SLB instance. Unit: milliseconds.\n    *   The limit on the QPS of the internal-facing SLB instance.\n    *   The limit on the response time of the internal-facing SLB instance. Unit: milliseconds.\n\n*   **slbId**: the ID of the SLB instance.\n\n*   **slbProject**: the Simple Log Service (SLS) project.\n\n*   **slbLogstore**: the SLS Logstore.\n\n*   **vport**: the listener port of the SLB instance. HTTP and HTTPS are supported.\n\n*   **scaleUpRules**: the scale-out rules.\n\n*   **scaleDownRules**: the scale-in rule.\n\n*   **step**: the scale-out or scale-in step size. This parameter specifies the maximum number of instances that can be added or removed per unit time.\n\n*   **disabled**: specifies whether to disable the application scale-in. If you set this parameter to true, the application instances are never reduced. This prevents business risks during peak hours.\n\n    *   **true**: disables the application scale-in.\n    *   **false**: enables the application scale-in. Default value: false.\n\n*   **stabilizationWindowSeconds**: the cooldown period during which the system is stable and does not perform scale-out or scale-in operations. Valid values: 0 to 3600. Unit: seconds. Default value: 0.\n\n>  NoteYou can specify one or more metrics as the trigger conditions of the auto scaling policy. If one of the values of the specified metrics is greater than or equal to the specified limit, the application is scaled out. The number of instances after the scale-out operation is less than or equal to the value of the specified maximum application instances. If the values of all specified metrics are less than the limits, the application is scaled in. The number of instances after the scale-in operation is greater than or equal to the value of the specified minimum application instances.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ScalingRuleName",
      "description": "The name of the auto scaling policy. The name must be unique in an application, and can be up to 32 characters in length. It must start with a lowercase letter and can contain only lowercase letters, digits, and hyphens (-).\n\n>  You cannot change the names of created auto scaling policies.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ScalingRuleTimer",
      "description": "The configuration of the scheduled elasticity policy. This parameter is required if you select Scheduled Scaling Policy or Use SDK to Set.\n\nThe following table describes the parameters.\n\n*   **beginDate** and **endDate**: **beginDate** is the start date and **endDate** is the end date, which is used to configure the timing Auto Scaling policy. Valid values:\n\n    *   If both values are **null**, long-term execution is performed. This is the default value.\n    *   If the value is a specific date, for example, the **beginDate** is **2021-03-25** and the **endDate** is **2021-04-25**, the validity period is one month.\n\n*   **period**: The period during which the timed Auto Scaling policy is executed. Valid values:\n\n    *   **\\* \\* \\***: The scheduled policy is executed at a specified time every day.\n\n    *   **\\* \\* Fri,Mon**: The scheduled policy is executed at the specified time on the specified number of days per week. You can select multiple time zones. The time zone is GMT +8. Valid values:\n\n        *   **Sun**: Sunday\n        *   **Mon**: Monday\n        *   **Tue**: Tuesday\n        *   **Wed**: Wednesday\n        *   **Thu**: Thursday\n        *   **Fri**: Friday\n        *   **Sat**: Saturday\n\n    *   **1,2,3,28,31 \\* \\***: The scheduled auto scaling policy is executed at a specified point in time on one or more dates of each month. Valid values: 1 to 31. If a month does not have the 31st day, the auto scaling policy is executed on the specified days other than the 31st day.\n\n*   **schedules**: the points in time at which the scheduled auto scaling policy is triggered and the number of application instances that are retained during the time periods. You can specify up to 20 points in time. The following list describes the involved parameters:\n\n    *   **atTime**: the point in time at which the policy is triggered. **targetReplicas**: the number of application instances that you want to retain during the corresponding time period or the minimum number of available instances required for each deployment.****\n\n    *   **Valid values: 1 to 50.** Valid values: 1 to 50.\n\n        **\n\n        **Note**Make sure that at least one instance is available during the application deployment and rollback to prevent your business from being interrupted. If you set the value to **0**, business interruptions occur when the application is updated. If you set the value to **0**, business interruptions occur when the application is updated.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ScalingRuleType",
      "description": "The type of the auto scaling policy. Take note of the following rules:\n\n*   **timing**: a scheduled auto scaling policy.\n*   **metric**: a metric-based auto scaling policy.\n*   **mix**: a hybrid auto scaling policy.\n\n> \n\n*   If you set this parameter to timing, the ScalingRuleTimer parameter must be specified.\n\n*   If you set this parameter to metric, the ScalingRuleMetric parameter must be specified.\n\n*   If you set this parameter to mix, the ScalingRuleMetric parameter must be specified. You can specify the ScalingRuleTimer parameter based on your business requirements.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}