{
  "name": "GetWebshellToken",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET",
  "pathPattern": "/pop/v1/sam/instance/webshellToken",
  "parameters": [
    {
      "name": "AppId",
      "description": "The ID of the interactive messaging application.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ContainerName",
      "description": "The name of the init container.\n\nNote:\n\n*   If you specify this parameter, Cloud Assistant runs the command in the specified container of the instances.\n\n*   If this parameter is specified, the command can run only on Linux instances on which Cloud Assistant Agent 2.2.3.344 or later is installed.\n\n    *   For information about how to query the version of Cloud Assistant Agent, see [Install Cloud Assistant Agent](~~64921~~).\n    *   For information about how to upgrade Cloud Assistant Agent, see [Upgrade or disable upgrades for Cloud Assistant Agent](~~134383~~).\n\n*   If this parameter is specified, the `Username` parameter that is specified in a request to call this operation and the `WorkingDir` parameter that is specified in a request to call the [CreateCommand](~~64844~~) operation do not take effect. You can run the command only in the default working directory of the container by using the default user of the container. For more information, see [Use Cloud Assistant to run commands in containers](~~456641~~).\n\n*   If this parameter is specified, only shell scripts can be run in Linux containers. You cannot add a command in the format similar to `#!/usr/bin/python` at the beginning of a script to specify a script interpreter. For more information, see [Use Cloud Assistant to run commands in containers](~~456641~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "PodName",
      "description": "The name of the pod.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}