{
  "name": "CreateCenInterRegionTrafficQosQueue",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Bandwidth",
      "description": "The maximum absolute bandwidth value that can be allocated to the queue. Unit: Mbit/s.\n\n- The value specifies an absolute bandwidth. For example, a value of 20 specifies that the queue can consume at most 20 Mbit/s of bandwidth.\n- The sum of the bandwidth values specified for all queues that belong to the same inter-region connection cannot exceed the maximum bandwidth of the inter-region connection.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request.\n\nYou can use the client to generate the token, but you must make sure that the token is unique among different requests. The token can contain only ASCII characters.\n\n> If you do not specify this parameter, the system automatically uses the request ID as the client token. The request ID may be different for each request.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DryRun",
      "description": "Specifies whether to perform a dry run. Valid values:\n\n- **true**: performs a dry run. The system checks the required parameters, the request format, and the service limits. If the request fails the dry run, an error message is returned. If the request passes the dry run, the `DryRunOperation` error code is returned.\n- **false** (default): performs a dry run and sends the request.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "Dscps",
      "description": "The differentiated services code point (DSCP) value that matches the current queue.\n\nYou can specify at most 20 DSCP values for a queue in each call. Separate DSCP values with commas (,).",
      "position": "Query",
      "type": "RepeatList",
      "required": true
    },
    {
      "name": "QosQueueDescription",
      "description": "The description of the queue.\n\nThis parameter is optional. If you enter a description, it must be 1 to 256 characters in length and cannot start with http:// or https://.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "QosQueueName",
      "description": "The name of the queue.\n\nThe name can be empty or 1 to 128 characters in length, and cannot start with http:// or https://.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RemainBandwidthPercent",
      "description": "The maximum percentage of inter-region bandwidth that can be allocated to the queue.\n\n- Unit: percentage. For example, a value of 20 specifies that the queue can consume at most 20% of inter-region bandwidth.\n- The sum of the percentage values specified for all queues that belong to the same inter-region connection cannot exceed 100%.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TrafficQosPolicyId",
      "description": "The ID of the QoS policy.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}