{
  "name": "CreateTransitRouterCidr",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Cidr",
      "description": "The CIDR block of the transit router.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request.\n\nYou can use the client to generate the value, but you must make sure that the value is unique among different requests. The client token can contain only ASCII characters.\n\n>  If you do not set this parameter, ClientToken is set to the value of RequestId. The value of RequestId for each API request may be different.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Description",
      "description": "The description of the CIDR block.\n\nThe description must be 2 to 256 characters in length. The description must start with a letter but cannot start with `http://` or `https://`.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DryRun",
      "description": "Specifies whether to perform a dry run. Valid values:\n\n*   **true**: performs a dry run. The system checks the required parameters, request syntax, and limits. If the request fails the dry run, an error message is returned. If the request passes the dry run, the `DryRunOperation` error code is returned.\n*   **false** (default): performs a dry run and sends the request.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "Name",
      "description": "The name of the CIDR block.\n\nThe name must be 2 to 128 characters in length, and can contain letters, digits, periods (.), underscores (\\_), and hyphens (-). The name must start with a letter but cannot start with `http://` or `https://`.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "PublishCidrRoute",
      "description": "Specifies whether to allow the system to automatically add a route that points to the CIDR block to the route table of the transit router.\n- **true** (default): yes\n\n  A value of true specifies that after you create a private VPN connection and enable route learning for the connection, the system automatically adds a blackhole route to the route table of the transit router to which the VPN connection is attached. \n\n  The blackhole route is advertised only to the route tables of virtual border routers (VBRs) that are connected to the transit router. \n- **false**: no",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the transit router.\n\nYou can call the [DescribeChildInstanceRegions](~~132080~~) operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "TransitRouterId",
      "description": "The ID of the transit router.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}