{
  "name": "DeleteTransitRouterRouteEntry",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request.\n\nYou can use the client to generate the value, but you must make sure that it is unique among all requests. The client token can contain only ASCII characters.\n\n> If you do not specify this parameter, the system automatically uses the value of **RequestId** as the value of **ClientToken**. The value of **RequestId** for each API request may be different.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DryRun",
      "description": "Specifies whether to check the request but not perform the operation. The system checks the permissions and the status of the specified instances. Valid values:\n\n*   **false** (default): sends the request. If the request passes the precheck, the route is deleted.\n*   **true**: sends a precheck request. The route is not deleted after the request passes the precheck. If you use this value, the system checks the required parameters and the request syntax. If the check fails, the corresponding error message is returned. If the request passes the check, the system returns the ID of the request.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "TransitRouterRouteEntryDestinationCidrBlock",
      "description": "The destination CIDR block.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TransitRouterRouteEntryId",
      "description": "The ID of the route entry.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TransitRouterRouteEntryNextHopId",
      "description": "The ID of the network instance connection that you want to specify as the next hop.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TransitRouterRouteEntryNextHopType",
      "description": "The type of the next hop. Valid values:\n\n*   **BlackHole**: a blackhole route. You do not need to specify a next hop.\n*   **Attachment**: a network instance connection. You must specify a network instance connection as the next hop.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TransitRouterRouteTableId",
      "description": "The ID of the route table of the Enterprise Edition transit router.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}