{
  "name": "DescribeCenRouteMaps",
  "deprecated": false,
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "CenId",
      "description": "The number of the page to return. Default value: **1**.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "CenRegionId",
      "description": "The match method that is used to match routes based on the AS path.\n\n*   **Include**: fuzzy match. A route is a match if the AS path of the route overlaps with the AS path specified in the match condition.\n*   **Complete**: exact match. A route is a match only if the AS path of the route is the same as the AS path specified in the match condition.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "PageNumber",
      "description": "The route table ID of the transit router with which the routing policy is associated.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "PageSize",
      "description": "The IDs of the destination network instances to which the routes belong.\n\n>  The destination network instance IDs are valid only when the routing policy is applied to scenarios where routes are advertised from the gateway in the current region to network instances in the current region.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "RouteMapId",
      "description": "Indicates whether the destination network instance IDs are excluded.\n\n*   **false** (default): A route is a match if its destination network instance ID is in the list specified by **DestinationInstanceIds.N**.\n*   **true**: A route is a match if its destination network instance ID is not in the list specified by **DestinationInstanceIds.N**.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TransitRouterRouteTableId",
      "description": "The priority of the routing policy that you want to associate with the current one.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TransmitDirection",
      "description": "The match method that is used to match routes based on the community.\n\n*   **Include**: fuzzy match. A route is a match if the community of the route overlaps with the community specified in the match condition.\n*   **Complete**: exact match. A route is a match only if the community of the route is the same as the community specified in the match condition.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}