{
  "name": "UpdateCenInterRegionTrafficQosPolicyAttribute",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request.\n\nYou can use the client to generate the value, but you must make sure that the value is unique among different requests. The token can contain only ASCII characters and cannot exceed 64 characters in length.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DryRun",
      "description": "Specifies whether to check the request without performing the operation. Valid values:\n\n*   **true**: checks the request but does not modify the name and description of the QoS policy. The system checks whether the required parameters are set, whether the formats of the values are valid, and the service limits. If the request fails the check, an error message is returned. If the request passes the check, the `DryRunOperation` error code is returned.\n*   **false** (default): checks the request. If the request passes the check, the name and description of the QoS policy are modified.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "TrafficQosPolicyDescription",
      "description": "The new description of the QoS policy.\n\nThe description must be 2 to 128 characters in length, and can contain letters, digits, underscores (\\_), and hyphens (-). The description must start with a letter.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TrafficQosPolicyId",
      "description": "The ID of the QoS policy.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "TrafficQosPolicyName",
      "description": "The new name of the QoS policy.\n\nThe name must be 2 to 128 characters in length, and can contain letters, digits, underscores (\\_), and hyphens (-). The name must start with a letter.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}