{
  "name": "CreateDrdsInstance",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ClientToken",
      "description": "Specifies the client token that is used to ensure the idempotence of the request. You can use the client to generate the value, but you must ensure that it is unique among different requests. The token can only contain ASCII characters and cannot exceed 64 characters in length.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Description",
      "description": "Specifies the description of the instance. The description must meet the following requirements:\n\n*   The description cannot contain the prefix http:// or https://.\n*   The description must start with a letter or a Chinese character, and can contain uppercase and lowercase letters, Chinese characters, digits, underscores (\\_), and hyphens (-).\n*   The description must be 2 to 256 characters in length.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Duration",
      "description": "Specifies the purchase duration of the subscription instance.\n\n*   If the PricingCycle parameter is set to year, the value range of the Duration parameter is 1 to 3.\n*   If the PricingCycle parameter is set to month, the value range of the Duration parameter is 1 to 9.\n\n>  This parameter only takes effect when the PayType parameter is set to drdsPre.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "InstanceSeries",
      "description": "Specifies the instance type of the instance. Valid values:\n\n*   **drds.sn2.4c16g**: The instance is of the Starter Edition.\n*   **drds.sn2.8c32g**: The instance is of the Standard Edition\n*   **drds.sn2.16c64g**: The instance is of the Enterprise Edition.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "IsAutoRenew",
      "description": "Specifies whether to enable automatic renewal. Valid values:\n\n*   **true**: If the PricingCycle parameter is set to month, the subscription is automatically renewed for one month. If the PricingCycle parameter is set to year, the subscription is automatically renewed for one year.\n*   **false**: The auto-renewal feature is disabled for the instance.\n\n>  This parameter only takes effect when the PayType parameter is set to drdsPre.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "MasterInstId",
      "description": "Specifies the ID of the primary instance. This parameter is only required when you create a read-only instance.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "MySQLVersion",
      "description": "Specifies the MySQL version that is supported by the instance. Valid values:\n\n*   **5**: The instance is fully compatible with MySQL 5.x. This value is the default value.\n*   **8**: The instance is fully compatible with MySQL 8.0.\n\n>  This parameter only takes effect when you create a primary instance. By default, the MySQL version of the read-only instance is the same as that of the primary instance.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "PayType",
      "description": "Specifies the billing method of the instance. Valid values:\n\n*   **drdsPre**: The instance uses the subscription billing method.\n*   **drdsPost**: The instance uses the pay-as-you-go billing method.\n*   **drdsRo**: By default, the pay-as-you-go billing method is used when you create read-only instances.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "PricingCycle",
      "description": "Specifies the unit of the subscription duration of the subscription instance. Valid values:\n\n*   **year**: The unit of the subscription duration is year.\n*   **month**: The unit of the subscription duration is month.\n\n>  This parameter is required if you set the PayType parameter to drdsPre.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Quantity",
      "description": "Specifies the number of instances to be created. You can set the value only to 1. The value specifies that you can create one instance each time.",
      "position": "Query",
      "type": "Integer",
      "required": true
    },
    {
      "name": "RegionId",
      "description": "Specifies the region ID of the instance.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ResourceGroupId",
      "description": "Specifies the ID of the resource group.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Specification",
      "description": "Specifies the specification code of the instance. The value consists of the instance type and the specified instance specification. For example, you can set the value to drds.sn2.4c16g.8c32g.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Type",
      "description": "Specifies the type of the instance. Set the value to PRIVATE. The value PRIVATE specifies that the instance is a dedicated instance.\n\n>  You can also set the value to 1 to specify that the instance is a dedicated instance.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "VpcId",
      "description": "Specifies the ID of the VPC.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "VswitchId",
      "description": "Specifies the ID of the vSwitch.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ZoneId",
      "description": "Specifies the zone ID of the instance.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "isHa",
      "description": "Specifies whether the instance is a high-availability instance.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    }
  ]
}