{
  "name": "ManagePrivateRds",
  "deprecated": false,
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "DBInstanceId",
      "description": "The ID of the custom ApsaraDB RDS instance at the storage layer.\n\n> You can call the [DescribeDrdsRdsInstances](~~215526~~) operation to query the details of all ApsaraDB RDS instances, including the ID of the instance.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "DrdsInstanceId",
      "description": "The ID of the PolarDB-X 1.0 instance.\n\n> You can call the [DescribeDrdsInstances](~~139284~~) operation to query the details of all PolarDB-X 1.0 instances within an Alibaba Cloud account, including the IDs of the instances.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Params",
      "description": "The JSON string that consists of request parameters and the values of the request parameters of an operation that you need to call for the custom ApsaraDB RDS instance. The value of a request parameter is of the STRING type. Example: `{NodeId:\"1797****\"}`.\n\nFor more information about the request parameters and valid values of the request parameters of each operation, see the request parameter sections in the following topics:\n\n*   [DescribeDBInstanceAttribute](~~26231~~)\n*   [DescribeAvailableClasses](~~196546~~)\n*   [DescribeSQLCollectorPolicy](~~26292~~)\n*   [ModifySQLCollectorPolicy](~~26293~~)\n*   [DescribeParameters](~~26285~~)\n*   [ModifyParameter](~~26286~~)\n*   [DescribeDBInstanceHAConfig](~~26244~~)\n*   [SwitchDBInstanceHA](~~26251~~)\n\n> Among the required request parameters of the preceding operations, you do not need to specify the `Action` and `DBInstanceId` parameters. You must specify all the other required request parameters.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RdsAction",
      "description": "The operation that you want to perform on the custom ApsaraDB RDS instance. Valid values:\n\n*   **DescribeDBInstanceAttribute**: queries the details of the custom ApsaraDB RDS instance.\n*   **DescribeAvailableClasses**: queries the specifications that are supported for a custom ApsaraDB RDS instance. The specifications include the instance type and the storage capacity.\n*   **DescribeSQLCollectorPolicy**: queries whether the SQL Explorer (SQL Audit) feature is enabled for custom ApsaraDB RDS instance.\n*   **ModifySQLCollectorPolicy**: enables or disables the SQL Explorer (SQL Audit) feature for the custom ApsaraDB RDS instance.\n*   **DescribeParameters**: queries the parameter settings of the custom ApsaraDB RDS instance.\n*   **ModifyParameter**: modifies the parameters of the custom ApsaraDB RDS instance.\n*   **DescribeDBInstanceHAConfig**: queries the high availability mode and data replication mode of the custom ApsaraDB RDS instance.\n*   **SwitchDBInstanceHA**: switches workloads between the primary and secondary custom ApsaraDB RDS instances.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "RegionId",
      "description": "The ID of the region in which the PolarDB-X 1.0 instance resides.\n\n> You can call the [DescribeDrdsInstances](~~139284~~) operation to query the details of all PolarDB-X 1.0 instances within an Alibaba Cloud account, including the IDs of regions in which the instances reside.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}