{
  "name": "ExecDatamask",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Data",
      "description": "The sensitive data to be de-identified. The value is a JSON string that contains the following parameters:\n\n*   **dataHeaderList**: the names of the columns in which data needs to be de-identified. Specify the column names in accordance with the order of data that needs to be de-identified.\n*   **dataList**: the data that needs to be de-identified.\n*   **ruleList**: the IDs of sensitive data detection rules used to detect data that needs to be de-identified. Specify the rule IDs in accordance with the order of data that needs to be de-identified. Each ID identifies a sensitive data detection rule that is used to detect a type of sensitive data. You can call the [DescribeRules](~~DescribeRules~~) operation to query the IDs of sensitive data detection rules.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "FeatureType",
      "description": "This parameter is deprecated.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "Lang",
      "description": "The language of the content within the request and response. Default value: **zh_cn**. Valid values:\n\n*   **zh_cn**: Simplified Chinese\n*   **en_us**: English",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TemplateId",
      "description": "The ID of the de-identification template. The ID is generated after you create the de-identification template in the [Data Security Center (DSC) console](https://yundun.console.aliyun.com/?\\&p=sddpnext#/sddp/dm/template). You can choose **Data desensitization** > **Desensitization Template** in the left-side navigation pane and obtain the ID of the de-identification template from the **Desensitization Template** page.\n\n*   If you select **Field name** as the matching mode of the template, DSC matches data based on the columns specified by the **dataHeaderList** parameter in the **Data** parameter.\n*   If you select **Sensitive type** as the matching mode of the template, DSC matches data based on the sensitive data detection rules specified by the **ruleList** parameter in the **Data** parameter.",
      "position": "Query",
      "type": "Long",
      "required": true
    }
  ]
}