{
  "name": "CreateCloudGtmAddressPool",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AcceptLanguage",
      "description": "The language of the response. Valid values:\n\n*   zh-CN: Chinese\n*   en-US (default): English",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "AddressPoolName",
      "description": "Address pool name, helping users distinguish the purpose of address pools.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "AddressPoolType",
      "description": "The type of the address pool. Valid values:\n\n*   IPv4: IPv4 addresses are returned for Domain Name System (DNS) resolution.\n*   IPv6: IPv6 addresses are returned for DNS resolution.\n*   domain: Domain names are returned for DNS resolution.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request. You can use the client to generate the token, but you must make sure that the token is unique among different requests. The token can contain only ASCII characters and cannot exceed 64 characters in length.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EnableStatus",
      "description": "The enabling state of the address pool. Valid values:\n\n*   enable: The address pool is enabled, and the addresses in the address pool are returned for DNS resolution when the health check results are normal.\n*   disable: The address pool is disabled, and the addresses in the address pool are not returned for DNS resolution regardless of whether the health check results are normal or not.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "HealthJudgement",
      "description": "The condition for determining the health status of the address pool. Valid values:\n\n*   any_ok: At least one address in the address pool is available.\n*   p30\\_ok: At least 30% of the addresses in the address pool are available.\n*   p50\\_ok: At least 50% of the addresses in the address pool are available.\n*   p70\\_ok: At least 70% of the addresses in the address pool are available.\n*   all_ok: All addresses in the address pool are available.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Remark",
      "description": "Remarks for the address pool, helping users distinguish the usage scenarios of different address pools.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}