{
  "name": "CreateCloudGtmAddress",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AcceptLanguage",
      "description": "The language of the response. Valid values:\n\n*   zh-CN: Chinese\n*   en-US (default): English",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Address",
      "description": "IP address or domain name.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "AttributeInfo",
      "description": "Address ownership information.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "AvailableMode",
      "description": "The failover mode that is used when address exceptions are identified. Valid values:\n\n*   auto: the automatic mode. The system determines whether to return an address based on the health check results. If the address fails health checks, the system does not return the address. If the address passes health checks, the system returns the address.\n*   manual: the manual mode. If an address is in the unavailable state, the address is not returned for DNS requests even if the address passes health checks. If an address is in the available state, the address is returned for DNS requests even if an alert is triggered when the address fails health checks.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request. You can use the client to generate the token, but you must make sure that the token is unique among different requests. The token can contain only ASCII characters and cannot exceed 64 characters in length.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EnableStatus",
      "description": "Indicates the current enabled status of the address:\n- enable: Enabled status \n- disable: Disabled status",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "HealthJudgement",
      "description": "The condition for determining the health status of the address. This parameter is required when HealthTasks is specified. Valid values:\n\n*   any_ok: The health check results of at least one health check template are normal.\n*   p30\\_ok: The health check results of at least 30% of health check templates are normal.\n*   p50\\_ok: The health check results of at least 50% of health check templates are normal.\n*   p70\\_ok: The health check results of at least 70% of health check templates are normal.\n*   all_ok: The health check results of all health check templates are normal.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "HealthTasks",
      "description": "The health check tasks associated with the address.",
      "position": "Query",
      "type": "Json",
      "required": false,
      "sub_parameters": [
        {
          "name": "Port",
          "position": "Query",
          "type": "Integer",
          "required": false
        },
        {
          "name": "TemplateId",
          "position": "Query",
          "type": "String",
          "required": false
        }
      ]
    },
    {
      "name": "ManualAvailableStatus",
      "description": "The availability state of the address. This parameter is required when AvailableMode is set to **manual**. Valid values:\n\n*   available: The address is normal. In this state, the address is returned for DNS requests even if an alert is triggered when the address fails health checks.\n*   unavailable: The address is abnormal. In this state, the address is not returned for DNS requests even if the address passes health checks.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Name",
      "description": "Address name.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Remark",
      "description": "Remarks.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Type",
      "description": "Address type:\n- IPv4\n- IPv6\n- domain",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}