{
  "name": "CreateCloudGtmInstanceConfig",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AcceptLanguage",
      "description": "The language of the response. Valid values:\n\n*   zh-CN: Chinese\n*   en-US: English",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ChargeType",
      "description": "",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request. You can specify a custom value for this parameter, but you must make sure that the token is unique among different requests. The token can contain only ASCII characters and cannot exceed 64 characters in length.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EnableStatus",
      "description": "The enabling state of the access domain name. Valid values:\n\n*   enable: The access domain name is enabled and the intelligent scheduling policy of the corresponding GTM instance takes effect.\n*   disable: The access domain name is disabled and the intelligent scheduling policy of the corresponding GTM instance is unavailable.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "InstanceId",
      "description": "The ID of the Global Traffic Manager (GTM) 3.0 instance. This ID uniquely identifies a GTM 3.0 instance.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Remark",
      "description": "The description of the access domain name.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ScheduleHostname",
      "description": "The hostname of the access domain name.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ScheduleRrType",
      "description": "The type of the Domain Name System (DNS) record configured for the access domain name. Valid values:\n\n*   A: IPv4 address\n*   AAAA: IPv6 address\n*   CNAME: domain name",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ScheduleZoneMode",
      "description": "The configuration mode of the access domain name. Valid values:\n\n*   sys_assign: system allocation. This mode is not supported.\n*   custom: custom allocation. You must select a zone within the account to which the instance belongs and enter a hostname to generate an access domain name.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ScheduleZoneName",
      "description": "The name of the parent zone for the access domain name configured in GTM. In most cases, the value of this parameter is the name of a zone hosted by Alibaba Cloud DNS. This zone belongs to the account to which the GTM instance belongs. You can specify the name of a zone or subzone.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Ttl",
      "description": "The global time to live (TTL) period. Unit: seconds. The global TTL period affects how long the DNS records that map the access domain name to the addresses in the address pools are cached in the local DNS servers of Internet service providers (ISPs). You can specify a custom value.",
      "position": "Query",
      "type": "Integer",
      "required": false
    }
  ]
}