{
  "name": "DescribeDomainResolveStatisticsSummary",
  "deprecated": false,
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Direction",
      "description": "The order in which you want to sort the query results. Valid values: DESC and ASC. DESC indicates that the query results are sorted in descending order. ASC indicates that the query results are sorted in ascending order.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EndDate",
      "description": "The end time in the yyyy-MM-dd format, for example, 2023-03-13.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Keyword",
      "description": "The keyword. The Keyword parameter must be used together with the SearchMode parameter.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Lang",
      "description": "The language used. Valid values: zh, en, and ja.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "PageNumber",
      "description": "The number of the page to return. Pages start from page 1. Default value: 1.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "PageSize",
      "description": "The number of entries to return on each page. Valid values: 1 to 1000.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "SearchMode",
      "description": "The search mode of the keyword. Valid values:\n\nLIKE and EXACT. LIKE is the default value and indicates the fuzzy search mode. EXACT indicates the exact match mode.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "StartDate",
      "description": "The start time in the yyyy-MM-dd format, for example, 2023-03-01.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Threshold",
      "description": "The threshold for the number of resolution requests. You can query the paid domain names at the specified quantity level of resolution requests and query the number of resolution requests. For example, if you set this parameter to 100, you can obtain data about the paid domain names with less than 100 resolution requests. If you do not specify this parameter, the data about the paid domain names that have resolution requests is obtained. If you set this parameter to a value less than 0, the data about all paid domain names is obtained. If you set this parameter to 0, the data about the paid domain names that do not have resolution requests is obtained. If you set this parameter to a value greater than 0, the data about the paid domain names whose number of resolution requests is less than or equal to the value of this parameter is obtained.",
      "position": "Query",
      "type": "Long",
      "required": false
    }
  ]
}