{
  "name": "DescribeRecordResolveStatisticsSummary",
  "deprecated": false,
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Direction",
      "description": "The order in which you want to sort the query results. Valid values: DESC and ASC. DESC is the default value and indicates that the query results are sorted in descending order. ASC indicates that the query results are sorted in ascending order.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DomainName",
      "description": "The domain name.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "DomainType",
      "description": "The type of the domain name. The parameter value is not case-sensitive. Valid values:\n\nPUBLIC and CACHE. PUBLIC is the default value and indicates an authoritative domain name. CACHE indicates a cache-accelerated domain name.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EndDate",
      "description": "The end time in the yyyy-MM-dd format, for example, 2023-03-13.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Keyword",
      "description": "The keyword. The Keyword parameter is used together with the SearchMode parameter.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Lang",
      "description": "The language used. Valid values: zh, en, and ja.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "PageNumber",
      "description": "The number of the page to return. Pages start from page 1. Default value: 1.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "PageSize",
      "description": "The number of entries to return on each page. Valid values: 1 to 1000.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "SearchMode",
      "description": "The search mode of the keyword. Valid values:\n\nLIKE (default): fuzzy search. EXACT: exact match.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "StartDate",
      "description": "The start time in the yyyy-MM-dd format, for example, 2023-03-01.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Threshold",
      "description": "The threshold for the number of resolution requests. You can query the subdomain names at the specified quantity level of resolution requests and query the number of resolution requests for each subdomain name. For example, if you set this parameter to 100, you can obtain data about the subdomain names with less than 100 resolution requests.\n\nIf you do not specify this parameter, the data about the subdomain names that have resolution requests is obtained.\n\nIf you set this parameter to a value less than 0, the data about all subdomain names is obtained.\n\nIf you set this parameter to 0, the data about the subdomain names that do not have resolution requests is obtained.\n\nIf you set this parameter to a value greater than 0, the data about the subdomain names whose number of resolution requests is less than or equal to the value of this parameter is obtained.",
      "position": "Query",
      "type": "Long",
      "required": false
    }
  ]
}