{
  "name": "UpdateCloudGtmInstanceConfigLbStrategy",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AcceptLanguage",
      "description": "The language in which the returned results are displayed. Valid values:\n\n*   **zh-CN**: Chinese\n*   **en-US** (default): English",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "AddressPoolLbStrategy",
      "description": "The new policy for load balancing between address pools. Valid values:\n\n*   round_robin: All address pools are returned for Domain Name System (DNS) requests from any source. All address pools are sorted in round-robin mode each time they are returned.\n*   sequence: The address pool with the smallest sequence number is preferentially returned for DNS requests from any source. The sequence number indicates the priority for returning the address pool. A smaller sequence number indicates a higher priority. If the address pool with the smallest sequence number is unavailable, the address pool with the second smallest sequence number is returned.\n*   weight: You can set a different weight value for each address pool. This way, address pools are returned based on the weight values.\n*   source_nearest: GTM returns different address pools based on the sources of DNS requests. This way, users can access nearby address pools.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request. You can use the client to generate the token, but you must make sure that the token is unique among different requests. The token can contain only ASCII characters and cannot exceed 64 characters in length.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ConfigId",
      "description": "The configuration ID of the access domain name. Two configuration IDs exist when the access domain name is bound to the same GTM instance but an A record and an AAAA record are configured for the access domain name. The configuration ID uniquely identifies a configuration.\n\nYou can call the [ListCloudGtmInstanceConfigs](~~ListCloudGtmInstanceConfigs~~) operation to query the configuration ID of the desired access domain name.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "InstanceId",
      "description": "The ID of the GTM 3.0 instance for which you want to modify the load balancing policy.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SequenceLbStrategyMode",
      "description": "The mode used if the address pool with the smallest sequence number is recovered. This parameter is required when AddressPoolLbStrategy is set to sequence. Valid values:\n\n*   preemptive: The address pool with the smallest sequence number is preferentially used if this address pool is recovered.\n*   non_preemptive: The current address pool is still used even if the address pool with the smallest sequence number is recovered.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}