{
  "name": "UpdateCloudGtmInstanceConfigBasic",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AcceptLanguage",
      "description": "The language of the response. Valid values:\n\n*   **zh-CN**: Chinese\n*   **en-US** (default): English",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request. You can use the client to generate the token, but you must make sure that the token is unique among different requests. The token can contain only ASCII characters and cannot exceed 64 characters in length.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ConfigId",
      "description": "The configuration ID of the access domain name. Two configuration IDs exist when the access domain name is bound to the same GTM instance but an A record and an AAAA record are configured for the access domain name. The configuration ID uniquely identifies a configuration.\n\nYou can call the [ListCloudGtmInstanceConfigs](~~2797349~~) operation to query the value of ConfigId for the access domain name.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "InstanceId",
      "description": "The ID of the GTM 3.0 instance for which you want to modify the TTL configuration.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ScheduleHostname",
      "description": "Host record of the domain accessed by GTM.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ScheduleZoneName",
      "description": "The zone (such as example.com) or subzone (such as a.example.com) of the GTM access domain name. In most cases, the zone or subzone is hosted in Authoritative DNS Resolution of the Alibaba Cloud DNS console within the account to which the GTM instance belongs.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Ttl",
      "description": "The global TTL value, in seconds. The global TTL value affects how long the DNS records that map the access domain name to the addresses in the address pools are cached in the local DNS servers of Internet service providers (ISPs).",
      "position": "Query",
      "type": "Integer",
      "required": false
    }
  ]
}