{
  "name": "UpdateCloudGtmMonitorTemplate",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AcceptLanguage",
      "description": "The language of the response. Valid values:\n\n*   zh-CN: Chinese\n*   en-US (default): English",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request. You can use the client to generate the token, but you must make sure that the token is unique among different requests. The token can contain only ASCII characters and cannot exceed 64 characters in length.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EvaluationCount",
      "description": "The number of retries. The system will only judge the application service as abnormal after consecutive monitoring failures to prevent inaccurate monitoring results due to momentary network fluctuations or other reasons. Available retry options are:\n- 1 \n- 2 \n- 3",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "ExtendInfo",
      "description": "The extended information. The value of this parameter is a JSON string. The required parameters vary based on the health check protocol.\n\n*   HTTP or HTTPS:\n\n    host: the Host field of an HTTP or HTTPS request header during an HTTP or HTTPS health check. The parameter value indicates the HTTP website that you want to visit. By default, the value is the primary domain name. You can change the value based on your business requirements.\n\n    path: the URL for HTTP or HTTPS health checks. Default value: /.\n\n    code: the alert threshold. During an HTTP or HTTPS health check, the system checks whether a web server functions as expected based on the status code that is returned from the web server. If the returned status code is greater than the specified threshold, the corresponding application service address is deemed abnormal. Valid values:\n\n    *   400: specifies an invalid request. If an HTTP or HTTPS request contains invalid request parameters, a web server returns a status code that is greater than 400. You must set path to an exact URL if you set code to 400.\n    *   500: specifies a server error. If some exceptions occur on a web server, the web server returns a status code that is greater than 500. This value is used by default.\n\n    sni: specifies whether to enable Server Name Indication (SNI). This parameter is used only when the health check protocol is HTTPS. SNI is an extension to the Transport Layer Security (TLS) protocol, which allows a client to specify the host to be connected when the client sends a TLS handshake request. TLS handshakes occur before any data of HTTP requests is sent. Therefore, SNI enables servers to identify the services that clients are attempting to access before certificates are sent. This allows the servers to present correct certificates to the clients. Valid values:\n\n    *   true: enables SNI.\n    *   false: disables SNI.\n\n    followRedirect: specifies whether to follow 3XX redirects. Valid values:\n\n    *   true: follows 3XX redirects. You are redirected to the destination address if a 3XX status code such as 301, 302, 303, 307, or 308 is returned.\n    *   false: does not follow 3XX redirects.\n\n*   ping:\n\n    packetNum: the total number of Internet Control Message Protocol (ICMP) packets that are sent to the address for each ping-based health check. Valid values: 20, 50, and 100.\n\n    packetLossRate: the ICMP packet loss rate for each ping-based health check. The packet loss rate in a health check can be calculated by using the following formula: Packet loss rate in a health check = (Number of lost packets/Total number of sent ICMP packets) × 100%. If the packet loss rate reaches the threshold, an alert is triggered. Valid values: 10, 30, 40, 80, 90, and 100.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "FailureRate",
      "description": "Percentage of selected node probe failures (%), that is, the percentage of abnormal detection points among the total detection points. When the failure ratio exceeds the set threshold, the service address is judged as abnormal. The available failure ratio thresholds are:\n- 20\n- 50\n- 80\n- 100",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "Interval",
      "description": "The time interval (in seconds) for each health check probe. By default, it probes every 60 seconds. The minimum supported interval for health checks is 15 seconds, available for flagship edition instances.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "IspCityNodes",
      "description": "The health check nodes. You can call the [ListCloudGtmMonitorNodes](~~2797327~~) operation to obtain the health check nodes.",
      "position": "Query",
      "type": "Json",
      "required": false,
      "sub_parameters": [
        {
          "name": "CityCode",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "IspCode",
          "position": "Query",
          "type": "String",
          "required": false
        }
      ]
    },
    {
      "name": "Name",
      "description": "The name of the health check probe template, which is generally recommended to be distinguishable and memorable for configuration personnel, ideally indicating the health check protocol for easier identification.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TemplateId",
      "description": "The ID of the health check template that you want to modify. This ID uniquely identifies the health check template.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Timeout",
      "description": "Probe timeout (in milliseconds), data packets not returned within the timeout period are considered as health check timeouts:\n- 2000\n- 3000\n- 5000\n- 10000",
      "position": "Query",
      "type": "Integer",
      "required": false
    }
  ]
}