{
  "version": "2015-12-15",
  "style": "restful",
  "apis": {
    "AttachInstances": {
      "title": "AttachInstances",
      "summary": "Adds existing Elastic Compute Service (ECS) instances to a Container Service for Kubernetes (ACK) cluster. When you need to add an ECS instance as a worker node to an ACK cluster or re-add a worker node to the cluster, you can call this operation.",
      "deprecated": false
    },
    "AttachInstancesToNodePool": {
      "title": "AttachInstancesToNodePool",
      "summary": "Adds existing nodes to a specific node pool. You can add existing ECS instances to a specific node pool in a Container Service for Kubernetes (ACK) cluster as worker nodes. You can also add removed worker nodes back to the node pool.",
      "deprecated": false
    },
    "CancelClusterUpgrade": {
      "title": "(Deprecated)CancelClusterUpgrade",
      "summary": "You can call the CancelClusterUpgrade operation to cancel the update of a cluster.",
      "deprecated": true
    },
    "CancelComponentUpgrade": {
      "title": "CancelComponentUpgrade",
      "summary": "You can call the CancelComponentUpgrade operation to cancel the update of a component.",
      "deprecated": true
    },
    "CancelOperationPlan": {
      "title": "CancelOperationPlan",
      "summary": "You can call the CancelOperationPlan operation to cancel a pending auto O\\\\\\\\\\\\\\\\\\\\&M plan.",
      "deprecated": false
    },
    "CancelTask": {
      "title": "CancelTask",
      "summary": "Cancels the execution of a cluster task.",
      "deprecated": false
    },
    "CheckControlPlaneLogEnable": {
      "title": "CheckControlPlaneLogEnable",
      "summary": "Queries the current log configuration of control plane components, including the log retention period and the log collection component. Container Service for Kubernetes (ACK) managed clusters can collect the logs of control plane components and deliver the logs to projects in Simple Log Service. These control plane components include Kube API Server, Kube Scheduler, Kube Controller Manager, and Cloud Controller Manager.",
      "deprecated": false
    },
    "CheckServiceRole": {
      "title": "CheckServiceRole",
      "summary": "Checks whether the specified service roles are granted to Container Service for Kubernetes (ACK) within the current Alibaba Cloud account. ACK can access other cloud services, such as Elastic Compute Service (ECS), Object Storage Service (OSS), File Storage NAS (NAS), and Server Load Balancer (SLB), only after ACK is assigned the required service roles.",
      "deprecated": false
    },
    "CleanClusterUserPermissions": {
      "title": "CleanClusterUserPermissions",
      "summary": "Deletes kubeconfig files that may pose potential risks from a user and revokes Role-Based Access Control (RBAC) permissions on a cluster.",
      "deprecated": false
    },
    "CleanUserPermissions": {
      "title": "CleanUserPermissions",
      "summary": "You can call the CleanUserPermissions operation to delete the kubeconfig files of the specified users and revoke the relevant Role-Based Access Control (RBAC) permissions. This API operation is suitable for scenarios where employees have resigned or the accounts of employees are locked.",
      "deprecated": false
    },
    "CreateAutoscalingConfig": {
      "title": "CreateAutoscalingConfig",
      "summary": "Creates a scaling configuration to allow the system to scale resources based on the given scaling rules. When you create a scaling configuration, you can specify the scaling metrics, thresholds, scaling order, and scaling interval.",
      "deprecated": false
    },
    "CreateCluster": {
      "title": "CreateCluster",
      "summary": "Creates a Container Service for Kubernetes (ACK) cluster. For example, you can create an ACK managed cluster, ACK Serverless cluster, ACK Edge cluster, or registered cluster. When you create an ACK cluster, you need to configure the cluster information, components, and cloud resources used by ACK.",
      "deprecated": false
    },
    "CreateClusterDiagnosis": {
      "title": "CreateClusterDiagnosis",
      "summary": "Starts a cluster diagnostic.",
      "deprecated": false
    },
    "CreateClusterInspectConfig": {
      "title": "CreateClusterInspectConfig",
      "summary": "Configures cluster inspection.",
      "deprecated": false
    },
    "CreateClusterNodePool": {
      "title": "CreateClusterNodePool",
      "summary": "Creates a node pool for a Container Service for Kubernetes (ACK) cluster. You can use node pools to facilitate node management. For example, you can schedule, configure, or maintain nodes by node pool, and enable auto scaling for a node pool. We recommend that you use a managed node pool, which can help automate specific O\\\\\\\\\\\\&M tasks for nodes, such as Common Vulnerabilities and Exposures (CVE) patching and node repair. This reduces your O\\\\\\\\\\\\&M workload.",
      "deprecated": false
    },
    "CreateKubernetesTrigger": {
      "title": "CreateKubernetesTrigger",
      "summary": "You can call the CreateKubernetesTrigger operation to create a trigger for an application.",
      "deprecated": true
    },
    "CreateTemplate": {
      "title": "CreateTemplate",
      "summary": "Creates an orchestration template. An orchestration template defines and describes a group of Kubernetes resources. It declaratively describes the configuration of an application or how an application runs. You can use orchestration templates to manage resources in Kubernetes clusters and automate resource deployment, such as pods, Services, Deployments, ConfigMaps, and persistent volumes (PVs).",
      "deprecated": false
    },
    "CreateTrigger": {
      "title": "CreateTrigger",
      "summary": "Creates a trigger for an application to redeploy the application pods when specific conditions are met.",
      "deprecated": false
    },
    "DeleteAlertContact": {
      "title": "DeleteAlertContact",
      "summary": "Deletes one or more ACK alert contacts.",
      "deprecated": false
    },
    "DeleteAlertContactGroup": {
      "title": "DeleteAlertContactGroup",
      "summary": "Deletes an ACK alert contact group.",
      "deprecated": false
    },
    "DeleteCluster": {
      "title": "DeleteCluster",
      "summary": "You can call the DeleteCluster operation to delete a cluster and specify whether to delete or retain the relevant cluster resources. Before you delete a cluster, you must manually delete workloads in the cluster, such as Deployments, StatefulSets, Jobs, and CronJobs. Otherwise, you may fail to delete the cluster.",
      "deprecated": false
    },
    "DeleteClusterInspectConfig": {
      "title": "DeleteClusterInspectConfig",
      "summary": "Deletes cluster inspection configurations.",
      "deprecated": false
    },
    "DeleteClusterNodepool": {
      "title": "DeleteClusterNodepool",
      "summary": "Deletes unused node pools. Deleting a node pool terminates all pods on its nodes, which triggers pod rescheduling. Insufficient cluster resources may cause scheduling failures and business impact.",
      "deprecated": false
    },
    "DeleteClusterNodes": {
      "title": "DeleteClusterNodes",
      "summary": "Removes nodes from a Container Service for Kubernetes (ACK) cluster when they are no longer required through the DeleteClusterNodes interface. When removing nodes, you can specify whether to release the Elastic Compute Service (ECS) instances and drain the nodes.",
      "deprecated": false
    },
    "DeleteKubernetesTrigger": {
      "title": "DeleteKubernetesTrigger",
      "summary": "You can call the DeleteKubernetesTrigger operation to delete an application trigger by trigger ID",
      "deprecated": true
    },
    "DeletePolicyInstance": {
      "title": "DeletePolicyInstance",
      "summary": "Deletes policy instances in a Container Service for Kubernetes (ACK) cluster.",
      "deprecated": false
    },
    "DeleteTemplate": {
      "title": "DeleteTemplate",
      "summary": "Deletes the orchestration templates that you no longer need.",
      "deprecated": false
    },
    "DeleteTrigger": {
      "title": "DeleteTrigger",
      "summary": "Deletes an application trigger.",
      "deprecated": false
    },
    "DeployPolicyInstance": {
      "title": "DeployPolicyInstance",
      "summary": "Deploys a policy in the specified namespaces of a specific Container Service for Kubernetes (ACK) cluster. You can create and deploy a security policy by specifying the policy type, action of the policy such as alerting or denying, and namespaces to which the policy applies.",
      "deprecated": false
    },
    "DescribeAddon": {
      "title": "DescribeAddon",
      "summary": "Queries the information about a component based on specific conditions such as the region, cluster type, cluster subtype defined by cluster profile, cluster version, and component name. The information includes whether the component is managed, the component type, supported custom parameter schema, compatible operating system architecture, and earliest supported cluster version.",
      "deprecated": false
    },
    "DescribeAddons": {
      "title": "(Deprecated)DescribeAddons",
      "summary": "You can call the DescribeAddons operation to query the details about all components that are supported by Container Service for Kubernetes (ACK).",
      "deprecated": true
    },
    "DescribeClusterAddonInstance": {
      "title": "(Deprecated)DescribeClusterAddonInstance",
      "summary": "You can call the DescribeClusterAddonInstance operation to query the information about a cluster component, including the version, status, and configuration of the component.",
      "deprecated": true
    },
    "DescribeClusterAddonMetadata": {
      "title": "(Deprecated)DescribeClusterAddonMetadata",
      "summary": "You can call the DescribeClusterAddonMetadata operation to query the metadata of a component version. The metadata includes the component version and available parameters.",
      "deprecated": true
    },
    "DescribeClusterAddonUpgradeStatus": {
      "title": "DescribeClusterAddonUpgradeStatus",
      "summary": "You can call the DescribeClusterAddonUpgradeStatus operation to query the update progress of a cluster component.",
      "deprecated": true
    },
    "DescribeClusterAddonsUpgradeStatus": {
      "title": "(Deprecated)DescribeClusterAddonsUpgradeStatus",
      "summary": "You can call the DescribeClusterAddonsUpgradeStatus operation to query the update progress of a component by component name.",
      "deprecated": true
    },
    "DescribeClusterAddonsVersion": {
      "title": "(Deprecated)DescribeClusterAddonsVersion",
      "summary": "You can call the DescribeClusterAddonsVersion operation to query the details about all components in a cluster by cluster ID.",
      "deprecated": true
    },
    "DescribeClusterAttachScripts": {
      "title": "DescribeClusterAttachScripts",
      "summary": "Queries the scripts used to add existing nodes to a Container Service for Kubernetes (ACK) cluster. ACK allows you to manually add existing Elastic Compute Service (ECS) instances to an ACK cluster as worker nodes or re-add worker nodes that you remove from the cluster to a node pool.",
      "deprecated": false
    },
    "DescribeClusterDetail": {
      "title": "DescribeClusterDetail",
      "summary": "You can call the DescribeClusterDetail operation to query the details of a Container Service for Kubernetes (ACK) cluster by cluster ID.",
      "deprecated": false
    },
    "DescribeClusterEvents": {
      "title": "DescribeClusterEvents",
      "summary": "Queries events and event details in a Container Service for Kubernetes (ACK) cluster, including the severity level, status, and start time of each event. Events are generated when clusters created, modified, and updated, node pools are created and scaled out, and components are installed.",
      "deprecated": false
    },
    "DescribeClusterLogs": {
      "title": "DescribeClusterLogs",
      "summary": "Queries the cluster log to help analyze cluster issues and locate the cause.",
      "deprecated": false
    },
    "DescribeClusterNodePoolDetail": {
      "title": "DescribeClusterNodePoolDetail",
      "summary": "You can call the DescribeClusterNodePoolDetail.html operation to query the details about a node pool in a cluster by node pool ID.",
      "deprecated": false
    },
    "DescribeClusterNodePools": {
      "title": "DescribeClusterNodePools",
      "summary": "Queries the information about all node pools in a cluster.",
      "deprecated": false
    },
    "DescribeClusterNodes": {
      "title": "DescribeClusterNodes",
      "summary": "null",
      "deprecated": false
    },
    "DescribeClusterResources": {
      "title": "DescribeClusterResources",
      "summary": "You can call the DescribeClusterResources operation to query all resources in a cluster by cluster ID.",
      "deprecated": false
    },
    "DescribeClusterTasks": {
      "title": "DescribeClusterTasks",
      "summary": "Queries tasks in a Container Service for Kubernetes (ACK) cluster.",
      "deprecated": false
    },
    "DescribeClusterUserKubeconfig": {
      "title": "DescribeClusterUserKubeconfig",
      "summary": "Kubeconfig files store identity and authentication information that is used by clients to access Container Service for Kubernetes (ACK) clusters. To use a kubectl client to manage an ACK cluster, you need to use the corresponding kubeconfig file to connect to the ACK cluster. We recommend that you keep kubeconfig files confidential and revoke kubeconfig files that are not in use. This helps prevent data leaks caused by the disclosure of kubeconfig files.",
      "deprecated": false
    },
    "DescribeClusterV2UserKubeconfig": {
      "title": null,
      "summary": null,
      "deprecated": true
    },
    "DescribeClusterVuls": {
      "title": "DescribeClusterVuls",
      "summary": "Queries the security vulnerability details of a cluster by cluster ID. The details include vulnerability name, vulnerability type, and vulnerability severity. We recommend that you scan your cluster on a regular basis to ensure cluster security.",
      "deprecated": false
    },
    "DescribeClusters": {
      "title": "DescribeClusters",
      "summary": "Queries all the clusters that belong to the current Alibaba Cloud account, including Kubernetes clusters and Swarm clusters.",
      "deprecated": true
    },
    "DescribeClustersForRegion": {
      "title": "DescribeClustersForRegion",
      "summary": "Queries all clusters in a specified region.",
      "deprecated": false
    },
    "DescribeClustersV1": {
      "title": "DescribeClustersV1",
      "summary": "Queries the details about Container Service for Kubernetes (ACK) clusters of specified types or specifications within an account.",
      "deprecated": false
    },
    "DescribeEvents": {
      "title": "DescribeEvents",
      "summary": "Queries the detailed information about a type of events, including the severity level, status, and time. Events are generated when clusters are created, modified, and updated, node pools are created and scaled out, and components are installed.",
      "deprecated": false
    },
    "DescribeEventsForRegion": {
      "title": "DescribeEventsForRegion",
      "summary": "Queries all events in a specified region.",
      "deprecated": false
    },
    "DescribeExternalAgent": {
      "title": "DescribeExternalAgent",
      "summary": "Queries the proxy configurations of a registered cluster by cluster ID.",
      "deprecated": true
    },
    "DescribeKubernetesVersionMetadata": {
      "title": "DescribeKubernetesVersionMetadata",
      "summary": "Queries the detailed information about Kubernetes versions, including the version number, release date, expiration date, compatible OSs, and runtime.",
      "deprecated": false
    },
    "DescribeNodePoolVuls": {
      "title": "DescribeNodePoolVuls",
      "summary": "Queries the vulnerability information of a node pool, such as vulnerability names and severity levels, by specifying the ID of the node pool. We recommend that you periodically scan node pools for vulnerabilities to enhance cluster security.",
      "deprecated": false
    },
    "DescribePolicies": {
      "title": "DescribePolicies",
      "summary": "Queries a list of security policies. Container Service for Kubernetes (ACK) clusters offer a variety of built-in container security policies, such as Compliance, Infra, K8s-general, and pod security policy (PSP). You can use these policies to ensure the security of containers running in a production environment.",
      "deprecated": false
    },
    "DescribePolicyDetails": {
      "title": "DescribePolicyDetails",
      "summary": "Queries the detailed information about a policy. The information includes the content, action, and severity level of the policy. Container Service for Kubernetes (ACK) provides the following types of predefined security policies: Compliance, Infra, K8s-general, and pod security policy (PSP). These policies ensure that containers are running in the production environment in a secure manner.",
      "deprecated": false
    },
    "DescribePolicyGovernanceInCluster": {
      "title": "DescribePolicyGovernanceInCluster",
      "summary": "Container Service for Kubernetes (ACK) clusters offer a variety of built-in container security policies, such as Compliance, Infra, K8s-general, and pod security policy (PSP). You can use these policies to ensure the security of containers running in a production environment. You can call the DescribePolicyGovernanceInCluster operation to query the details of policies for an ACK cluster. For example, you can query the number of policies that are enabled per severity level, the audit logs of policies, and the blocking and alerting information.",
      "deprecated": false
    },
    "DescribePolicyInstances": {
      "title": "DescribePolicyInstances",
      "summary": "Queries the detailed information about policy instances of the specified type in a Container Service for Kubernetes (ACK) cluster, such as the policy description and severity level. You can choose a type of security policy for an ACK cluster, specify the action and applicable scope of the policy, and then create and deploy a policy instance.",
      "deprecated": false
    },
    "DescribePolicyInstancesStatus": {
      "title": "DescribePolicyInstancesStatus",
      "summary": "Queries the deployment of policy instances in the current Container Service for Kubernetes (ACK) cluster, including the number of policy instances of each type and the number of policy types of each severity level.",
      "deprecated": false
    },
    "DescribeResourcesDeleteProtection": {
      "title": "DescribeResourcesDeleteProtection",
      "summary": "Queries whether the deletion protection feature is enabled for the specified resources in the cluster. The resources that you can query include namespaces and Services.",
      "deprecated": false
    },
    "DescribeSubaccountK8sClusterUserConfig": {
      "title": "DescribeSubaccountK8sClusterUserConfig",
      "summary": "Queries or issues the kubeconfig credentials of a Resource Access Management (RAM) user or RAM role of the account. If you are the permission manager of a Container Service for Kubernetes (ACK) cluster, you can issue the kubeconfig credentials to a specific RAM user or RAM role of the account by using the Alibaba Cloud account. The kubeconfig credentials, which are used to connect to the ACK cluster, contain the identity information about the RAM user or RAM role.",
      "deprecated": false
    },
    "DescribeTaskInfo": {
      "title": "DescribeTaskInfo",
      "summary": "Queries detailed information about a task, such as the task type, status, and progress.",
      "deprecated": false
    },
    "DescribeTemplateAttribute": {
      "title": "DescribeTemplateAttribute",
      "summary": "An orchestration template defines and describes a group of Kubernetes resources. It declaratively describes the configuration of an application or how an application runs. You can call the DescribeTemplates API operation to query orchestration templates and their detailed information, including access permissions, YAML content, and labels.",
      "deprecated": false
    },
    "DescribeTemplates": {
      "title": "DescribeTemplates",
      "summary": "An orchestration template defines and describes a group of Kubernetes resources. It declaratively describes the configuration of an application or how an application runs. You can call the DescribeTemplates API operation to query orchestration templates and their detailed information, including access permissions, YAML content, and labels.",
      "deprecated": false
    },
    "DescribeTrigger": {
      "title": "DescribeTrigger",
      "summary": "Queries triggers that match specific conditions.",
      "deprecated": false
    },
    "DescribeUserClusterNamespaces": {
      "title": "DescribeUserClusterNamespaces",
      "summary": "You can use Kubernetes namespaces to limit users from accessing resources in a Container Service for Kubernetes (ACK) cluster. Users that are granted Role-Based Access Control (RBAC) permissions only on one namespace cannot access resources in other namespaces. Queries the RBAC permissions that are granted to the current Resource Access Management (RAM) user or RAM role on an ACK cluster.",
      "deprecated": false
    },
    "DescribeUserPermission": {
      "title": "DescribeUserPermission",
      "summary": "In an Container Service for Kubernetes (ACK) cluster, you can create and specify different Resource Access Management (RAM) users or roles to have different access permissions. This ensures access control and resource isolation. You can call the DescribeUserPermission operation to query the permissions that are granted to a RAM user or RAM role on ACK clusters, including the resources that are allowed to access, the scope of the permissions, the predefined role, and the permission source.",
      "deprecated": false
    },
    "DescribeUserQuota": {
      "title": "DescribeUserQuota",
      "summary": "Queries quotas related to Container Service for Kubernetes (ACK) clusters, node pools, and nodes. To increase a quota, submit an application in the Quota Center console.",
      "deprecated": false
    },
    "FixNodePoolVuls": {
      "title": "FixNodePoolVuls",
      "summary": "Patches node vulnerabilities in a node pool to enhance node security. Cloud Security provided by Alibaba Cloud periodically scans Elastic Compute Service (ECS) instances for vulnerabilities and provides suggestions on how to patch the detected vulnerabilities. Vulnerability patching may require node restarts. Make sure that your cluster has sufficient idle nodes for node draining.",
      "deprecated": false
    },
    "GetClusterAddonInstance": {
      "title": "GetClusterAddonInstance",
      "summary": "You can call the GetClusterAddonInstance operation to query the information of a component instance in a cluster, including the version, configurations, and log status of the component instance.",
      "deprecated": false
    },
    "GetClusterAuditProject": {
      "title": "GetClusterAuditProject",
      "summary": "You can call the GetClusterAuditProject operation to check whether the cluster has API Server auditing enabled and the corresponding Simple Log Service project that stores API Server audit logs.",
      "deprecated": false
    },
    "GetClusterCheck": {
      "title": "GetClusterCheck",
      "summary": "Queries a cluster check task by cluster ID and task ID. You can view the status, check items, creation time, and end time of the task. Container Intelligence Service (CIS) provides a variety of Kubernetes cluster check features, including cluster update check, cluster migration check, component installation check, component update check, and node pool check.",
      "deprecated": false
    },
    "GetClusterDiagnosisCheckItems": {
      "title": "GetClusterDiagnosisCheckItems",
      "summary": "Queries cluster diagnostic items.",
      "deprecated": false
    },
    "GetClusterDiagnosisResult": {
      "title": "GetClusterDiagnosisResult",
      "summary": "Queries cluster diagnostic results.",
      "deprecated": false
    },
    "GetClusterInspectConfig": {
      "title": "GetClusterInspectConfig",
      "summary": "Retrieves cluster inspection configuration.",
      "deprecated": false
    },
    "GetClusterInspectReportDetail": {
      "title": "GetClusterInspectReportDetail",
      "summary": "Obtain the details of the inspection report for the cluster",
      "deprecated": false
    },
    "GetKubernetesTrigger": {
      "title": "GetKubernetesTrigger",
      "summary": "You can call the GetKubernetesTrigger operationto query the triggers of an application by application name.",
      "deprecated": true
    },
    "GetUpgradeStatus": {
      "title": "(Deprecated)GetUpgradeStatus",
      "summary": "You can call the GetUpgradeStatus operation to query the update progress of a cluster by cluster ID.",
      "deprecated": true
    },
    "GrantPermissions": {
      "title": "GrantPermissions",
      "summary": "By default, RAM users or roles who aren't cluster creators and haven't been granted full cluster permissions have no RBAC permissions in the cluster. You can call this interface to update RBAC access permissions for RAM users/roles, including accessible resources, permission scopes, and preset roles, for enhanced security control on resources in Container Service for Kubernetes (ACK) clusters.",
      "deprecated": false
    },
    "InstallClusterAddons": {
      "title": "InstallClusterAddons",
      "summary": "Installs a component by specifying the name and version of the component. To enhance Kubernetes capabilities, you can install a variety of components in Container Service for Kubernetes (ACK) clusters, such as fully-managed core components and application, logging and monitoring, network, storage, and security group components.",
      "deprecated": false
    },
    "InstallNodePoolComponents": {
      "title": null,
      "deprecated": false
    },
    "ListAddons": {
      "title": "ListAddons",
      "summary": "Queries the available components based on specific conditions such as the region, cluster type, cluster subtype defined by cluster profile, and cluster version and queries the detailed information about a component. The information includes whether the component is managed, the supported custom parameter schema, and compatible operating system architecture.",
      "deprecated": false
    },
    "ListClusterAddonInstanceResources": {
      "title": null,
      "summary": null,
      "deprecated": false
    },
    "ListClusterAddonInstances": {
      "title": "ListClusterAddonInstances",
      "summary": "Queries the component instances that are running in the specified cluster and the information about the component instances. The information includes the component version and status.",
      "deprecated": false
    },
    "ListClusterChecks": {
      "title": "ListClusterChecks",
      "summary": "You can call the ListClusterChecks operation to query all the cluster check results of a cluster.",
      "deprecated": false
    },
    "ListClusterInspectReports": {
      "title": "ListClusterInspectReports",
      "summary": "Obtains the details of the cluster inspection report.",
      "deprecated": false
    },
    "ListClusterKubeconfigStates": {
      "title": "ListClusterKubeconfigStates",
      "summary": "Queries the kubeconfig files that are issued to users for the current cluster and the status of the kubeconfig files.",
      "deprecated": false
    },
    "ListOperationPlans": {
      "title": "ListOperationPlans",
      "summary": "Queries the automated maintenance schedules of a cluster.",
      "deprecated": false
    },
    "ListOperationPlansForRegion": {
      "title": null,
      "summary": null,
      "deprecated": false
    },
    "ListTagResources": {
      "title": "ListTagResources",
      "summary": "Queries resource labels and the detailed information, such as the key-value pairs of the labels and the clusters to which the labels are added. You can use labels to classify and manage Container Service for Kubernetes (ACK) clusters in order to meet monitoring, cost analysis, and tenant isolation requirements.",
      "deprecated": false
    },
    "ListUserKubeConfigStates": {
      "title": "ListUserKubeConfigStates",
      "summary": "You can call the ListUserKubeConfigStates operation to query the status of the kubeconfig files of all clusters managed by the current user.",
      "deprecated": false
    },
    "MigrateCluster": {
      "title": "MigrateCluster",
      "summary": "The Container Service for Kubernetes (ACK) managed Pro cluster type is developed based on the ACK managed Basic cluster type. It inherits all benefits of ACK managed clusters, such as fully-managed control planes and control plane high availability. It further enhances reliability, security, scheduling capabilities, and offers service level agreement (SLA)-backed guarantees, making it ideal for enterprise customers with large-scale production workloads requiring high stability and security. You can call the MigrateCluster operation to migrate an ACK managed Basic cluster to an ACK managed Pro cluster.",
      "deprecated": false
    },
    "ModifyCluster": {
      "title": "ModifyCluster",
      "summary": "You can call the ModifyCluster operation to modify the cluster configurations by cluster ID.",
      "deprecated": false
    },
    "ModifyClusterAddon": {
      "title": "ModifyClusterAddon",
      "summary": "Modifies the configuration of a cluster component. This operation may affect your businesses. We recommend that you assess the impact, back up data, and perform the operation during off-peak hours.",
      "deprecated": false
    },
    "ModifyClusterNodePool": {
      "title": "ModifyClusterNodePool",
      "summary": "You can call the ModifyClusterNodePool operation to modify the configuration of a node pool with the specified node pool ID.",
      "deprecated": false
    },
    "ModifyClusterTags": {
      "title": "ModifyClusterTags",
      "summary": "You can add labels in key-value pairs to clusters. This allows cluster developers or O\\\\\\&M engineers to classify and manage clusters in a more flexible manner. This also meets the requirements for monitoring, cost analysis, and tenant isolation. You can call the ModifyClusterTags operation to modify the labels of a cluster.",
      "deprecated": false
    },
    "ModifyNodePoolNodeConfig": {
      "title": "ModifyNodePoolNodeConfig",
      "summary": "Modifies the configuration of a node pool, such as the kubelet configuration and node rolling update configuration. After you modify the node pool configuration, nodes are batch updated and the kubelet on each node is restarted. This may adversely affect the nodes and workloads. We recommend that you perform this operation during off-peak hours.",
      "deprecated": false
    },
    "ModifyPolicyInstance": {
      "title": "ModifyPolicyInstance",
      "summary": "Updates a policy in a specific Container Service for Kubernetes (ACK) cluster. You can modify the action of the policy such as alerting or denying and namespaces to which the policy applies.",
      "deprecated": false
    },
    "OpenAckService": {
      "title": "OpenAckService",
      "summary": "When using Container Service for Kubernetes (ACK) for the first time, you must call the OpenAckService operation to activate the service.",
      "deprecated": false
    },
    "PauseClusterUpgrade": {
      "title": "(Deprecated)PauseClusterUpgrade",
      "summary": "You can call the PauseClusterUpgrade operation to pause the update of a Container Service for Kubernetes (ACK) cluster.",
      "deprecated": true
    },
    "PauseComponentUpgrade": {
      "title": "PauseComponentUpgrade",
      "summary": "You can call the PauseComponentUpgrade operation to pause the update of a component.",
      "deprecated": true
    },
    "PauseTask": {
      "title": "PauseTask",
      "summary": "Pauses an on-going task.",
      "deprecated": false
    },
    "RemoveNodePoolNodes": {
      "title": "RemoveNodePoolNodes",
      "summary": "Removes nodes from a node pool.",
      "deprecated": false
    },
    "RepairClusterNodePool": {
      "title": "RepairClusterNodePool",
      "summary": "Repairs a node pool.",
      "deprecated": false
    },
    "ResumeComponentUpgrade": {
      "title": "ResumeComponentUpgrade",
      "summary": "You can call the ResumeComponentUpgrade operation to resume the update of a component.",
      "deprecated": true
    },
    "ResumeTask": {
      "title": "ResumeTask",
      "summary": "Resumes a task.",
      "deprecated": false
    },
    "ResumeUpgradeCluster": {
      "title": "(Deprecated)ResumeUpgradeCluster",
      "summary": "You can call the ResumeUpgradeCluster operation to resume the update of a cluster by cluster ID.",
      "deprecated": true
    },
    "RevokeK8sClusterKubeConfig": {
      "title": "RevokeK8sClusterKubeConfig",
      "summary": "You can call the RevokeK8sClusterKubeConfig operation to revoke the kubeconfig file of a cluster that belongs to the current Alibaba Cloud account or RAM user. After the kubeconfig file is revoked, the cluster generates a new kubeconfig file, and the original kubeconfig file becomes invalid.",
      "deprecated": false
    },
    "RunClusterCheck": {
      "title": "RunClusterCheck",
      "summary": "Container Intelligence Service (CIS) provides a variety of cluster check capabilities to allow you to perform cluster update check, cluster migration check, component installation check, component update check, and node pool check. A precheck is automatically triggered before an update, migration, or installation is performed. You can perform changes only if the cluster passes the precheck. You can also manually call the RunClusterCheck operation to initiate cluster checks. We recommend that you periodically check and maintain your cluster to mitigate potential risks.",
      "deprecated": false
    },
    "RunClusterInspect": {
      "title": "RunClusterInspect",
      "summary": "Triggers a cluster inspection and generates a report.",
      "deprecated": false
    },
    "ScaleClusterNodePool": {
      "title": "ScaleClusterNodePool",
      "summary": "Scales out a node pool.",
      "deprecated": false
    },
    "ScanClusterVuls": {
      "title": "ScanClusterVuls",
      "summary": "Scans for vulnerabilities in a Container Service for Kubernetes (ACK) cluster, including workload vulnerabilities, third-party software vulnerabilities, CVE vulnerabilities, WebCMS vulnerabilities, and Windows vulnerabilities. We recommend that you scan your cluster on a regular basis to ensure cluster security.",
      "deprecated": false
    },
    "StartAlert": {
      "title": "StartAlert",
      "summary": "Activates the specified alert rule(s).",
      "deprecated": false
    },
    "StopAlert": {
      "title": "StopAlert",
      "summary": "You can call the StopAlert operation to disable an alert rule or an alert rule set in the alert center of Container Service for Kubernetes (ACK).",
      "deprecated": false
    },
    "SyncClusterNodePool": {
      "title": "SyncClusterNodePool",
      "summary": "Synchronizes the information about a node pool, including the metadata and node information of the node pool.",
      "deprecated": false
    },
    "TagResources": {
      "title": "TagResources",
      "summary": "You can add labels in key-value pairs to clusters. This allows cluster developers or O\\\\\\&M engineers to classify and manage clusters in a more flexible manner. This also meets the requirements for monitoring, cost analysis, and tenant isolation. You can call the TagResources operation to add labels to a cluster.",
      "deprecated": false
    },
    "UnInstallClusterAddons": {
      "title": "UnInstallClusterAddons",
      "summary": "Uninstalls components that you no longer need from a cluster. You must specify the name of the components and specify whether to release associated Alibaba Cloud resources from the cluster.",
      "deprecated": false
    },
    "UntagResources": {
      "title": "UntagResources",
      "summary": "If you no longer need the labels (key-value pairs) of a cluster, you can call the UntagResources operation to delete the labels.",
      "deprecated": false
    },
    "UpdateClusterAuditLogConfig": {
      "title": "UpdateClusterAuditLogConfig",
      "summary": "You can call the UpdateClusterAuditLogConfig operation to enable or disable the audit log feature in a Container Service for Kubernetes (ACK) cluster and update the audit log configuration. This operation also allows you to record requests to the Kubernetes API and the responses, which can be used to trace cluster operation history and troubleshoot cluster issues.",
      "deprecated": false
    },
    "UpdateClusterInspectConfig": {
      "title": "UpdateClusterInspectConfig",
      "summary": "Modifies cluster inspection configurations.",
      "deprecated": false
    },
    "UpdateContactGroupForAlert": {
      "title": "UpdateContactGroupForAlert",
      "summary": "You can call the UpdateContactGroupForAlert operation to specify a contact group for an alert rule in an ACK cluster.",
      "deprecated": false
    },
    "UpdateControlPlaneLog": {
      "title": "UpdateControlPlaneLog",
      "summary": "Modifies the log configurations of control plane components. The configurations include the log retention period and components whose logs that you want to collect. Container Service for Kubernetes (ACK) managed clusters can collect the logs of control plane components and deliver the logs to projects in Simple Log Service. These control plane components include Kube-apiserver, kube-scheduler, Kubernetes controller manager, and cloud controller manager (CCM).",
      "deprecated": false
    },
    "UpdateK8sClusterUserConfigExpire": {
      "title": "UpdateK8sClusterUserConfigExpire",
      "summary": "Sets the validity period of a kubeconfig file used by a Resource Access Management (RAM) user or RAM role to connect to a Container Service for Kubernetes (ACK) cluster. The validity period ranges from 1 to 876,000 hours. You can call this API operation when you customize configurations by using an Alibaba Cloud account. The default validity period of a kubeconfig file is three years.",
      "deprecated": false
    },
    "UpdateNodePoolComponent": {
      "title": null,
      "deprecated": false
    },
    "UpdateResourcesDeleteProtection": {
      "title": "UpdateResourcesDeleteProtection",
      "summary": "Updates the deletion protection status of the specified resources. You can enable or disable deletion protection for namespaces and Services. You can call this operation to enable deletion protection for namespaces or Services that involve businesses-critical and sensitive data to avoid incurring maintenance costs caused by accidental namespace or Service deletion.",
      "deprecated": false
    },
    "UpdateTemplate": {
      "title": "UpdateTemplate",
      "summary": "Updates the configurations of an orchestration template. An orchestration template defines and describes a group of Container Service for Kubernetes (ACK) resources. An orchestration template describes the configurations of an application or how an application runs in a declarative manner.",
      "deprecated": false
    },
    "UpdateUserPermissions": {
      "title": "UpdateUserPermissions",
      "summary": "In a Container Service for Kubernetes (ACK) cluster, non-cluster creators, Resource Access Management (RAM) users, and RAM roles do not have any Role-Based Access Control (RBAC) permissions in the cluster by default. You can call this operation to specify the resources that can be accessed, permission scope, and predefined roles. This helps you better manage the access control on resources in ACK clusters.",
      "deprecated": false
    },
    "UpgradeCluster": {
      "title": "UpgradeCluster",
      "summary": "Outdated Kubernetes versions may have security and stability issues. We recommend that you update the Kubernetes version of your cluster at the earliest opportunity to enjoy the new features of the new Kubernetes version. You can call the UpgradeCluster operation to manually upgrade a cluster.",
      "deprecated": false
    },
    "UpgradeClusterAddons": {
      "title": "UpgradeClusterAddons",
      "summary": "Updates cluster add-ons to newer versions for enhanced functionality.",
      "deprecated": false
    },
    "UpgradeClusterNodepool": {
      "title": "UpgradeClusterNodepool",
      "summary": "You can call the UpgradeClusterNodepool operation to update the Kubernetes version, OS version, or container runtime version of the nodes in a node pool.",
      "deprecated": false
    }
  }
}