{
  "name": "AssociateAnycastEipAddress",
  "deprecated": false,
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AnycastId",
      "description": "The ID of the Anycast EIP.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "AssociationMode",
      "description": "The association mode. Valid values:\n\n*   **Default**: the default mode. In this mode, the endpoint to be associated serves as the default origin server.\n*   **Normal**: the standard mode. In this mode, the endpoint to be associated serves as a standard origin server.\n\n> You can associate endpoints in multiple regions with an Anycast EIP. However, only one endpoint can serve as the default origin server. Others serve as standard origin servers. If you do not specify or add an access point, requests are forwarded to the default origin server.\\\n\n\n*   If this is your first time to associate an Anycast EIP with an endpoint, set the value to **Default**.\n*   If not, you can also set the value to **Default**, which specifies a new default origin server. In this case, the previous origin server functions as a standard origin server.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "BindInstanceId",
      "description": "The ID of the endpoint with which you want to associate the Anycast EIP.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "BindInstanceRegionId",
      "description": "The ID of the region where the endpoint is deployed.\n\nYou can associate Anycast EIPs only with endpoints in specific regions. You can call the [DescribeAnycastServerRegions](~~171939~~) operation to query the region IDs.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "BindInstanceType",
      "description": "The type of endpoint with which you want to associate the Anycast EIP. Valid values:\n\n*   **SlbInstance**: internal-facing Server Load Balancer (SLB) instance that is deployed in a virtual private cloud (VPC)\n*   **NetworkInterface**: elastic network interface (ENI)",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request.\n\nYou can use the client to generate the token, but you must make sure that the token is unique among different requests. The token can contain only ASCII characters and cannot exceed 64 characters in length.\n\n> If you do not specify this parameter, the system automatically uses the **request ID** as the **client token**. The **request ID** may be different for each request.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DryRun",
      "description": "Specifies whether to perform only a dry run, without performing the actual request. Valid values:\n\n*   **true**: performs only a dry run. The system checks the request for potential issues, including missing parameter values, incorrect request syntax, and service limits. If the request fails the dry run, an error message is returned. If the request passes the dry run, the `DryRunOperation` error code is returned.\n*   **false**(default): performs a dry run and performs the actual request. If the request passes the dry run, a 2xx HTTP status code is returned and the operation is performed.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "PopLocations",
      "description": "The information about the access points in associated access areas when you associate an Anycast EIP with an endpoint.\n\nIf this is your first time to associate an Anycast EIP with an endpoint, ignore this parameter. The system automatically associates all access areas.\n\nYou can call the [DescribeAnycastPopLocations](~~171938~~) operation to query information about access points in supported access areas.",
      "position": "Query",
      "type": "Array",
      "required": false
    },
    {
      "name": "PrivateIpAddress",
      "description": "The secondary private IP address of the ENI with which you want to associate the Anycast EIP.\n\nThis parameter is valid only when you set **BindInstanceType** to **NetworkInterface**. If you do not set this parameter, the primary private IP address of the ENI is used.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}