{
  "name": "DeployApplication",
  "deprecated": false,
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "POST",
  "pathPattern": "/pop/v5/changeorder/co_deploy",
  "parameters": [
    {
      "name": "AppEnv",
      "description": "The environment variables of the application. Specify each environment variable by using two key-value pairs. Example: `{\"name\":\"x\",\"value\":\"y\"},{\"name\":\"x2\",\"value\":\"y2\"}`. The `keys` of the two key-value pairs are `name` and `value`.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "AppId",
      "description": "The ID of the application. You can call the ListApplication operation to query the application ID. For more information, see [ListApplication](~~423162~~).",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Batch",
      "description": "The number of batches per instance group.\n\n*   If you specify an ID when you set the GroupId parameter, the application is deployed to the specified instance group. The minimum number of batches that can be specified is 1. The maximum number of batches is the maximum number of ECS instances in the Normal state in the instance group. The actual value falls in the range of \\[1, specified number]. The specified number of batches equals the number of ECS instances in the specified instance group.\n*   If you set the GroupId parameter to all, the application is deployed to all instance groups. The minimum number of batches that can be specified is 1. The maximum number of batches is the number of ECS instances in the instance group that has the largest number of ECS instances in the Normal state.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "BatchWaitTime",
      "description": "The wait time between deployment batches for the application. Unit: minutes.\n\n*   Default value: 0. If no wait time between deployment batches is needed, set this parameter to 0.\n*   Maximum value: 5.\n\nIf many deployment batches are needed, we recommend that you specify a small value for this parameter. Otherwise, the application deployment is time-consuming.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "BuildPackId",
      "description": "The build package number of EDAS Container.\n\n*   You do not need to set the parameter if you do not need to change the EDAS Container version during the deployment.\n*   Set the parameter if you need to update the EDAS Container version of the application during the deployment.\n\nYou can query the build package number by using one of the following methods:\n\n*   Call the ListBuildPack operation. For more information, see [ListBuildPack](~~149391~~).\n*   Obtain the value in the **Build package number** column of the [Release notes for EDAS Container](~~92614~~) topic. For example, `59` indicates `EDAS Container 3.5.8`.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "ComponentIds",
      "description": "The IDs of the components used by the application. The parameter is not applicable to High-Speed Framework (HSF) applications. You can call the ListComponents operation to query the component IDs. For more information, see [ListComponents](~~423223~~).\n\n*   If you have specified the component IDs when you create the application, you do not need to set the parameter when you deploy the application.\n*   Set the parameter if you need to update the component versions for the application during the deployment.\n\nValid values for common application components:\n\n*   4: Apache Tomcat 7.0.91\n*   7: Apache Tomcat 8.5.42\n*   5: OpenJDK 1.8.x\n*   6: OpenJDK 1.7.x\n\nFor more information, see the Common application parameters section of the [InsertApplication](~~423185~~) topic.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DeployType",
      "description": "The deployment mode of the application. Valid values: `url` and `image`. The image value is deprecated. You can deploy an application to a Swarm cluster only by using an image.``",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Desc",
      "description": "The description of the application deployment.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Gray",
      "description": "Specifies whether canary release is selected as the deployment method. Valid values:\n\n*   true: Canary release is selected.\n\n    *   To implement a canary release, specify the GroupId parameter, which specifies the ID of the instance group for the canary release.\n    *   Canary release can be selected as the deployment method for only one batch.\n    *   After the canary release is complete, the application is released in regular mode. The Batch parameter specifies the number of batches.\n\n*   false: Single-batch release or phased release is selected.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "GroupId",
      "description": "The ID of the instance group to which the application is deployed. You can call the ListDeployGroup operation to query the ID of the instance group. For more information, see [ListDeployGroup](~~423184~~).\n\nSet the parameter to `all` if you want to deploy the application to all instance groups.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ImageUrl",
      "description": "The URL of the application image that is used to deploy the application in a Swarm cluster. We recommend that you use an image that is stored in Alibaba Cloud Container Registry. This parameter is deprecated.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "PackageVersion",
      "description": "The version of the application deployment package. The value can be up to 64 characters in length. We recommend that you use a timestamp.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ReleaseType",
      "description": "The mode in which the deployment batches are triggered. Valid values:\n\n*   0: automatic.\n*   1: You must manually trigger the next batch. You can manually click **Proceed to Next Batch** in the console or call the ContinuePipeline operation to proceed to the next batch. We recommend that you choose the automatic mode when you call an API operation to deploy the application. For more information, see [ContinuePipeline](~~126990~~).",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "TrafficControlStrategy",
      "description": "The canary release policy. For more information about canary release policies, see [DeployK8sApplication](~~423212~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "WarUrl",
      "description": "The URL of the application deployment package. The package can be a WAR or JAR package. This parameter is required if you set the **DeployType** parameter to `url`. We recommend that you specify the URL of an application deployment package that is stored in an Object Storage Service (OSS) bucket.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}