{
  "name": "ScaleoutApplicationWithNewInstances",
  "deprecated": false,
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "POST",
  "pathPattern": "/pop/v5/scaling/scale_out",
  "parameters": [
    {
      "name": "AppId",
      "description": "The ID of the application that you want to scale out. You can call the ListApplication operation to query the application ID. For more information, see [ListApplication](~~149390~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "AutoRenew",
      "description": "Specifies whether to enable auto-renewal. This parameter takes effect only when the InstanceChargeType parameter is set to PrePaid. Valid values:\n\n*   true: enables auto-renewal.\n*   false: does not enable auto-renewal. This is the default value.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "AutoRenewPeriod",
      "description": "The auto-renewal period. Valid values:\n\n*   If the InstanceChargePeriodUnit parameter is set to Week, the valid values of the AutoRenewPeriod parameter are 1, 2, and 3.\n*   If the InstanceChargePeriodUnit parameter is set to Month, the valid values of the AutoRenewPeriod parameter are 1, 2, 3, 6, 12, 24, 36, 48, and 60.\n\nDefault value: 1.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "ClusterId",
      "description": "The ID of the cluster to which you want to add ECS instances. If the application and application instance group for the scale-out are specified, this parameter is ignored.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "GroupId",
      "description": "The ID of the instance group that you want to scale out. You can call the ListDeployGroup operation to query the group ID. For more information, see [ListDeployGroup](~~62077~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "InstanceChargePeriod",
      "description": "The duration of the subscription. The unit of the subscription duration is specified by the InstanceChargePeriodUnit parameter. This parameter takes effect only when the InstanceChargeType parameter is set to PrePaid.\n\n*   If the InstanceChargePeriodUnit parameter is set to Week, the valid values of the InstanceChargePeriod parameter are 1, 2, 3, and 4.\n*   If the InstanceChargePeriodUnit parameter is set to Month, the valid values of the InstanceChargePeriod parameter are 1, 2, 3, 4, 5, 6, 7, 8, 9, 12, 24, 36, 48, and 60.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "InstanceChargePeriodUnit",
      "description": "The unit of the subscription period. Valid values:\n\n*   Week: billed on a weekly basis.\n*   Month: billed on a monthly basis. This is the default value.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "InstanceChargeType",
      "description": "The billing method of the instance. Valid values:\n\n*   PrePaid: subscription.\n*   PostPaid: pay-as-you-go. This is the default value.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ScalingNum",
      "description": "The number of instances to be added for the scale-out.",
      "position": "Query",
      "type": "Integer",
      "required": true
    },
    {
      "name": "ScalingPolicy",
      "description": "The instance reclaim mode of the scaling group. Valid values:\n\n*   recycle: economical mode\n*   release: release mode\n\nFor more information about how to remove instances from a specified scaling group, see [RemoveInstances](~~25955~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TemplateId",
      "description": "The ID of the ECS instance launch template. You can call the DescribeLaunchTemplates operation to query the launch template ID. For more information, see [DescribeLaunchTemplates](~~73759~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TemplateInstanceId",
      "description": "The ID of the existing ECS instance used for the scale-out. If this parameter is specified, the specifications and configurations of the specified ECS instance are used as a template to purchase new instances.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TemplateVersion",
      "description": "The version of the ECS instance launch template. You can call the DescribeLaunchTemplateVersions operation to query the launch template version. For more information, see [DescribeLaunchTemplateVersions](~~73761~~).\n\n> If you set this parameter to `-1`, the default launch template version is used.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}