{
  "name": "UpdateK8sApplicationConfig",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "PUT",
  "pathPattern": "/pop/v5/k8s/acs/k8s_app_configuration",
  "parameters": [
    {
      "name": "AppId",
      "description": "The ID of the application. You can query the application ID by calling the ListApplication operation. For more information, see [ListApplication](~~423162~~).",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ClusterId",
      "description": "The ID of the cluster. You can query the cluster ID by calling the ListCluster operation. For more information, see [ListCluster](~~411844~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "CpuLimit",
      "description": "The maximum number of CPU cores allowed for each application instance when the application is running. The value 0 indicates that no limit is set on CPU cores.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "CpuRequest",
      "description": "The number of CPU cores requested for each application instance when the application is running. Unit: cores. We recommend that you set this parameter. The value 0 indicates that no limit is set on CPU cores.\n\n> You must set this parameter together with the CpuLimit parameter. Make sure that the value of this parameter does not exceed that of the CpuLimit parameter.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EphemeralStorageLimit",
      "description": "The maximum size of space required by ephemeral storage. Unit: GB. The value 0 indicates that no limit is set on the ephemeral storage space.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EphemeralStorageRequest",
      "description": "The minimum size of space required by ephemeral storage. Unit: GB. The value 0 indicates that no limit is set on the ephemeral storage space.\n\n> You must set this parameter together with the EphemeralStorageLimit parameter. Make sure that the value of this parameter does not exceed that of the EphemeralStorageLimit parameter.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "McpuLimit",
      "description": "The maximum number of CPU cores allowed. The value 0 indicates that no limit is set on CPU cores.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "McpuRequest",
      "description": "The minimum number of CPU cores required. Unit: cores. The value 0 indicates that no limit is set on CPU cores.\n\n> You must set this parameter together with the CpuLimit parameter. Make sure that the value of this parameter does not exceed that of the CpuLimit parameter.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "MemoryLimit",
      "description": "The maximum size of memory allowed for each application instance when the application is running. Unit: MB. The value 0 indicates that no limit is set on the memory size.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "MemoryRequest",
      "description": "The size of memory requested for each application instance when the application is running. Unit: MB. We recommend that you set this parameter. If you do not want to apply for a memory quota, set this parameter to 0.\n\n> You must set this parameter together with the MemoryLimit parameter. Make sure that the value of this parameter does not exceed that of the MemoryLimit parameter.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Timeout",
      "description": "The timeout period of the change process. Valid values: 1 to 1800. Default value: 600. Unit: seconds.",
      "position": "Query",
      "type": "Integer",
      "required": false
    }
  ]
}