{
  "version": "2022-01-01",
  "style": "rpc",
  "apis": {
    "AttachClusterToHub": {
      "title": "AttachClusterToHub",
      "summary": "You can call the AttachClusterToHub operation to associate an Container Service for Kubernetes (ACK) cluster with a master instance of ACK One.",
      "deprecated": false
    },
    "ChangeResourceGroup": {
      "title": "Change Resource Group",
      "summary": "",
      "deprecated": false
    },
    "CreateHubCluster": {
      "title": "CreateHubCluster",
      "summary": "Creates a master instance in Alibaba Cloud Distributed Cloud Container Platform (ACK One).",
      "deprecated": false
    },
    "DeleteHubCluster": {
      "title": "DeleteHubCluster",
      "summary": "Deletes a master cluster in Alibaba Cloud Distributed Cloud Container Platform (ACK One).",
      "deprecated": false
    },
    "DeletePolicyInstance": {
      "title": "DeletePolicyInstance",
      "summary": "Deletes a policy for associated clusters.",
      "deprecated": false
    },
    "DeleteUserPermission": {
      "title": "DeleteUserPermission",
      "summary": "Deletes the role-based access control (RBAC) permissions of a RAM user.",
      "deprecated": false
    },
    "DeployPolicyInstance": {
      "title": "DeployPolicyInstance",
      "summary": "Deploys a policy instance in the clusters that are associated with a master instance.",
      "deprecated": false
    },
    "DescribeHubClusterDetails": {
      "title": "DescribeHubClusterDetails",
      "summary": "Queries the details of a master instance in Alibaba Cloud Distributed Cloud Container Platform (ACK One).",
      "deprecated": false
    },
    "DescribeHubClusterKubeconfig": {
      "title": "DescribeHubClusterKubeconfig",
      "summary": "Queries the kubeconfig file of a Distributed Cloud Container Platform for Kubernetes (ACK One) cluster. In addition to the Container Service for Kubernetes (ACK) console, you can also use the Kubernetes CLI kubectl to manage clusters and applications. If you use kubectl to manage an ACK cluster, you must obtain the kubeconfig file of the cluster and use kubectl to connect to the cluster.",
      "deprecated": false
    },
    "DescribeHubClusterLogs": {
      "title": "DescribeHubClusterLogs",
      "summary": "Queries the logs of the Fleet instance of a multi-cluster fleet of Distributed Cloud Container Platform for Kubernetes (ACK One).",
      "deprecated": false
    },
    "DescribeHubClusters": {
      "title": "DescribeHubClusters",
      "summary": "Queries the Fleet instances in the Distributed Cloud Container Platform for Kubernetes (ACK One) cluster.",
      "deprecated": false
    },
    "DescribeManagedClusters": {
      "title": "Query the clusters that are associated with a master instance.",
      "summary": "You can call the DescribeManagedClusters operation to query the clusters that are associated with a master instance.",
      "deprecated": false
    },
    "DescribePolicies": {
      "title": "DescribePolicies",
      "summary": "Queries a list of policies.",
      "deprecated": false
    },
    "DescribePolicyDetails": {
      "title": "DescribePolicyDetails",
      "summary": "Queries detailed information about a policy.",
      "deprecated": false
    },
    "DescribePolicyGovernanceInCluster": {
      "title": "DescribePolicyGovernanceInCluster",
      "summary": "Queries detailed information about the policies used by the clusters that are associated with a master instance.",
      "deprecated": false
    },
    "DescribePolicyInstances": {
      "title": "DescribePolicyInstances",
      "summary": "Queries policy instances that are deployed in the clusters associated with a master instance.",
      "deprecated": false
    },
    "DescribePolicyInstancesStatus": {
      "title": "DescribePolicyInstancesStatus",
      "summary": "Queries detailed information about policy instances that are deployed in the clusters associated with a master instance.",
      "deprecated": false
    },
    "DescribeRegions": {
      "title": "DescribeRegions",
      "summary": "",
      "deprecated": false
    },
    "DescribeUserPermissions": {
      "title": "DescribeUserPermissions",
      "summary": "Query the permissions of a Resource Access Management (RAM) user.",
      "deprecated": false
    },
    "DetachClusterFromHub": {
      "title": "DetachClusterFromHub",
      "summary": "You can call the DetachClusterFromHub operation to disassociate clusters from a master instance.",
      "deprecated": false
    },
    "GrantUserPermission": {
      "title": "GrantUserPermission",
      "summary": "Grants role-based access control (RBAC) permissions to Resource Access Management (RAM) users or RAM roles. System policies can be attached to RAM users to grant only the operation permissions on Distributed Cloud Container Platform for Kubernetes (ACK One) cluster resources. The operation permissions include creating and viewing instances. If you want to perform operations on Kubernetes resources in a specific cluster by using a RAM user or assuming a RAM role, such as creating GitOps applications and Argo workflows, you must grant RBAC permissions to the RAM user or RAM role to perform operations on the specified ACK One cluster and namespace. This topic describes how to grant RBAC permissions to a RAM user or RAM role.",
      "deprecated": false
    },
    "UpdateHubClusterFeature": {
      "title": "UpdateHubClusterFeature",
      "summary": "Updates the configurations of a Container Service for Kubernetes (ACK) cluster that serves as a master instance.",
      "deprecated": false
    },
    "UpdateUserPermission": {
      "title": "UpdateUserPermission",
      "summary": "Updates the role-based access control (RBAC) permissions of a RAM user.",
      "deprecated": false
    }
  }
}