{
  "name": "CreateMountTarget",
  "deprecated": false,
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AccessGroupName",
      "description": "The name of the permission group.\n\nThis parameter is required if you create a mount target for a General-purpose NAS file system or an Extreme NAS file system.\n\nThe default permission group for virtual private clouds (VPCs) is named DEFAULT_VPC_GROUP_NAME.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DryRun",
      "description": "Specifies whether to perform a dry run to check for existing mount targets. This parameter is valid only for CPFS file systems.\n\nIf you set this parameter to true, the system checks whether the request parameters are valid and whether the requested resources are available. In this case, no mount target is created and no fee is incurred.\n\n*   true: performs a dry run but does not create a mount target. In the dry run, the system checks the request format, service limits, available CPFS resources, and whether the required parameters are specified. If the request fails the dry run, an error message is returned. If the request passes the dry run, the HTTP status code `200` is returned. No value is returned for the `MountTargetDomain` parameter.\n*   false (default): sends the request. If the request passes the dry run, a mount target is created.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "EnableIpv6",
      "description": "Specifies whether to create an IPv6 domain name for the mount target.\n\nValid values:\n\n*   true: An IPv6 domain name is created for the mount target.\n*   false (default): No IPv6 domain name is created for the mount target.\n\n> Only Extreme NAS file systems that reside in the Chinese mainland support IPv6. If you want to create an IPv6 domain name for the mount target, you must enable IPv6 for the file system.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "FileSystemId",
      "description": "The ID of the file system.\n\n*   Sample ID of a General-purpose NAS file system: 31a8e4\\*\\*\\*\\*.\n*   The IDs of Extreme NAS file systems must start with `extreme-`, for example, extreme-0015\\*\\*\\*\\*.\n*   The IDs of Cloud Parallel File Storage (CPFS) file systems must start with `cpfs-`, for example, cpfs-125487\\*\\*\\*\\*.\n\n> CPFS file systems are available only on the China site (aliyun.com).",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "NetworkType",
      "description": "The network type of the mount target. Valid value: **Vpc**.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "SecurityGroupId",
      "description": "The ID of the security group.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "VSwitchId",
      "description": "The ID of the vSwitch.\n\nThis parameter is valid and required if the mount target resides in a VPC. Example: If you set the NetworkType parameter to VPC, you must specify the VSwitchId parameter.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "VpcId",
      "description": "The ID of the VPC.\n\nThis parameter is valid and required if the mount target resides in a VPC. Example: If you set the NetworkType parameter to VPC, you must specify the VpcId parameter.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}