{
  "name": "CreateLifecyclePolicy",
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST|PUT",
  "pathPattern": "",
  "parameters": [
    {
      "name": "FileSystemId",
      "description": "The ID of the file system.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "LifecyclePolicyName",
      "description": "The name of the lifecycle policy. The name must be 3 to 64 characters in length and can contain letters, digits, underscores (\\_), and hyphens (-). The name must start with a letter.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "LifecycleRuleName",
      "description": "The management rule that is associated with the lifecycle policy.\n\nValid values:\n\n*   DEFAULT_ATIME\\_14: Files that are not accessed in the last 14 days are dumped to the IA storage medium.\n*   DEFAULT_ATIME\\_30: Files that are not accessed in the last 30 days are dumped to the IA storage medium.\n*   DEFAULT_ATIME\\_60: Files that are not accessed in the last 60 days are dumped to the IA storage medium.\n*   DEFAULT_ATIME\\_90: Files that are not accessed in the last 90 days are dumped to the IA storage medium.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Path",
      "description": "The absolute path of the directory that is associated with the lifecycle policy.\n\nIf you specify this parameter, you can associate the lifecycle policy with only one directory. The path must start with a forward slash (/) and must be a path that exists in the mount target.\n\n> We recommend that you specify the Paths.N parameter so that you can associate the lifecycle policy with multiple directories.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Paths",
      "description": "The absolute paths of the directories that are associated with the lifecycle policy.\n\nIf you specify this parameter, you can associate the lifecycle policy with multiple directories. Each path must start with a forward slash (/) and must be a path that exists in the mount target. Valid values of N: 1 to 10.",
      "position": "Query",
      "type": "RepeatList",
      "required": false
    },
    {
      "name": "StorageType",
      "description": "The storage type of the data that is dumped to the IA storage medium.\n\nDefault value: InfrequentAccess (IA).",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}