{
  "name": "CreateFileSystem",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Bandwidth",
      "description": "The maximum throughput of the file system.\n\nUnit: MB/s.\n\nSpecify a value based on the specifications on the buy page.\n\n[CPFS (Pay-as-you-go)](https://common-buy-intl.alibabacloud.com/?spm=5176.nas_overview.0.0.7ea01dbft0dTui\\&commodityCode=nas_cpfspost_public_intl#/buy)",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "Capacity",
      "description": "Specify the capacity of the file system. Unit: GiB. This parameter is required and valid when FileSystemType is set to extreme, cpfs, or cpfsse.\n\nSpecify a value based on the specifications on the following buy page:\n\n*   [Extreme NAS (Pay-as-you-go)](https://common-buy-intl.alibabacloud.com/?commodityCode=nas_extpost_public_intl#/buy)\n*   [CPFS (Pay-as-you-go)](https://common-buy-intl.alibabacloud.com/?spm=5176.nas_overview.0.0.7ea01dbft0dTui\\&commodityCode=nas_cpfspost_public_intl#/buy)",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "ChargeType",
      "description": "The billing method.\n\nValid values:\n\n*   PayAsYouGo (default): pay-as-you-go\n*   Subscription",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ClientToken",
      "description": "A client token that is used to ensure the idempotence of the request. You can use the client to generate the token, but you must make sure that the token is unique among different requests. ClientToken only supports ASCII characters and cannot exceed 64 characters. For more information, see [How to ensure idempotence](~~25693~~).\n\n> If you do not specify this parameter, the system automatically uses the request ID as the client token. The request ID may be different for each request.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Description",
      "description": "The description of the file system.\n\nLimits:\n\n*   Must be 2 to 128 characters in length.\n*   Must start with a letter but cannot start with `http://` or `https://`.\n*   Can contain digits, colons (:), underscores (\\_), and hyphens (-).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DryRun",
      "description": "Whether to precheck the creation request.\n\nThe precheck operation helps you check the validity of parameters and verify inventory. It does not actually create instances and does not incur fees.\n\nValid values:\n\n*   true: Checks the request without creating an instance. The system checks the required parameters, request syntax, service limits, and available NAS resources. If the request fails to pass the check, an error message is returned. If the request passes the check, the HTTP status code 200 is returned. No value is returned for the FileSystemId parameter.\n*   false (default): Sends the request. If the request passes the check, the instance is created.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "Duration",
      "description": "The subscription duration.\n\nThis parameter is valid and required if ChargeType is set to Subscription. Unit: months.\n\nIf you do not renew a subscription file system when the file system expires, the file system is automatically released.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "EncryptType",
      "description": "Specifies whether to encrypt data in the file system.\n\nYou can use the keys that are managed by Key Management Service (KMS) to encrypt data in a file system. When you read and write the encrypted data, the data is automatically decrypted.\n\nValid values:\n\n*   0 (default): The data in the file system is not encrypted.\n*   1: A NAS-managed key is used to encrypt the data in the file system. This value is valid if FileSystemType is set to standard or extreme.\n*   2: A KMS-managed key is used to encrypt the data in the file system. This value is valid if the FileSystemType parameter is set to standard or extreme.\n\n> \n\n*   Extreme NAS: All regions except China East 1 Finance support KMS-managed keys.\n\n*   General-purpose NAS: All regions support KMS-managed keys.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "FileSystemType",
      "description": "The type of the file system.\n\nValid values:\n\n*   standard: General-purpose NAS\n*   extreme: Extreme NAS\n*   cpfs: CPFS (locally redundant storage)\n*   cpfsse: CPFS SE (zone-redundant storage)",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "KmsKeyId",
      "description": "The ID of the KMS key.\n\nThis parameter is required if EncryptType is set to 2.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ProtocolType",
      "description": "Specify the protocol type.\n\n*   If FileSystemType is set to standard, set this parameter to NFS or SMB.\n*   If FileSystemType is set to extreme, set this parameter to NFS.\n*   If FileSystemType is set to cpfs, set this parameter to cpfs.\n*   If FileSystemType is set to cpfsse, set this parameter to cpfs.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "RedundancyType",
      "description": "Storage redundancy type. Only available for CPFS SE.\n\nValid values:\n\n*   ZRS",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RedundancyVSwitchIds",
      "description": "A list of IDs for the zone-redundant vSwitches. This parameter is required if RedundancyType is set to ZRS. You must enter three vSwitch IDs from three different zones.",
      "position": "Query",
      "type": "RepeatList",
      "required": false
    },
    {
      "name": "ResourceGroupId",
      "description": "The resource group ID.\n\nYou can log on to the [Resource Management console](https://resourcemanager.console.aliyun.com/resource-groups?) to view resource group IDs.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SnapshotId",
      "description": "The snapshot ID.\n\nThis parameter is available only for advanced Extreme NAS file systems.\n\n> You can create a file system from a snapshot. The version of the file system is the same as that of the source file system. For example, the source file system of the snapshot uses version 1. To create a file system of version 2, create File System A from the snapshot and create File System B of version 2. Then copy the data and migrate your business from File System A to File System B.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "StorageType",
      "description": "The storage type.\n\n*   If FileSystemType is set to standard, set this parameter to Performance, Capacity, or Premium.\n*   If FileSystemType is set to extreme, set this parameter to standard or advance.\n*   If FileSystemType is set to cpfs, set this parameter to advance\\_100 (100 MB/s/TiB Baseline) or advance\\_200 (200 MB/s/TiB Baseline).\n*   If FileSystemType is set to cpfsse, set this parameter to advance\\_100 (100 MB/s/TiB Baseline).",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Tag",
      "description": "An array of tags.\n\nYou can specify up to 20 tags. If you specify multiple tags, each tag key must be unique.",
      "position": "Query",
      "type": "RepeatList",
      "required": false,
      "sub_parameters": [
        {
          "name": "Key",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "Value",
          "position": "Query",
          "type": "String",
          "required": false
        }
      ]
    },
    {
      "name": "VSwitchId",
      "description": "The vSwitch ID.\n\n*   This parameter is required if FileSystemType is set to cpfs.\n*   If FileSystemType is not set to cpfs, this parameter is reserved and not required.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "VpcId",
      "description": "The VPC ID.\n\n*   This parameter is required if FileSystemType is set to cpfs or cpfsse.\n*   This parameter is reserved and not required if FileSystemType is set to standard or extreme.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ZoneId",
      "description": "The ID of the zone.\n\nEach region has multiple isolated locations known as zones. Each zone has its own independent power supply and network.\n\nThis parameter is not required if FileSystemType is set to standard. By default, a random zone is selected based on the protocol type and storage type.\n\nThis parameter is required if FileSystemType is set to extreme or cpfs.\n\n> \n\n*   An Elastic Compute Service (ECS) instance and a file system that reside in different zones of the same region can access each other.\n\n*   We recommend that you select the zone where the ECS instance resides. This prevents cross-zone latency between the file system and the ECS instance.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}