{
  "name": "CreateAccessRule",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AccessGroupName",
      "description": "The name of the permission group.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "FileSystemType",
      "description": "The type of the file system.\n\nValid values:\n\n*   standard (default): General-purpose NAS file system.\n*   extreme: Extreme NAS file system.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Ipv6SourceCidrIp",
      "description": "The IPv6 address or CIDR block of the authorized object.\n\nYou must set this parameter to an IPv6 address or CIDR block.\n\n> *   Only Extreme NAS file systems that reside in the Chinese mainland support IPv6. If you specify this parameter, you must enable IPv6 for the file system.\n>*   Only permission groups that reside in virtual private clouds (VPCs) support IPv6.\n>*   You cannot specify an IPv4 address and an IPv6 address at the same time.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Priority",
      "description": "The priority of the rule.\n\nThe rule with the highest priority takes effect if multiple rules are attached to the authorized object.\n\nValid values: 1 to 100. The value 1 indicates the highest priority.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "RWAccessType",
      "description": "The access permissions of the authorized object on the file system.\n\nValid values:\n\n*   RDWR (default): the read and write permissions.\n*   RDONLY: the read-only permissions.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SourceCidrIp",
      "description": "The IP address or CIDR block of the authorized object.\n\nYou must set this parameter to an IP address or CIDR block.\n\n> If the permission group resides in the classic network, you must set this parameter to an IP address.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "UserAccessType",
      "description": "The access permissions for different types of users in the authorized object.\n\nValid values:\n\n*   no_squash (default): grants root users the permissions to access the file system.\n*   root_squash: grants root users the least permissions as the nobody user.\n*   all_squash: grants all users the least permissions as the nobody user.\n\nThe nobody user has the least permissions in Linux and can access only the public content of the file system. This ensures the security of the file system.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}