{
  "name": "CreateDataFlow",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AutoRefreshInterval",
      "description": "The automatic update interval. CPFS checks whether data is updated in the directory at the interval specified by this parameter. If data is updated, CPFS starts an automatic update task. Unit: minutes.\n\nValid values: 10 to 525600. Default value: 10.\n\n>  This parameter takes effect only for CPFS file systems.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "AutoRefreshPolicy",
      "description": "The automatic update policy. The updated data in the source storage is imported into the CPFS file system based on the policy.\n\n*   None (default): Updated data in the source storage is not automatically imported into the CPFS file system. You can run a data flow task to import the updated data from the source storage.\n*   ImportChanged: Updated data in the source storage is automatically imported into the CPFS file system.\n\n>  This parameter takes effect only for CPFS file systems.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "AutoRefreshs",
      "description": "The automatic update configurations.\n\n>  This parameter takes effect only for CPFS file systems.",
      "position": "Query",
      "type": "RepeatList",
      "required": false,
      "sub_parameters": [
        {
          "name": "RefreshPath",
          "position": "Query",
          "type": "String",
          "required": false
        }
      ]
    },
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request. You can use the client to generate the token, but you must make sure that the token is unique among different requests.\n\nThe token can contain only ASCII characters and cannot exceed 64 characters in length. For more information, see [How do I ensure the idempotence?](~~25693~~)\n\n>  If you do not specify this parameter, the system automatically uses the request ID as the client token. The value of RequestId may be different for each API request.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Description",
      "description": "The description of the dataflow.\n\nLimits:\n\n*   The description must be 2 to 128 characters in length.\n*   The description must start with a letter but cannot start with `http://` or `https://`.\n*   The description can contain letters, digits, colons (:), underscores (\\_), and hyphens (-).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DryRun",
      "description": "Specifies whether to perform a dry run.\n\nDuring the dry run, the system checks whether the request parameters are valid and whether the requested resources are available. During the dry run, no file system is created and no fee is incurred.\n\nValid values:\n\n*   true: performs a dry run. The system checks the required parameters, request syntax, limits, and available NAS resources. If the request fails the dry run, an error message is returned. If the request passes the dry run, the HTTP status code 200 is returned. No value is returned for the FileSystemId parameter.\n*   false (default): performs a dry run and sends the request. If the request passes the dry run, a file system is created.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "FileSystemId",
      "description": "The ID of the file system.\n\n*   The IDs of CPFS file systems must start with `cpfs-`. Example: cpfs-125487\\*\\*\\*\\*.\n*   The IDs of CPFS for Lingjun file systems must start with `bmcpfs-`. Example: bmcpfs-0015\\*\\*\\*\\*.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "FileSystemPath",
      "description": "The directory in the CPFS for LINGJUN file system. Limits:\n\n*   The directory must start and end with a forward slash (/).\n*   The directory must be an existing directory in the CPFS for LINGJUN file system.\n*   The directory must be 1 to 1023 characters in length.\n*   The directory must be encoded in UTF-8.\n\n>  This parameter is required for CPFS for LINGJUN file systems.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "FsetId",
      "description": "The fileset ID.\n\n>  This parameter is required for CPFS file systems.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SourceSecurityType",
      "description": "The type of security mechanism for the source storage. This parameter must be specified if the source storage is accessed with a security mechanism. Valid values:\n\n*   None (default): The source storage can be accessed without a security mechanism.\n*   SSL: The source storage must be accessed with an SSL certificate.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SourceStorage",
      "description": "The access path of the source storage. Format: `<storage type>://[<account id>:]<path>`.\n\nParameters:\n\n*   storage type: Only OSS is supported.\n\n*   account id (optional): the UID of the account of the source storage. This parameter is required when you use OSS buckets across accounts.\n\n*   path: the name of the OSS bucket. Limits:\n\n    *   The name can contain only lowercase letters, digits, and hyphens (-). The name must start and end with a lowercase letter or digit.\n    *   The name can be up to 128 characters in length.\n    *   The name must be encoded in UTF-8.\n\n> *   The OSS bucket must be an existing bucket in the region.\n> *   Only CPFS for LINGJUN V2.6.0 and later support the account id parameter.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "SourceStoragePath",
      "description": "The access path in the bucket of the source storage. Limits:\n\n*   The path must start and end with a forward slash (/).\n*   The path is case-sensitive.\n*   The path must be 1 to 1023 characters in length.\n*   The path must be encoded in UTF-8.\n\n>  This parameter is required for CPFS for LINGJUN file systems.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Throughput",
      "description": "The maximum data flow throughput. Unit: MB/s. Valid values:\n\n*   600\n*   1200\n*   1500\n\n>  The data flow throughput must be less than the I/O throughput of the file system. This parameter is required for CPFS file systems.",
      "position": "Query",
      "type": "Long",
      "required": false
    }
  ]
}