{
  "name": "CreateDir",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "FileSystemId",
      "description": "The ID of the file system.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "OwnerGroupId",
      "description": "The ID of the owner group for the directory. Valid values: 0 to 4294967295.",
      "position": "Query",
      "type": "Integer",
      "required": true
    },
    {
      "name": "OwnerUserId",
      "description": "The owner ID for the directory. Valid values: 0 to 4294967295.",
      "position": "Query",
      "type": "Integer",
      "required": true
    },
    {
      "name": "Permission",
      "description": "The Portable Operating System Interface (POSIX) permissions applied to the root directory. The value is a valid octal number, such as 0755.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Recursion",
      "description": "Specifies whether to create a multi-level directory. Valid values:\n\n*   true (default): If no multi-level directory exists, directories are created level by level.\n*   false: Only the last level of directory is created. An error message is returned because the parent directory does not exist.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "RootDirectory",
      "description": "The directory name.\n\n*   The directory must start with a forward slash (/).\n*   The directory can contain digits and letters.\n*   The directory can contain underscores (\\_), hyphens (-), and periods (.).\n*   The directory cannot contain symbolic links, such as the current directory (.), the upper-level directory (..), and other symbolic links.\n\n> *   If the root directory does not exist, configure the information for directory creation. The system then automatically creates the specified root directory based on your settings.\n> *  If the root directory exists, you do not need to configure the information for directory creation. The configurations for directory creation are ignored even if you configure the information.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}