{
  "name": "ModifyFileset",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request. You can use the client to generate the token, but you must make sure that the token is unique among different requests.\n\nThe token can contain only ASCII characters and cannot exceed 64 characters in length. For more information, see [How do I ensure the idempotence?](~~25693~~)\n\n>  If you do not specify this parameter, the system automatically uses the request ID as the client token. The request ID may be different for each request.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DeletionProtection",
      "description": "Specifies whether to enable deletion protection to allow you to release the fileset by using the console or by calling the [DeleteFileset](~~2402263~~) operation. Valid values:\n\n*   true: enables release protection.\n*   false: disables release protection.\n\n> This parameter can protect filesets only against manual releases, but not against automatic releases.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "Description",
      "description": "The fileset description.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DryRun",
      "description": "Specifies whether to perform only a dry run, without performing the actual request.\n\nDuring the dry run, the system checks whether the request parameters are valid and whether the requested resources are available. During the dry run, no fileset is modified and no fees incurred.\n\nValid values:\n\n*   true: performs only a dry run. The system checks the required parameters, request syntax, service limits, and Apsara File Storage NAS (NAS) inventory data. If the request fails the dry run, an error message is returned. If the request passes the dry run, the HTTP status code 200 is returned.\n*   false (default): performs a dry run and sends the request. If the request passes the dry run, the specified fileset is modified.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "FileSystemId",
      "description": "The ID of the file system.\n\n*   The IDs of CPFS file systems must start with `cpfs-`. Example: cpfs-099394bd928c\\*\\*\\*\\*.\n*   The IDs of CPFS for LINGJUN file systems must start with `bmcpfs-`. Example: bmcpfs-290w65p03ok64ya\\*\\*\\*\\*.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "FsetId",
      "description": "The fileset ID.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}