{
  "name": "ModifyAutoSnapshotPolicy",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AutoSnapshotPolicyId",
      "description": "The ID of the automatic snapshot policy.\n\nYou can call the DescribeAutoSnapshotPolicies operation to view available automatic snapshot policies.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "AutoSnapshotPolicyName",
      "description": "The name of the automatic snapshot policy. If you do not specify this parameter, the policy name is not changed.\n\nLimits:\n\n*   The name must be 2 to 128 characters in length.\n*   The name must start with a letter.\n*   The name can contain digits, letters, colons (:), underscores (\\_), and hyphens (-). It cannot start with `http://` or `https://`.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RepeatWeekdays",
      "description": "The days of a week on which auto snapshots are created.\n\nCycle: week.\n\nValid values: 1 to 7. The value 1 indicates Monday. If you want to create multiple auto snapshots within a week, you can specify multiple days from Monday to Sunday and separate the days with commas (,). You can specify a maximum of seven days.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RetentionDays",
      "description": "The retention period of auto snapshots.\n\nUnit: days.\n\nValid values:\n\n*   \\-1 (default): Auto snapshots are permanently retained. After the number of auto snapshots exceeds the upper limit, the earliest auto snapshot is automatically deleted.\n*   1 to 65536: Auto snapshots are retained for the specified number of days. After the retention period of auto snapshots expires, the auto snapshots are automatically deleted.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "TimePoints",
      "description": "The points in time at which auto snapshots are created.\n\nUnit: hours.\n\nValid values: 0 to 23. The values from 0 to 23 indicate a total of 24 hours from 00:00 to 23:00. For example, the value 1 indicates 01:00. If you want to create multiple auto snapshots within a day, you can specify multiple points in time and separate the points in time with commas (,). You can specify a maximum of 24 points in time.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}