{
  "name": "ContinueCreateStack",
  "deprecated": false,
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "DryRun",
      "description": "Specifies whether only to validate the stack in the request. Valid values:\n\n*   true: only validates the stack.\n*   false (default): validates and continues to create the stack.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "Mode",
      "description": "The mode in which ROS continues to create the stack. Valid values:\n\n*   Recreate (default)\n\n    If you set this parameter to Recreate, ROS continues to create only the following types of resources:\n\n    *   Resources that fail to be created\n    *   Resources that you specify for RecreatingResources.N\n    *   Dependencies of the resources that you specify for RecreatingResources.N\n    *   Resources that you have not created\n\n> RecreatingResources.N, TemplateBody, TemplateURL, and Parameters take effect only when Mode is set to Recreate.\n\n*   Ignore\n\n    *   ROS ignores and discards resources that fail to be created and you have not created, and considers that the stack is successfully created.\n    *   The body of the template that you use to create the stack is changed.\n\n> This mode is available only for ROS stacks.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Parallelism",
      "description": "The maximum number of concurrent operations that can be performed on resources.\n\nBy default, this parameter is empty. You can set this parameter to an integer that is greater than or equal to 0.\n\n> - If you set this parameter to an integer that is greater than 0, the integer is used.\n> - If you set this parameter to 0, no limit is imposed on ROS stacks. However, the default value in Terraform is used for Terraform stacks. In most cases, the default value in Terraform is 10.\n> - If you leave this parameter empty, the value that you specified for this parameter in the previous request is used. If you left this parameter empty in the previous request, no limit is imposed on ROS stacks. However, the default value in Terraform is used for Terraform stacks. In most cases, the default value in Terraform is 10.\n> - If you set this parameter to a specific value, ROS associates the value with the stack. The value affects subsequent operations on the stack.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "Parameters",
      "description": "The template parameters that you want to use to override specific parameters.",
      "position": "Query",
      "type": "RepeatList",
      "required": false,
      "sub_parameters": [
        {
          "name": "ParameterKey",
          "position": "Query",
          "type": "String",
          "required": true
        },
        {
          "name": "ParameterValue",
          "position": "Query",
          "type": "String",
          "required": true
        }
      ]
    },
    {
      "name": "RamRoleName",
      "description": "The name of the RAM role. Resource Orchestration Service (ROS) assumes the RAM role to create the stack and uses the credentials of the role to call the APIs of Alibaba Cloud services.\\\nROS assumes the RAM role to perform operations on the stack. If you have permissions to perform operations on the stack but do not have permissions to use the RAM role, ROS still assumes the RAM role. You must make sure that the least privileges are granted to the RAM role.\\\nIf you do not specify this parameter, ROS assumes the existing role that is associated with the stack. If no roles are available, ROS uses a temporary credential that is generated from the credentials of your account.\\\nThe name of the RAM role can be up to 64 bytes in length.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RecreatingOptions",
      "description": "The options that ROS adopts when ROS continues to create the stack.",
      "position": "Query",
      "type": "RepeatList",
      "required": false
    },
    {
      "name": "RecreatingResources",
      "description": "The resources that ROS continues to create after the resources failed to be created. You can add new resources to the resources that ROS continues to create. ROS continues to create all dependencies of the new resources.\n\n> This parameter is available only for ROS stacks.",
      "position": "Query",
      "type": "RepeatList",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the stack. You can call the [DescribeRegions](~~131035~~) operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "StackId",
      "description": "The stack ID.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "TemplateBody",
      "description": "The structure that contains the template body. The template body must be 1 to 524,288 bytes in length.\\\nIf the length of the template body exceeds the upper limit, we recommend that you add parameters to the HTTP POST request body to prevent request failures caused by excessively long URLs.\n\nA ROS template is subject to the following limits:\n\n*   You can modify only the following sections in the template: Description, Metadata, Resources, and Outputs.\n\n*   You cannot add sections to or remove sections from the template.\n\n*   The Resources section is subject to the following limits:\n\n    *   You cannot delete the resources or change the template body for the resources that you do not want to continue to create.\n    *   You can delete the resources or change the template body for the resources that you want to continue to create.\n    *   You can add resources to this section.\n\n \n\n> - This parameter takes effect only when Mode is set to Recreate.\n> - You can specify only one of the following parameters: TemplateBody, TemplateURL, and TemplateId. If you do not specify the parameters, the existing template is used.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TemplateId",
      "description": "The template ID. This parameter applies to shared and private templates.\n\n> - This parameter takes effect when `Mode` is set to `Recreate`. When you specify TemplateId of a template, the template is subject to the limits that are described for `TemplateBody` in this topic.\n> - You can specify only one of the following parameters: `TemplateBody`, `TemplateURL`, and `TemplateId`. If you do not specify the parameters, the existing template is used.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TemplateURL",
      "description": "The URL of the file that contains the template body. The URL must point to a template that is located on an HTTP or HTTPS web server or in an Object Storage Service (OSS) bucket, such as oss://ros/template/demo or oss://ros/template/demo?RegionId=cn-hangzhou. The template body can be up to 524,288 bytes in length.\n\nIf you do not specify the region ID of the OSS bucket, the value of RegionId is used.\n\n> - This parameter takes effect only when Mode is set to Recreate. When you specify TemplateURL of a template, the template is subject to the limits that are described for TemplateBody in this topic.\n> - You can specify only one of the following parameters: TemplateBody, TemplateURL, and TemplateId. If you do not specify the parameters, the existing template is used.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TemplateVersion",
      "description": "The version of the template. This parameter takes effect only when TemplateId is specified.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}