{
  "name": "CreateStackGroup",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AdministrationRoleName",
      "description": "The name of the RAM role that you specify for the administrator account when you create a self-managed stack group. ROS assumes the administrator role to perform operations. If you do not specify this parameter, AliyunROSStackGroupAdministrationRole is used as the default value. ROS uses the administrator role to assume the execution role AliyunROSStackGroupExecutionRole to perform operations on the stacks in the stack group.\n\nThe name must be 1 to 64 characters in length and can contain letters, digits, and hyphens (-).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "AutoDeployment",
      "description": "The information about automatic deployment settings.\n\n> You must specify this parameter if PermissionModel is set to SERVICE_MANAGED.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Capabilities",
      "description": "The options for the stack group. You can specify up to one option.",
      "position": "Query",
      "type": "RepeatList",
      "required": false
    },
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request. You can use the client to generate the token, but you must make sure that the token is unique among different requests.\\\nThe token can contain letters, digits, underscores (\\_), and hyphens (-) and cannot exceed 64 characters in length.\\\nFor more information, see [How to ensure idempotence](~~134212~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Description",
      "description": "The description of the stack group.\\\nThe description must be 1 to 256 characters in length.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ExecutionRoleName",
      "description": "The name of the RAM role that you specify for the execution account when you create a self-managed stack group. The administrator role AliyunROSStackGroupAdministrationRole assumes the execution role to perform operations. If you do not specify this parameter, AliyunROSStackGroupExecutionRole is used as the default value. ROS assumes the execution role to perform operations on the stacks in the stack group.\n\nThe name must be 1 to 64 characters in length and can contain letters, digits, and hyphens (-).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Parameters",
      "description": "The parameters of the stack group.",
      "position": "Query",
      "type": "RepeatList",
      "required": false,
      "sub_parameters": [
        {
          "name": "ParameterKey",
          "position": "Query",
          "type": "String",
          "required": true
        },
        {
          "name": "ParameterValue",
          "position": "Query",
          "type": "String",
          "required": true
        }
      ]
    },
    {
      "name": "PermissionModel",
      "description": "The permission model of the stack group.\n\nValid values:\n\n*   SELF_MANAGED (default): the self-managed permission model. If you create a self-managed stack group, you must create RAM roles within the administrator and execution accounts and establish a trust relationship between the accounts. Then, you can deploy stacks within the execution account.\n*   SERVICE_MANAGED: the service-managed permission model. If you create a service-managed stack group, ROS creates service-linked roles for the administrator and execution accounts, and the administrator account uses its role to deploy stacks within the execution account.\n\n> If you want to use the service-managed permission model to deploy stacks, your account must be the management account or a delegated administrator account of your resource directory and the trusted access feature is enabled for the account. For more information, see [Manage a delegated administrator account](~~308253~~) and [Enable trusted access](~~298229~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the stack group. You can call the [DescribeRegions](~~131035~~) operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ResourceGroupId",
      "description": "The ID of the resource group. If you do not specify this parameter, the stack group is added to the default resource group.\\\nFor more information about resource groups, see [Resource groups](~~94475~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "StackArn",
      "description": "",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "StackGroupName",
      "description": "The name of the stack group. The name must be unique within a region.\\\nThe name can be up to 255 characters in length, and can contain digits, letters, hyphens (-), and underscores (\\_). It must start with a digit or a letter.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Tags",
      "description": "The tags of the stack group.",
      "position": "Query",
      "type": "RepeatList",
      "required": false,
      "sub_parameters": [
        {
          "name": "Key",
          "position": "Query",
          "type": "String",
          "required": true
        },
        {
          "name": "Value",
          "position": "Query",
          "type": "String",
          "required": false
        }
      ]
    },
    {
      "name": "TemplateBody",
      "description": "The template body. The template body must be 1 to 524,288 bytes in length. If the length of the template body exceeds the upper limit, we recommend that you add parameters to the HTTP POST request body to prevent request failures caused by excessively long URLs.\n\n> You must and can specify only one of the following parameters: TemplateBody, TemplateURL, and TemplateId.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "TemplateId",
      "description": "The ID of the template. This parameter applies to shared and private templates.\n\n> You must and can specify only one of the following parameters: TemplateBody, TemplateURL, and TemplateId.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TemplateURL",
      "description": "The URL of the file that contains the template body. The URL must point to a template that is located on an HTTP or HTTPS web server or in an Alibaba Cloud Object Storage Service (OSS) bucket. The template body must be 1 to 524,288 bytes in length. Examples: oss://ros/template/demo and oss://ros/template/demo?RegionId=cn-hangzhou. If you do not specify the region ID of the OSS bucket, the value of RegionId is used.\n\n> You must and can specify only one of the following parameters: TemplateBody, TemplateURL, and TemplateId.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TemplateVersion",
      "description": "The version of the template. If you do not specify this parameter, the latest version is used.\n\n> TemplateVersion takes effect only if you specify TemplateId.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}