{
  "name": "CreateStack",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request. You can use the client to generate the token, but you must make sure that the token is unique among different requests. The token can be up to 64 characters in length, and can contain letters, digits, hyphens (-), and underscores (\\_).\n\nFor more information, see [Ensure idempotence](~~134212~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "CreateOption",
      "description": "The creation option for the stack. Valid values:\n\n*   KeepStackOnCreationComplete (default): After the stack is created, the stack and its resources are retained. The quota for the maximum number of stacks that can be created in ROS is consumed.\n*   AbandonStackOnCreationComplete: After the stack is created, the stack is deleted, but its resources are retained. The quota for the maximum number of stacks that can be created in ROS is not consumed. If the stack fails to be created, the stack is retained.\n*   AbandonStackOnCreationRollbackComplete: When the resources of the stack are rolled back after the stack fails to be created, the stack is deleted. The quota for the maximum number of stacks that can be created in ROS is not consumed. In other rollback scenarios, the stack is retained.\n*   ManuallyPay: When you create the stack, you must manually pay for the subscription resources that are used. The following resource types support manual payment: `ALIYUN::ECS::InstanceGroup`, `ALIYUN::RDS::DBInstance`, `ALIYUN::SLB::LoadBalancer`, `ALIYUN::VPC::EIP`, and `ALIYUN::VPC::VpnGateway`.\n\n>  You can specify only one of CreateOption and CreateOptions.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "CreateOptions",
      "description": "The creation options for the stack.",
      "position": "Query",
      "type": "RepeatList",
      "required": false
    },
    {
      "name": "DeletionProtection",
      "description": "Specifies whether to enable deletion protection for the stack. Valid values:\n\n*   Enabled.\n*   Disabled (default). If deletion protection is disabled, you can delete the stack by using the ROS console or by calling the DeleteStack operation.\n\n> The value of DeletionProtection that you specify for the root stack applies to its nested stacks.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DisableRollback",
      "description": "Specifies whether to disable rollback for the resources when the stack fails to be created.\n\nValid values:\n\n*   true\n*   false (default)",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "NotificationURLs",
      "description": "The callback URLs that are used to receive stack events. Valid values:\n\n*   HTTP POST URL\n\nEach URL can be up to 1,024 bytes in length.\n\n*   eventbridge\n\nWhen the status of a stack changes, ROS sends notifications to the EventBridge service. You can view the event information in the [EventBridge](https://eventbridge.console.aliyun.com) console.\n\n> This feature is supported in the China (Hangzhou), China (Shanghai), China (Beijing), China (Hong Kong), and China (Zhangjiakou) regions.\n\nMaximum value of N: 5. When the status of a stack changes, ROS sends a notification to the specified URL. When rollback is enabled for the stack, notifications are sent if the stack is in the CREATE_ROLLBACK or ROLLBACK state, but are not sent if the stack is in the CREATE_FAILED, UPDATE_FAILED, or IN_PROGRESS state.\\\nROS sends notifications regardless of whether you specify the Outputs section. The following sample code provides an example on the content of a notification:\n\n    {\n       \"Outputs\": [\n           {\n               \"Description\": \"No description given\",\n               \"OutputKey\": \"InstanceId\",\n               \"OutputValue\": \"i-xxx\"\n           }\n       ],\n       \"StackId\": \"80bd6b6c-e888-4573-ae3b-93d29113****\",\n       \"StackName\": \"test-notification-url\",\n       \"Status\": \"CREATE_COMPLETE\"\n    }",
      "position": "Query",
      "type": "RepeatList",
      "required": false
    },
    {
      "name": "Parallelism",
      "description": "The maximum number of concurrent operations that can be performed on resources.\n\nBy default, this parameter is empty. You can set this parameter to an integer that is greater than or equal to 0.\n\n\n\n> -  If you set this parameter to an integer that is greater than 0, the integer is used. If you set this parameter to 0 or leave this parameter empty, no limit is imposed on ROS stacks. However, the default value in Terraform is used for Terraform stacks. In most cases, the default value in Terraform is 10.\n> -  If you set this parameter to a specific value, ROS associates the value with the stack. The value affects subsequent operations on the stack, such as an update operation.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "Parameters",
      "description": "The parameters that are defined in the template.",
      "position": "Query",
      "type": "RepeatList",
      "required": false,
      "sub_parameters": [
        {
          "name": "ParameterKey",
          "position": "Query",
          "type": "String",
          "required": true
        },
        {
          "name": "ParameterValue",
          "position": "Query",
          "type": "String",
          "required": true
        }
      ]
    },
    {
      "name": "RamRoleName",
      "description": "The name of the RAM role. ROS assumes the RAM role to create the stack and uses the credentials of the role to call the APIs of Alibaba Cloud services.\\\nROS assumes the RAM role to perform operations on the stack. If you have permissions to perform operations on the stack but do not have permissions to use the RAM role, ROS still assumes the RAM role. You must make sure that the least privileges are granted to the RAM role.\n\nIf you do not specify this parameter, ROS assumes the existing role that is associated with the stack. If no roles are available, ROS uses a temporary credential that is generated from the credentials of your account.\n\nThe RAM role name can be up to 64 characters in length.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the stack. You can call the [DescribeRegions](~~131035~~) operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ResourceGroupId",
      "description": "The ID of the resource group. If you leave this parameter empty, the stack is added to the default resource group.\n\nFor more information about resource groups, see the \"Resource group\" section of the [What is Resource Management?](~~94475~~) topic.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "StackName",
      "description": "The name of the stack.\\\nThe name can be up to 255 characters in length, and can contain digits, letters, hyphens (-), and underscores (\\_). It must start with a letter.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "StackPolicyBody",
      "description": "The structure that contains the stack policy body. The policy body must be 1 to 16,384 bytes in length.\n\n> You can specify only one of StackPolicyBody and StackPolicyURL.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "StackPolicyURL",
      "description": "The URL of the file that contains the stack policy. The URL must point to a policy that is located on an HTTP or HTTPS web server or in an Object Storage Service (OSS) bucket, such as oss://ros/stack-policy/demo or oss://ros/stack-policy/demo?RegionId=cn-hangzhou. The policy file can be up to 16,384 bytes in length. If you do not specify the region ID of the OSS bucket, the value of RegionId is used.\n\n> You can specify only one of StackPolicyBody and StackPolicyURL.\n\nThe URL can be up to 1,350 bytes in length.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Tags",
      "description": "The tags that you want to add to the stack.",
      "position": "Query",
      "type": "RepeatList",
      "required": false,
      "sub_parameters": [
        {
          "name": "Key",
          "position": "Query",
          "type": "String",
          "required": true
        },
        {
          "name": "Value",
          "position": "Query",
          "type": "String",
          "required": false
        }
      ]
    },
    {
      "name": "TemplateBody",
      "description": "The structure that contains the template body. The template body must be 1 to 524,288 bytes in length. If the length of the template body exceeds the upper limit, we recommend that you add parameters to the HTTP POST request body to prevent request failures caused by excessively long URLs.\n\n> You must and can specify only one of the following parameters: TemplateBody, TemplateURL, TemplateId, and TemplateScratchId.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "TemplateId",
      "description": "The template ID. This parameter applies to shared templates and private templates.\n\n> You must and can specify only one of the following parameters: TemplateBody, TemplateURL, TemplateId, and TemplateScratchId.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TemplateScratchId",
      "description": "The scenario ID.\n\nFor more information about how to query the scenario ID, see [ListTemplateScratches](~~363050~~).\n\n> You must and can specify only one of the following parameters: TemplateBody, TemplateURL, TemplateId, and TemplateScratchId.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TemplateScratchRegionId",
      "description": "The region ID of the scenario. The default value is the same as the value of RegionId.\n\nYou can call the [DescribeRegions](~~131035~~) operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TemplateURL",
      "description": "The URL of the file that contains the template body. The URL must point to a template that is located on an HTTP or HTTPS web server or in an OSS bucket, such as oss://ros/template/demo or oss://ros/template/demo?RegionId=cn-hangzhou. The template body can be up to 524,288 bytes in length. If you do not specify the region ID of the OSS bucket, the value of RegionId is used.\n\n> You must and can specify only one of the following parameters: TemplateBody, TemplateURL, TemplateId, and TemplateScratchId.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TemplateVersion",
      "description": "The version of the template. This parameter takes effect only when TemplateId is specified.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TimeoutInMinutes",
      "description": "The timeout period for creating the stack.\n\n*   Default value: 60.\n*   Unit: minutes.\n*   Valid values: 10 to 1440.",
      "position": "Query",
      "type": "Long",
      "required": false
    }
  ]
}