{
  "name": "CreateChangeSet",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ChangeSetName",
      "description": "The name of the change set.\\\nThe name can be up to 255 characters in length and can contain digits, letters, hyphens (-), and underscores (\\_). The name must start with a digit or a letter.\n\n> Make sure that the name is unique among all names of change sets that are associated with the specified stack.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ChangeSetType",
      "description": "The type of the change set. Valid values:\n\n*   CREATE: creates a change set for a new stack.\n*   UPDATE (default): creates a change set for an existing stack.\n*   IMPORT: creates a change set for a new stack or an existing stack to import resources that are not managed by ROS.\n\nIf you create a change set for a new stack, ROS generates a unique stack ID for the stack. The stack remains in the REVIEW_IN_PROGRESS state until you execute the change set.\\\nIf you want to create a change set for a new stack, do not set ChangeSetType to UPDATE. If you want to create a change set for an existing stack, do not set ChangeSetType to CREATE.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request. You can use the client to generate the value, but you must make sure that the value is unique among different requests.\\\nThe token can contain letters, digits, hyphens (-), and underscores (\\_) and cannot exceed 64 characters in length.\\\nFor more information, see [How to ensure idempotence](~~134212~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Description",
      "description": "The description of the change set. The description can be up to 1,024 bytes in length.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DisableRollback",
      "description": "Specifies whether to disable rollback when the stack fails to be created.\\\nValid values:\n\n*   true: disables rollback for the stack when the stack fails to be created.\n*   false (default): enables rollback for the stack when the stack fails to be created.\n\n> This parameter takes effect only if you set ChangeSetType to CREATE or IMPORT.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "NotificationURLs",
      "description": "The callback URLs that are used to receive stack events.",
      "position": "Query",
      "type": "RepeatList",
      "required": false
    },
    {
      "name": "Parallelism",
      "description": "The maximum number of concurrent operations that can be performed on resources. By default, this parameter is empty. You can set this parameter to an integer that is greater than or equal to 0. If you set this parameter to a specific value, ROS associates the value with the stack. The value can affect subsequent operations on the stack.\n\nThis parameter takes effect only if you set ChangeSetType to CREATE or UPDATE.\n\n*   Valid values for change sets of the CREATE type:\n\n    *   If you set this parameter to an integer that is greater than 0, the integer is used.\n    *   If you set this parameter to 0 or leave this parameter empty, no limit is imposed on ROS stacks. However, the default value in Terraform is used for Terraform stacks. In most cases, the default value in Terraform is 10.\n\n*   Valid values for change sets of the UPDATE type:\n\n    *   If you set this parameter to an integer that is greater than 0, the integer is used.\n    *   If you set this parameter to 0, no limit is imposed on ROS stacks. However, the default value in Terraform is used for Terraform stacks. In most cases, the default value in Terraform is 10.\n    *   If you leave this parameter empty, the value that you specified for this parameter in the previous request is used. If you left this parameter empty in the previous request, no limit is imposed on ROS stacks. However, the default value in Terraform is used for Terraform stacks. In most cases, the default value in Terraform is 10.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "Parameters",
      "description": "The parameters that are defined in the template.",
      "position": "Query",
      "type": "RepeatList",
      "required": false,
      "sub_parameters": [
        {
          "name": "ParameterKey",
          "position": "Query",
          "type": "String",
          "required": true
        },
        {
          "name": "ParameterValue",
          "position": "Query",
          "type": "String",
          "required": true
        }
      ]
    },
    {
      "name": "RamRoleName",
      "description": "The name of the Resource Access Management (RAM) role. Resource Orchestration Service (ROS) assumes the RAM role to create the stack and uses the credentials of the role to call the APIs of Alibaba Cloud services.\\\nROS assumes the role to perform operations on the stack. If you have permissions to perform operations on the stack but do not have permissions to use the RAM role, ROS still assumes the RAM role. You must make sure that the least privileges are granted to the RAM role.\\\nIf you do not specify this parameter, ROS uses the existing role that is associated with the stack. If no roles are available for ROS to assume, ROS uses a temporary credential that is generated from the credentials of your Alibaba Cloud account.\\\nThe name of the RAM role can be up to 64 bytes in length.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the change set. You can call the [DescribeRegions](~~131035~~) operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ReplacementOption",
      "description": "Specifies whether to enable replacement update if a resource property is changed and you cannot modify the new resource property. For a change, the physical ID of the resource remains unchanged. For a replacement update, the existing resource is deleted, a new resource is created, and the physical ID of the resource is changed. Valid values:\n\n*   Enabled\n*   Disabled (default)\n\n> Operations that you perform to modify the resource properties for an update take precedence over operations you perform to replace the resource properties for an update. This parameter takes effect only if you set ChangeSetType to UPDATE.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ResourcesToImport",
      "description": "The resources that you want to import into the stack.",
      "position": "Query",
      "type": "RepeatList",
      "required": false,
      "sub_parameters": [
        {
          "name": "LogicalResourceId",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "ResourceIdentifier",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "ResourceType",
          "position": "Query",
          "type": "String",
          "required": false
        }
      ]
    },
    {
      "name": "StackId",
      "description": "The ID of the stack for which you want to create a change set. ROS compares the stack information with the information that you submit, such as a modified template or a changed parameter value, to generate the change set.\n\n> This parameter takes effect only for change sets of the UPDATE or IMPORT.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "StackName",
      "description": "The name of the stack for which you want to create the change set.\\\nThe name can be up to 255 characters in length and can contain digits, letters, hyphens (-), and underscores (\\_). The name must start with a digit or a letter.\n\n> This parameter takes effect only if you set ChangeSetType to CREATE or IMPORT.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "StackPolicyBody",
      "description": "The structure of the stack policy body. The policy body must be 1 to 16,384 bytes in length. If you set ChangeSetType to CREATE, you can specify StackPolicyBody or StackPolicyURL. If you set ChangeSetType to UPDATE, you can specify only one of the following parameters:\n\n*   StackPolicyBody\n*   StackPolicyURL\n*   StackPolicyDuringUpdateBody\n*   StackPolicyDuringUpdateURL",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "StackPolicyDuringUpdateBody",
      "description": "The structure of the temporary overriding stack policy. The policy body must be 1 to 16,384 bytes in length.\\\nIf you need to update protected resources, specify a temporary overriding stack policy for the resources during the update. If you do not specify a temporary overriding stack policy, the existing stack policy that is associated with the stack is used.\\\nThis parameter takes effect only if you set ChangeSetType to UPDATE. You can specify only one of the following parameters:\n\n*   StackPolicyBody\n*   StackPolicyURL\n*   StackPolicyDuringUpdateBody\n*   StackPolicyDuringUpdateURL",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "StackPolicyDuringUpdateURL",
      "description": "The URL of the stack policy based on which the stack is updated. The URL must point to a policy that is located on an HTTP or HTTPS web server or in an OSS bucket, such as oss://ros/stack-policy/demo and oss://ros/stack-policy/demo?RegionId=cn-hangzhou. The policy file can be up to 16,384 bytes in length.\n\n> If you do not specify the region of the OSS bucket, the value of RegionId is used.\n\nThe URL can be up to 1,350 bytes in length.\\\nIf you need to update protected resources, specify a temporary overriding stack policy for the resources during the update. If you do not specify a stack policy, the existing policy that is associated with the stack is used. This parameter takes effect only if you set ChangeSetType to UPDATE. You can specify only one of the following parameters:\n\n*   StackPolicyBody\n*   StackPolicyURL\n*   StackPolicyDuringUpdateBody\n*   StackPolicyDuringUpdateURL",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "StackPolicyURL",
      "description": "The URL of the file that contains the stack policy. The URL must point to a policy that is located on an HTTP or HTTPS web server or in an Object Storage Service (OSS) bucket, such as oss://ros/stack-policy/demo and oss://ros/stack-policy/demo?RegionId=cn-hangzhou. The policy file can be up to 16,384 bytes in length.\n\n> If you do not specify the region of the OSS bucket, the value of RegionId is used.\n\nYou can specify only one of the following parameters: StackPolicyBody and StackPolicyURL.\\\nThe URL can be up to 1,350 bytes in length.\n\nIf you set ChangeSetType to CREATE, you can specify StackPolicyBody or StackPolicyURL. If you set ChangeSetType to UPDATE, you can specify only one of the following parameters:\n\n*   StackPolicyBody\n*   StackPolicyURL\n*   StackPolicyDuringUpdateBody\n*   StackPolicyDuringUpdateURL",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TemplateBody",
      "description": "The structure of the template body. The template body must be 1 to 524,288 bytes in length.\\\nIf the length of the template body is longer than required, we recommend that you add parameters to the HTTP POST request body to prevent request failures caused by excessive length of URLs.\n\nYou can specify only one of the following parameters: TemplateBody, TemplateURL, and TemplateId.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "TemplateId",
      "description": "The ID of the template. This parameter applies to shared and private templates.\n\nYou can specify only one of the following parameters: TemplateBody, TemplateURL, and TemplateId.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TemplateScratchId",
      "description": "The ID of the scenario template.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TemplateURL",
      "description": "The URL of the file that contains the template body. The URL must point to a template that is located on an HTTP or HTTPS web server or in an OSS bucket, such as oss://ros/template/demo and oss://ros/template/demo?RegionId=cn-hangzhou. The template body can be up to 524,288 bytes in length.\n\n> If you do not specify the region of the OSS bucket, the value of RegionId is used.\n\nYou can specify only one of the following parameters: TemplateBody, TemplateURL, and TemplateId.\n\nThe URL can be up to 1,024 bytes in length.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TemplateVersion",
      "description": "The version of the template.\n\n> This parameter takes effect only if you specify TemplateId.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TimeoutInMinutes",
      "description": "The amount of time that can elapse before the stack enters the CREATE_FAILED or UPDATE_FAILED state.\\\nIf you set ChangeSetType to CREATE, this parameter is required. If you set ChangeSetType to UPDATE, this parameter is optional.\n\n*   Unit: minutes.\n*   Valid values: 10 to 1440.\n*   Default value: 60.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "UsePreviousParameters",
      "description": "Specifies whether to use the values that were passed last time for the parameters that you do not specify in the current request. Valid values:\n\n*   true\n*   false (default)\n\n> This parameter takes effect only if you set ChangeSetType to UPDATE or IMPORT.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    }
  ]
}