{
  "name": "DeleteStack",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "DeleteOptions",
      "description": "The options for deleting the stack.",
      "position": "Query",
      "type": "RepeatList",
      "required": false
    },
    {
      "name": "Parallelism",
      "description": "The maximum number of concurrent operations that can be performed on resources.\n\nBy default, this parameter is empty. You can set this parameter to an integer that is greater than or equal to 0.\n\n\n\n> -  If you set this parameter to an integer that is greater than 0, the integer is used. If you set this parameter to 0 or leave this parameter empty, no limit is imposed on ROS stacks. However, the default value in Terraform is used for Terraform stacks. In most cases, the default value in Terraform is 10.\n> -  If you set this parameter to a specific value, ROS associates the value with the stack. The value affects subsequent operations on the stack, such as an update operation.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "RamRoleName",
      "description": "The name of the RAM role. Resource Orchestration Service (ROS) assumes the RAM role to create the stack and uses the credentials of the role to call the APIs of Alibaba Cloud services.\\\nROS assumes the role to perform operations on the stack. If you have permissions to perform operations on the stack but do not have permissions to use the RAM role, ROS still assumes the RAM role. You must make sure that the least privileges are granted to the RAM role.\\\nIf you leave this parameter empty when you call the DeleteStack operation, ROS cannot assume the existing RAM role that is associated with the stack. If you want ROS to assume a RAM role, you must specify this parameter. If no RAM roles are available, ROS uses a temporary credential that is generated from the credentials of your account.\\\nThe name of the RAM role can be up to 64 bytes in length.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the stack. You can call the [DescribeRegions](~~131035~~) operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "RetainAllResources",
      "description": "Specifies whether to retain all resources in the stack.\n\nValid values:\n\n*   true\n*   false (default)",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "RetainResources",
      "description": "The resources that you want to retain.",
      "position": "Query",
      "type": "RepeatList",
      "required": false
    },
    {
      "name": "StackId",
      "description": "The ID of the stack.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}