{
  "name": "DeleteStackInstances",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AccountIds",
      "description": "The IDs of the execution accounts within which you want to deploy stacks in self-managed mode. You can specify up to 20 execution account IDs.",
      "position": "Query",
      "type": "Json",
      "required": false
    },
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request. You can use the client to generate the token, but you must make sure that the token is unique among different requests.\\\nThe token can contain letters, digits, hyphens (-), and underscores (\\_), and cannot exceed 64 characters in length.\\\nFor more information, see [How to ensure idempotence](~~134212~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DeploymentTargets",
      "description": "The folders in which you want to deploy stacks in service-managed mode.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "OperationDescription",
      "description": "The description of the delete operation.\n\nThe description must be 1 to 256 characters in length.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "OperationPreferences",
      "description": "The preference settings of the delete operation.\n\nThe following parameters are available:\n\n-  {\"FailureToleranceCount\": N}\n\n    The number of accounts within which stack operation failures are allowed in each region. If the value of this parameter is exceeded in a region, ROS stops the operation in the region. If ROS stops the operation in one region, ROS stops the operation in other regions.\n\n    Valid values of N: 0 to 20.\n\n    If you do not specify FailureToleranceCount, 0 is used as the default value.\n\n-  {\"FailureTolerancePercentage\": N}\n\n    The percentage of the number of accounts within which stack operation failures are allowed to the total number of accounts in each region. If the value of this parameter is exceeded, ROS stops the operation in the region.\n\n    Valid values of N: 0 to 100. If the numeric value in the percentage is not an integer, ROS rounds the value down to the nearest integer.\n\n    If you do not specify FailureTolerancePercentage, 0 is used as the default value.\n\n-  {\"MaxConcurrentCount\": N}\n\n    The maximum number of accounts within which multiple stacks are deployed at the same time in each region.\n\n    Valid values of N: 1 to 20.\n\n    If you do not specify MaxConcurrentCount, 1 is used as the default value.\n\n-  {\"MaxConcurrentPercentage\": N}\n\n    The percentage of the maximum number of accounts within which stacks are deployed at the same time to the total number of accounts in each region.\n\n    Valid values of N: 1 to 100. If the numeric value in the percentage is not an integer, ROS rounds the number down to the nearest integer.\n\n    If you do not specify MaxConcurrentPercentage, 1 is used as the default value.\n\n-   {\"RegionConcurrencyType\": N}\n\n    The mode that you want to use to deploy stacks across regions. Valid values:\n    - SEQUENTIAL (default): deploys stacks in the specified regions one by one in sequence. This way, ROS deploys stacks in only one region at a time. \n\n     - PARALLEL: deploys stacks in all the specified regions in parallel. \n\nSeparate multiple parameters with commas (,).\n\n> - You can specify only one of the following parameters: MaxConcurrentCount and MaxConcurrentPercentage.\n> - You can specify only one of the following parameters: FailureToleranceCount and FailureTolerancePercentage.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the stack group. You can call the [DescribeRegions](~~131035~~) operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "RegionIds",
      "description": "The IDs of the regions where you want to delete the stacks. You can specify up to 20 region IDs.",
      "position": "Query",
      "type": "Json",
      "required": true
    },
    {
      "name": "RetainStacks",
      "description": "Specifies whether to delete the stacks.\n\nValid values:\n\n*   true: retains the stacks.\n*   false: deletes the stacks.",
      "position": "Query",
      "type": "Boolean",
      "required": true
    },
    {
      "name": "StackGroupName",
      "description": "The name of the stack group. The name must be unique within a region.\\\nThe name can be up to 255 characters in length and can contain digits, letters, hyphens (-), and underscores (\\_). It must start with a digit or a letter.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}