{
  "name": "DetectStackGroupDrift",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request. You can use the client to generate the value, but you must ensure that it is unique among different requests.\n\nThe value can be up to 64 characters in length and can contain letters, digits, hyphens (-), and underscores (\\_).\n\nFor more information, see [How to ensure idempotence](~~134212~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "OperationPreferences",
      "description": "The operation settings, in JSON format. The following fields are supported:\n\n*   FailureToleranceCount\n\nThe maximum number of stack group operation failures that can occur. In a stack group operation, if the total number of failures does not exceed the FailureToleranceCount value, the operation succeeds. Otherwise, the operation fails.\n\nIf FailureToleranceCount is not specified, the default value 0 is used. You can specify one of FailureToleranceCount or FailureTolerancePercentage parameters, but you cannot specify both of them.\n\nValid values: 0 to 20.\n\n*   FailureTolerancePercentage\n\nThe percentage of stack group operation failures that can occur. In a stack group operation, if the percentage of failures does not exceed the FailureTolerancePercentage value, the operation succeeds. Otherwise, the operation fails.\n\nYou can specify one of FailureToleranceCount or FailureTolerancePercentage parameters, but you cannot specify both of them.\n\nValid values: 0 to 100.\n\n*   MaxConcurrentCount\n\nThe maximum number of target accounts in which a drift detection operation can be performed at a time.\n\nYou can specify one of MaxConcurrentCount or MaxConcurrentPercentage parameters, but you cannot specify both of them.\n\nValid values: 1 to 20.\n\n*   MaxConcurrentPercentage\n\nThe maximum percentage of target accounts in which a drift detection operation can be performed at a time.\n\nYou can specify one of MaxConcurrentCount or MaxConcurrentPercentage parameters, but you cannot specify both of them.\n\nValid values: 1 to 100.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the stack group. You can call the [DescribeRegions](~~131035#doc-api-ROS-DescribeRegions~~ \"Queries the DescribeRegions list of a region.\") operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "StackGroupName",
      "description": "The name of the stack group. The name must be unique in a region.\n\nThe name can be up to 255 characters in length and can contain digits, letters, hyphens (-), and underscores (\\_). It must start with a digit or letter.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}