{
  "name": "GenerateTemplatePolicy",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "OperationTypes",
      "description": "The type of operation N for which you want to generate the policy information.\n\nValid values:\n\n*   CreateStack: creates a stack by calling the CreateStack operation.\n*   UpdateStack: updates a stack by calling the UpdateStack operation.\n*   DeleteStack: deletes a stack by calling the DeleteStack operation.\n*   DetectStackDrift: detects drifts on a stack by calling the DelectStackDrift operation.\n*   ListStackOperationRisks: lists the risks of a deletion operation on a stack by setting the OperationType parameter to DeleteStack in the ListStackOperationRisks operation.\n*   GetTemplateEstimateCost: queries the estimated prices of resources that you want to use in the template by calling the GetTemplateEstimateCost operation.\n*   GetTemplateParameterConstraints: queries the values of parameters in the template by calling the GetTemplateParameterConstraints operation.\n*   ImportResourcesToStack: imports resources to a stack by setting the ChangeSetType parameter to IMPORT in the CreateChangeSet operation.\n*   SignalResource: sends a signal to a stack.\n\n>  The default value is the combination of all valid values.",
      "position": "Query",
      "type": "RepeatList",
      "required": false
    },
    {
      "name": "TemplateBody",
      "description": "The structure that contains the template body. The template body must be 1 to 524,288 bytes in length.\n\nIf the length of the template body exceeds the upper limit, we recommend that you add parameters to the HTTP POST request body to prevent request failures caused by excessively long URLs.\n\nYou can specify only one of the following parameters: TemplateBody, TemplateURL, and TemplateId.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TemplateId",
      "description": "The ID of the template. This parameter applies to shared templates and private templates.\n\nYou can specify only one of the following parameters: TemplateBody, TemplateURL, and TemplateId.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TemplateURL",
      "description": "The URL of the file that contains the template body. The URL must point to a template that is located on an HTTP or HTTPS web server or in an Object Storage Service (OSS) bucket, such as oss://ros/template/demo or oss://ros/template/demo?RegionId=cn-hangzhou. The template body can be up to 524,288 bytes in length.\n\n>  If you do not specify the region ID of the OSS bucket, the value of the RegionId parameter is used.\n\nYou can specify only one of the following parameters: TemplateBody, TemplateURL, and TemplateId.\n\nThe URL can be up to 1,024 bytes in length.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TemplateVersion",
      "description": "The version of the template. This parameter takes effect only when the TemplateId parameter is specified.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}