{
  "name": "GetStack",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request. You can use the client to generate the token, but you must make sure that the token is unique among different requests.\\\nThe token can be up to 64 characters in length.\\\nFor more information, see [Ensure idempotence](~~134212~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "LogOption",
      "description": "The option for returning logs. Valid values:\n\n*   None: does not return logs.\n*   Stack (default): returns the logs of the stack.\n*   Resource: returns the logs of resources in the stack.\n*   All: returns all logs.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "OutputOption",
      "description": "Specifies whether to return Outputs. Valid values:\n\n*   Enabled (default)\n*   Disabled\n\n>  The Outputs parameter requires a long period of time to calculate. If you do not require Outputs of the stack, we recommend that you set OutputOption to Disabled to improve the response speed of the GetStack operation.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the stack. You can call the [DescribeRegions](~~131035~~) operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ShowResourceProgress",
      "description": "Specifies whether to return information about ResourceProgress. Valid values:\n\n*   Disabled (default): does not return information about ResourceProgress.\n*   PercentageOnly: returns StackOperationProgress and StackActionProgress of ResourceProgress.\n\n>  ROS and Terraform stacks are supported. Creation, resumed creation, update, deletion, import, and rollback operations on stacks are supported.\n\n*   EnabledIfCreateStack (not recommend): returns \\*Count and InProgressResourceDetails of ResourceProgress only during a stack creation operation.\n\n>  During a creation operation, a stack is in one of the following states: CREATE_IN_PROGRESS, CREATE_COMPLETE, CREATE_FAILED, CREATE_ROLLBACK_IN_PROGRESS, CREATE_ROLLBACK_COMPLETE, and CREATE_ROLLBACK_FAILED.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "StackId",
      "description": "The stack ID.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}