{
  "name": "GetStack",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request. You can use the client to generate the value, but you must ensure that it is unique among different requests.\n\nThe token can be up to 64 characters in length,\n\nFor more information, see [Ensure idempotence](~~134212~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "LogOption",
      "description": "The option for returning logs. Valid values:\n\n*   None: does not return logs.\n*   Stack: returns the logs of the stack. This is the default value.\n*   Resource: returns the logs of resources in the stack.\n*   All: returns the logs of all resources.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "OutputOption",
      "description": "Specifies whether to return the output parameters of the stack. Valid values:\n\n*   Enabled: returns the output parameters. This is the default value.\n\n*   Disabled: does not return the output parameters.\n\n> The system takes a long period of time to calculate output parameters. If you do not want to query the output parameters, we recommend that you set the OutputOption parameter to Disabled to improve the response speed of the GetStack operation.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The ID of the region in which the stack resides. You can call the [DescribeRegions](~~131035~~) operation to query the most recent list of Alibaba Cloud regions.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ShowResourceProgress",
      "description": "Specifies whether to return the ResourceProgress parameter. Valid values:\n\n*   Disabled: does not return the ResourceProgress parameter. This is the default value.\n\n*   EnabledIfCreateStack: returns the ResourceProgress parameter only if a stack is created.\n\n> A stack is in one of the following states when it is created: CREATE_IN_PROGRESS, CREATE_COMPLETE, CREATE_FAILED, CREATE_ROLLBACK_IN_PROGRESS, CREATE_ROLLBACK_COMPLETE, or CREATE_ROLLBACK_FAILED.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "StackId",
      "description": "The ID of the stack.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}