{
  "name": "ImportStacksToStackGroup",
  "deprecated": false,
  "protocol": "HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ClientToken",
      "description": "Ensures the idempotence of the request. This value is generated by the client and must be globally unique. \nIt cannot exceed 64 characters and can include letters, numbers, hyphens (-), and underscores (_). \nFor more information, see [How to Ensure Idempotence](~~134212~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "OperationDescription",
      "description": "Description of the operation.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "OperationPreferences",
      "description": "Operation settings for importing stacks into the stack group.\n\nIncludes the following parameters:\n\n- {\"FailureToleranceCount\": N}\n\n  Failure tolerance count. The number of accounts in which the stack can fail in each region. If this number is exceeded, the operation in that region will stop. If the operation in one region stops, it will not continue in other regions.\n  \n   The range of N: 0~20.\n\n   If FailureToleranceCount is not specified, the default value is 0.\n\n- {\"FailureTolerancePercentage\": N}\n\n   Failure tolerance percentage. The percentage of total accounts in which the stack can fail in each region. If this percentage is exceeded, the operation in that region will stop.\n\n   The range of N: 0~100. If the percentage is not an integer, ROS will round down.\n\n   If FailureTolerancePercentage is not specified, the default value is 0.\n\n- {\"MaxConcurrentCount\": N}\n\n   Maximum concurrent account count. The number of accounts in which the stack can be deployed simultaneously in each region.\n\n   The range of N: 1~20.\n\n   If MaxConcurrentCount is not specified, the default value is 1.\n\n- {\"MaxConcurrentPercentage\": N} Maximum concurrent account percentage.\n\n   The percentage of total accounts in which the stack can be deployed simultaneously in each region.\n\n   The range of N: 1~100. If the percentage is not an integer, ROS will round down.\n\n   If MaxConcurrentPercentage is not specified, the default value is 1.\n- {\"RegionConcurrencyType\": N}\nRegion-level concurrency type for deploying stack instances, values:\n     - SEQUENTIAL (default): Deploy sequentially in each specified region, only one region at a time.\n\n     - PARALLEL: Deploy in parallel across all specified regions.\n\nMultiple parameters are separated by commas (,).\n\n> - Do not specify both MaxConcurrentCount and MaxConcurrentPercentage.  \n>- Do not specify both FailureToleranceCount and FailureTolerancePercentage.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the stack group. You can call [DescribeRegions](~~131035~~) to view the latest list of Alibaba Cloud regions.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ResourceDirectoryFolderIds",
      "description": "A list of resource directory folder IDs for the stacks to be imported. A maximum of 10 folders can be added.",
      "position": "Query",
      "type": "Json",
      "required": false
    },
    {
      "name": "StackArns",
      "description": "A list of ARNs for the stacks to be imported into the stack group, in the format `acs:ros:${RegionId}:${AccountId}:stack/${StackId}`. A maximum of 10 stacks can be added.",
      "position": "Query",
      "type": "Json",
      "required": true
    },
    {
      "name": "StackGroupName",
      "description": "The name of the stack group. The name must be unique within a single region. It cannot exceed 255 characters and must start with a letter or number, and can include letters, numbers, hyphens (-), and underscores (_).",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}