{
  "name": "SetTemplatePermission",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "/V2/SetTemplatePermission",
  "parameters": [
    {
      "name": "AccountIds",
      "description": "The Alibaba Cloud accounts with or from which you want to share or unshare the template.\\\nValid values of N: 1, 2, 3, 4, and 5.\n\n> - This parameter cannot be set to the ID of the Alibaba Cloud account that owns the template, or the RAM users of this Alibaba Cloud account.\n> - When ShareOption is set to CancelSharing, you can unshare the template from all the specified Alibaba Cloud accounts by using an asterisk (\\*).",
      "position": "Query",
      "type": "RepeatList",
      "required": true
    },
    {
      "name": "ShareOption",
      "description": "The sharing option.\n\nValid values:\n\n*   ShareToAccounts: shares the template with other Alibaba Cloud accounts.\n*   CancelSharing: unshares the template.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "TemplateId",
      "description": "The ID of the template.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "TemplateVersion",
      "description": "The version of the shared template. This parameter takes effect only if you set ShareOption to ShareToAccounts and set VersionOption to Specified.\n\nValid values: v1 to v100.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "VersionOption",
      "description": "The version option for the shared template. This parameter takes effect only if you set ShareOption to ShareToAccounts.\n\nValid values:\n\n*   AllVersions (default): shares all versions of the template.\n*   Latest: shares only the latest version of template. When the version of the template is updated, ROS updates the shared version to the latest version.\n*   Current: shares only the current version of the template. When the version of the template is updated, ROS does not update the shared version.\n*   Specified: shares only the specified version of the template.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}