{
  "name": "ValidateTemplate",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request. You can use the client to generate the token, but you must make sure that the token is unique among different requests.\n\nThe token can be up to 64 characters in length, and can contain letters, digits, hyphens (-), and underscores (\\_).\n\nFor more information, see [Ensure idempotence](~~134212~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the template. You can call the [DescribeRegions](~~131035~~) operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TemplateBody",
      "description": "The structure that contains the template body. The template body must be 1 to 524,288 bytes in length.\\\nIf the length of the template body exceeds the upper limit, we recommend that you add parameters to the HTTP POST request body to prevent request failures caused by excessively long URLs.\\\nYou can specify the TemplateBody or TemplateURL parameter, but not both parameters.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "TemplateURL",
      "description": "The URL of the file that contains the template body. The URL must point to a template that is located on an HTTP web server or in an Object Storage Service (OSS) bucket, such as oss://ros/template/demo or oss://ros/template/demo?RegionId=cn-hangzhou. The template body can be up to 524,288 bytes in length.\n\n> If you do not specify the region ID of the OSS bucket, the value of RegionId is used.\n\nYou can specify one of TemplateBody and TemplateURL, but not both of them. The URL can be up to 1,024 bytes in length.\\",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "UpdateInfoOptions",
      "description": "The options that are used to control the generation of information about the stack update. You can specify up to two options.",
      "position": "Query",
      "type": "RepeatList",
      "required": false
    },
    {
      "name": "ValidationOption",
      "description": "Specifies whether to enable additional validation for the template. Valid values:\n\n*   None (default): does not enable additional validation.\n*   EnableTerraformValidation: runs the `terraform validate` command in the Terraform CLI to enable additional validation for a Terraform template.\n*   EnableFastTerraformValidation: runs a command that is similar to the `terraform validate` command in the Terraform CLI to enable additional validation for a Terraform template.\n\n> Compared with the EnableTerraformValidation method, the EnableFastTerraformValidation method validates a template at a faster speed but a lower integrity level.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}