{
  "name": "StartInstance",
  "deprecated": false,
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Config",
      "description": "The initial configurations of ApsaraMQ for Kafka. The value must be a valid JSON string.\n\nIf you do not specify this parameter, it is left empty.\n\nThe following parameters can be configured for **Config**:\n\n*   **enable.vpc_sasl_ssl**: specifies whether to enable VPC transmission encryption. Valid values:\n\n    *   **true**: enables VPC transmission encryption. If you enable VPC transmission encryption, you must also enable access control list (ACL).\n    *   **false**: disables VPC transmission encryption. By default, VPC transmission encryption is disabled.\n\n*   **enable.acl**: specifies whether to enable ACL. Valid values:\n\n    *   **true**: enables ACL.\n    *   **false**: disables ACL. By default, ACL is disabled.\n\n*   **kafka.log.retention.hours**: the maximum message retention period when the disk capacity is sufficient. Unit: hours. Valid values: 24 to 480. Default value: **72**. When the disk usage reaches 85%, the disk capacity is considered insufficient and the system deletes messages in the order in which they are stored to ensure service availability.\n\n*   **kafka.message.max.bytes**: the maximum size of messages that ApsaraMQ for Kafka can send and receive. Unit: bytes. Valid values: 1048576 to 10485760. Default value: **1048576**. Before you change the value of this parameter, make sure that the new value matches the corresponding configurations on the producers and consumers.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "CrossZone",
      "description": "Specifies whether cross-zone deployment is required. Valid values:\n\n*   true\n*   false\n\nDefault value: true.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "DeployModule",
      "description": "The deployment mode of the instance. Valid values:\n\n*   **vpc**: deploys the instance that allows access only from a VPC.\n*   **eip**: deploys the instance that allows access from the Internet and a VPC.\n\nThe deployment mode of the instance must match the type of the instance. If the instance allows access only from a VPC, set the value to **vpc**. If the instance allows access from the Internet and a VPC, set the value to **eip**.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "InstanceId",
      "description": "The ID of the instance.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "IsEipInner",
      "description": "Specifies whether the instance supports elastic IP addresses (EIPs). Valid values:\n\n*   **true**: supports EIPs and allows access from the Internet and a VPC.\n*   **false**: does not support EIPs and allows access only from a VPC.\n\nThe value of this parameter must match the type of the instance. For example, if the instance allows access only from a VPC, set this parameter to **false**.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "IsForceSelectedZones",
      "description": "Specifies whether to forcibly deploy the instance in the selected zones.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "IsSetUserAndPassword",
      "description": "Specifies whether to set a new username and password. Valid values:\n\n*   **true**: sets a new username and password.\n*   **false**: does not set a new username or password.\n\nThis parameter is available only if you deploy an instance that allows access from the Internet and a VPC.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "KMSKeyId",
      "description": "The ID of the key that is used for disk encryption in the region where the instance is deployed. You can obtain the ID of the key in the [Key Management Service (KMS) console](https://kms.console.aliyun.com/?spm=a2c4g.11186623.2.5.336745b8hfiU21) or create a key. For more information, see [Manage CMKs](~~181610~~).\n\nIf this parameter is configured, disk encryption is enabled for the instance. You cannot disable disk encryption after disk encryption is enabled. When you call this operation, the system checks whether the AliyunServiceRoleForAlikafkaInstanceEncryption service-linked role is created. If the role is not created, the system automatically creates the role. For more information, see [Service-linked roles](~~190460~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Name",
      "description": "The name of the instance.\n\n>  If you specify a value for this parameter, make sure that the specified value is unique in the region of the instance.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Notifier",
      "description": "The alert contact.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Password",
      "description": "The password that corresponds to the username.\n\nThis parameter is available only if you deploy an instance that allows access from the Internet and a VPC.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the instance.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "SecurityGroup",
      "description": "The security group of the instance.\n\nIf you do not specify this parameter, ApsaraMQ for Kafka automatically configures a security group for your instance. If you specify this parameter, you must create a security group in advance. For more information, see [Create a security group](~~25468~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SelectedZones",
      "description": "The two-dimensional arrays that consist of the candidate set for primary zones and the candidate set for secondary zones.\n\n*   If you set CrossZone to true and specify Zone H and Zone F as the candidate set for primary zones and Zone K as the candidate set for secondary zones, set this parameter to `[[\\\"zoneh\\\",\\\"zonef\\\"],[\\\"zonek\\\"]]`.\n\n    **\n\n    **Note** If you specify multiple zones as the primary or secondary zones, the system deploys the instance in one of the zones without prioritizing them. For example, if you set this parameter to `[[\\\"zoneh\\\",\\\"zonef\\\"],[\\\"zonek\\\"]]`, the primary zone in which the instance is deployed can be Zone H or Zone F, and the secondary zone is Zone K.\n\n*   If you set CrossZone to false and want to deploy the instance in Zone K, set this parameter to `[[\\\"zonek\\\"],[]]`. In this case, the value of this parameter must still be two-dimensional arrays, but the array that specifies the candidate for secondary zones is left empty.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ServiceVersion",
      "description": "The version of ApsaraMQ for Kafka. Valid values: 0.10.2 and 2.2.0.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "UserPhoneNum",
      "description": "The mobile phone number of the alert contact.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Username",
      "description": "The username that is used to access the instance.\n\nThis parameter is available only if you deploy an instance that allows access from the Internet and a VPC.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "VSwitchId",
      "description": "The ID of the vSwitch to which you want to connect the instance.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "VpcId",
      "description": "The ID of the virtual private cloud (VPC) in which you want to deploy the instance.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ZoneId",
      "description": "The ID of the zone in which you want to deploy the instance.\n\n*   The zone ID of the instance must be the same as that of the vSwitch.\n*   The value must be in the format of zoneX or Region ID-X. For example, you can set this parameter to zonea or cn-hangzhou-k.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}