{
  "name": "AddTemplate",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Audio",
      "description": "The audio stream settings. The value must be a JSON object. For more information, see [Audio](~~29253~~).\n\n> If you do not specify this parameter, output files do not contain audio streams. This parameter is required if you want to retain the audio streams.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Container",
      "description": "The container format. The value must be a JSON object that contains the Format parameter. If you do not specify this parameter, the transcoded media file is in MP4 format by default. This parameter is required if you want to use the transcoding template to generate media files in other formats. For more information, see [Container](~~29253~~).\n\n*   Default value: MP4.\n*   Video transcoding supports the following formats: FLV, MP4, HLS (M3U8 + TS), and MPEG-DASH (MPD + fMP4).\n\n> If the container format is FLV, the video codec cannot be set to H.265.\n\n*   Audio transcoding supports the following formats: MP3, MP4, OGG, FLAC, and M4A.\n*   Image transcoding supports the GIF and WebP formats.\n\n> \n\n*   If the container format is GIF, the video codec must be set to GIF.\n\n*   If the container format is WebP, the video codec must be set to WebP.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "MuxConfig",
      "description": "The segment settings. The value must be a JSON object. For more information, see [MuxConfig](~~29253~~). If you do not specify this parameter, media segment files are not generated. This parameter is required if you want to generate media segment files.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Name",
      "description": "The name of the transcoding template. The name can be up to 128 bytes in length.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "TransConfig",
      "description": "The general transcoding settings. The value must be a JSON object. For more information, see [TransConfig](~~29253~~). If you do not specify this parameter, the default settings are used. This parameter is required if the default settings cannot meet your business requirements.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Video",
      "description": "The video stream settings. The value must be a JSON object. For more information, see [Video](~~29253~~).\n\n> If you do not specify this parameter, output files do not contain video streams. This parameter is required if you want to retain the video streams.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}