{
  "name": "AddTemplate",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Audio",
      "description": "The general transcoding configuration. The value must be a JSON object. For more information, see the [Parameters nested under the TransConfig parameter](~~29253~~) section of this topic. If you do not set this parameter, the default settings of this parameter are used. If the default settings cannot meet your transcoding needs, set the parameters nested under the TransConfig parameter as required.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Container",
      "description": "The video stream configuration. The value must be a JSON object. For more information, see the [Parameters nested under the Video parameter](~~29253~~) section of this topic.\n\n> If you do not set this parameter, output files do not contain video streams. If you need to retain the video streams, this parameter is required.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "MuxConfig",
      "description": "The response parameters.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Name",
      "description": "The container configuration. The value must be a JSON object and contains the Format parameter. If you do not configure the container, the transcoded media file is in MP4 format by default. If you want to use the transcoding template to generate media files in other formats, this parameter is required. For more information, see the [Parameter nested under the Container parameter](~~29253~~) section of this topic.\n\n*   Default value of the Format parameter: mp4.\n*   Video formats include FLV, MP4, HLS (M3U8 + TS), and MPEG-DASH (MPD + fMP4)\n\n> If the container format is FLV, the video codec cannot be H.265.\n\n*   Audio formats include MP3, MP4, OGG, FLAC, and M4A\n*   Image formats include GIF and WebP.\n\n> If the container format is GIF, the video codec must be GIF. If the container format is WebP, the video codec must be WebP.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "TransConfig",
      "description": "The segment configuration. The value must be a JSON object. For more information, see the [Parameters nested under the MuxConfig parameter](~~29253~~) section of this topic. If you do not set this parameter, media segment files are not generated. If you want to generate media segment files, this parameter is required.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Video",
      "description": "The audio stream configuration. The value must be a JSON object. For more information, see the [Parameters nested under the Audio parameter](~~29253~~) section of this topic.\n\n> If you do not set this parameter, output files do not contain audio streams. If you need to retain the audio streams, this parameter is required.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}