{
  "name": "ImportFpShotJob",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "FpDBId",
      "description": "The ID of the text fingerprint library to which the text file is imported. You can specify only one job of importing text files to a text fingerprint library at a time. You can obtain the library ID from the response parameters of the [CreateFpShotDB](~~170149~~) operation.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "FpImportConfig",
      "description": "The job configurations. The value must be a JSON object. Example: `{\"SaveType\":\"onlysave\"}`. The `SaveType` field indicates the storage type. Valid values of the SaveType field:\n\n*   **save**: The fingerprints of the text file are saved to the text fingerprint library only if the text file is not duplicated with content in the text fingerprint library.\n*   **onlysave**: The fingerprints of the text file are saved to the text fingerprint library.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Input",
      "description": "The Object Storage Service (OSS) URL of the text file to be imported to the text fingerprint library. The value must be a JSON object. Example: {\"Bucket\":\"example-bucket\",\"Location\":\"oss-cn-shanghai\",\"Object\":\"example.flv\"}.\n\n> The OSS bucket must reside in the same region as your MPS service.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "PipelineId",
      "description": "The ID of the ApsaraVideo Media Processing (MPS) queue. To view the ID of the MPS queue, perform the following steps: Log on to the **MPS console**. In the left-side navigation pane, choose **Global Settings** > **Pipelines**. The MPS queue is associated with a specified Message Service (MNS) topic. You can submit jobs for different services to different MPS queues. If you do not specify this parameter, the job is submitted to the default MPS queue and no MNS topic is associated with the MPS queue.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "UserData",
      "description": "The user-defined data. The value can contain letters, digits, and special characters. The value can be up to 128 bytes in length.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}