{
  "name": "SubmitMediaCensorJob",
  "deprecated": false,
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Barrages",
      "description": "The live comments.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "CoverImages",
      "description": "The OSS URL of the image file that is used as the thumbnail. To view the OSS URL of the image file, you can log on to the **MPS console** and choose **Media Management** > **Media List** in the left-side navigation pane. You can specify up to five thumbnails in a JSON array.\n\n*   Bucket: the name of the OSS bucket that stores the input file.\n\n*   Location: the OSS region. The OSS region must be the same as the region in which your MPS service is activated.\n\n*   Object: the OSS object to be moderated.\n\n    **\n\n    **Note**The name of the object cannot start with a forward slash (/). Otherwise, the operation fails to be called.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Description",
      "description": "The description of the video. The value can be up to 128 bytes in size.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ExternalUrl",
      "description": "The URL of the video.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Input",
      "description": "The Object Storage Service (OSS) URL of the media file to be moderated. To view the OSS URL of the media file, you can log on to the **MPS console** and choose **Media Management** > **Media List** in the left-side navigation pane. To moderate an image file, use the `CoverImage` parameter to specify the OSS URL of the image file. The value is a JSON object. For more information, see the \"Input\" section of the [Parameter details](~~29253~~) topic.\n\n*   Bucket: the name of the OSS bucket that stores the input file.\n\n*   Location: the OSS region. The OSS region must be the same as the region in which your MPS service is activated.\n\n*   Object: the OSS object to be moderated.\n\n    **\n\n    **Note**The name of the object cannot start with a forward slash (/). Otherwise, the operation fails to be called.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "PipelineId",
      "description": "The ID of the MPS queue. This ID can be used to associate the job with a notification method. To view the ID of the MPS queue, you can log on to the **MPS console** and choose **Global Settings** > **Pipelines** in the left-side navigation pane. An empty string (\"\") indicates that the default MPS queue is used to run the job. By default, an MPS queue can process a maximum of 10 concurrent content moderation jobs. To increase the limit, [submit a ticket](https://workorder-intl.console.aliyun.com/?spm=5176.12246746.top-nav.ditem-sub.35da7bbcitpQnr#/ticket/createIndex).\n\n> MPS queues are automatically created by the system. For more information about how to query and update MPS queues, see the [UpdatePipeline](~~188374~~) topic.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Title",
      "description": "The title of the video. The value can be up to 64 bytes in size.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "UserData",
      "description": "The custom data. The value can be up to 128 bytes in size.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "VideoCensorConfig",
      "description": "The video moderation configurations and the OSS URLs of the output snapshots. To view the OSS URL of the media file, you can log on to the **MPS console** and choose **Media Management** > **Media List** in the left-side navigation pane.\n\nThe value is a JSON object.\n\n*   OutputFile:\n\n    *   Bucket: the name of the OSS bucket that stores the output file.\n    *   Location: the OSS region. The OSS region must be the same as the region in which your MPS service is activated.\n    *   Object: the OSS object to be generated. In the value, {Count} indicates the sequence number of the frame snapshot.\n\n*   StoreVideoTimeline: specifies whether to generate the `{jobId}.video_timeline` file. The file is stored in OSS. A value of true indicates that the file is generated. A value of false indicates that the file is not generated. If you do not specify this parameter, the file is not generated by default. For more information about the format of the file, see the \"VideoTimelines\" parameter in the [QueryMediaCensorJobDetail](~~91779~~) topic.\n\n*   SaveType: the output mode. A value of abnormal indicates that snapshots are generated only for illegal frames. A value of all indicates that snapshots are generated for all frames.\n\n*   Biztype: the moderation template. If you do not specify this parameter or set the value to common, the default template is used. You can submit a ticket to create a custom moderation template. Then, set this parameter to your user ID to use the custom moderation template.\n\n*   Scenes: the moderation scenarios. You can specify the moderation scenarios that you want to use. If you do not specify this parameter, the terrorism and porn moderation scenarios are used by default. Valid values:\n\n    *   porn: pornographic content detection\n    *   terrorism: terrorist content detection\n    *   ad: ad violation detection\n    *   live: undesirable scene detection\n    *   logo: special logo detection\n    *   audio: audio anti-spam\n\n> If the input file contains audio tracks and the audio moderation scenario is specified, the audio tracks are moderated. If the input file does not contain audio tracks, you do not need to specify the audio moderation scenario.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}