{
  "name": "SubmitJobs",
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Input",
      "description": "The input of the jobs. Specify the value in a JSON object. Referer is an optional parameter. If you need to set a referer whitelist in a transcoding job, you must set the Referer parameter in the input. For more information about the fields in the Input parameter, see [Input](~~29253~~).\n\n>  You can specify the `{ObjectPrefix}`, `{FileName}`, and `{ExtName}` variables in an OSS URL. MPS can dynamically replace the variables with the actual values. For example, if you specify `a/b/c/test.flv` as the object to be used as the input file and `{ObjectPrefix}{FileName}-cn.srt` as the object to be used as the external subtitle file, MPS replaces the variables to obtain the OSS URL a/b/c/test-cn.srt of the external subtitle file. The OSS URL that you specify must be URL-encoded. Therefore, you must specify the OSS URL of the external subtitle file as `%7bObjectPrefix%7d%7bFileName%7d-cn.srt`. Therefore, you must specify the OSS URL of the external subtitle file as `a/b/c/test-cn.srt`.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "OutputBucket",
      "description": "The name of the output bucket. To obtain the name of an output bucket, you can log on to the [MPS console](https://mps.console.aliyun.com/overview) and choose **Workflows** > **Media Buckets** in the left-side navigation pane.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "OutputLocation",
      "description": "The region in which the output bucket resides.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Outputs",
      "description": "The outputs of the jobs.\n\n*   Specify the value in a JSON array of Output objects. You can specify up to 30 Output objects.\n*   For more information about job outputs, see [Terms](~~29212~~).\n*   For more information about the fields in each Output object, see [Output](~~29253~~).\n\n>  If you need to merge images in a transcoding job, set the width and height of each image to be processed to even numbers. Otherwise, the job may fail.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "PipelineId",
      "description": "The ID of the MPS queue. To obtain the ID of an MPS queue, you can log on to the [MPS console](https://mps.console.aliyun.com/overview) and choose **Global Settings** > **Pipelines** in the left-side navigation pane.\n\n*   For more information about MPS queues, see [Terms](~~29212~~).\n*   If you want to use asynchronous notifications, make sure that an MNS topic is bound to the MPS queue to be used. For more information about how to bind an MNS topic to an MPS queue, see [Enable the feature for sending notifications on transcoding jobs](~~51469~~).",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}