{
  "name": "SubmitAnalysisJob",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AnalysisConfig",
      "description": "The job configurations. Set this parameter as required. For more information, see the \"AnalysisConfig\" section of the [Parameter details](~~29253~~) topic.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Input",
      "description": "The input information about the preset template analysis job to be submitted. The value must be a JSON object. You must log on to the Object Storage Service (OSS) console to grant the read permissions on the specified OSS bucket to MPS. For more information, see the \"Input\" section of the [Parameter details](~~29253~~) topic.\n\n> The OSS bucket must reside in the same region as your MPS service.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "PipelineId",
      "description": "The ID of the MPS queue to which the job is submitted. To view the ID of the MPS queue, log on to the **MPS console** and choose **Global Settings** > **Pipelines** in the left-side navigation pane. If you want to enable asynchronous notifications, make sure that the MPS queue is bound to a Message Service (MNS) topic.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Priority",
      "description": "The priority of the job in the MPS queue to which the job is submitted.\n\n*   Valid values: **1 to 10**. A value of 10 indicates the highest priority.\n*   Default value: **6**.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "UserData",
      "description": "The custom data. The custom data can contain letters, digits, and hyphens (-), and can be up to 1,024 bytes in length. The custom data cannot start with a special character.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}