{
  "name": "CreateNode",
  "deprecated": false,
  "protocol": "HTTPS",
  "method": "POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ContainerId",
      "description": "Specify this parameter if you want to create the node inside a container. This parameter represents the unique identifier of the container, which can be a workflow or a container node.\n\n>  If this parameter is specified, the path field defined in FlowSpec is ignored.\n\n>  Prior to SDK version 8.0.0, this field is of type Long. In SDK version 8.0.0 and later, it is of type String. This change does not affect the normal use of the SDK. The parameter is returned based on the type defined in the SDK. Compilation failures caused by the type change may occur only when you upgrade the SDK across version 8.0.0. In this case, you must manually update the data type.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "ProjectId",
      "description": "The DataWorks workspace ID. You can log on to the [DataWorks console](https://workbench.data.aliyun.com/console) and go to the Workspace page to query the ID.\n\nYou must configure this parameter to specify the DataWorks workspace to which the API operation is applied.",
      "position": "Body",
      "type": "Long",
      "required": true
    },
    {
      "name": "Scene",
      "description": "Specify this parameter if you want to create the node inside a container. This parameter represents the unique identifier of the container, which can be a workflow or a container node.\n\n>  If this parameter is specified, the path field defined in FlowSpec is ignored.\n\n>  Prior to SDK version 8.0.0, this field is of type Long. In SDK version 8.0.0 and later, it is of type String. This change does not affect the normal use of the SDK. The parameter is returned based on the type defined in the SDK. Compilation failures caused by the type change may occur only when you upgrade the SDK across version 8.0.0. In this case, you must manually update the data type.",
      "position": "Body",
      "type": "String",
      "required": true
    },
    {
      "name": "Spec",
      "description": "The FlowSpec information that describes the node. For more information, see [FlowSpec](https://github.com/aliyun/alibabacloud-dataworks-tool-dflow).\n\n>  How do I quickly obtain a FlowSpec template?\n\n*   Go to Data Studio, open a node, click Version on the right side, find the latest version, and then click Scheduling Settings to obtain the FlowSpec description of the current node. You can use the FlowSpec description in the version to quickly build a template that meets your requirements.\n\n>  How do I configure the node content?\n\n*   Enter the code for the node in the $.spec.nodes\\[].script.content field.\n\n>  How do I configure a batch synchronization node?\n\n*   Write the script by referring to Step 4 in [Configure an offline sync task in the code editor](https://help.aliyun.com/zh/dataworks/user-guide/configure-a-batch-synchronization-node-by-using-the-code-editor), and then enter the script content in the $.spec.nodes\\[\\*].script.content field. Alternatively, you can create a batch synchronization node in the console and view its version information to obtain the script content.",
      "position": "Body",
      "type": "String",
      "required": true
    }
  ]
}