{
  "name": "CreateUdfFile",
  "deprecated": false,
  "protocol": "HTTPS",
  "method": "POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ClassName",
      "description": "The class name where the function is defined, corresponding to the class name field in the Create Function form.",
      "position": "Body",
      "type": "String",
      "required": true
    },
    {
      "name": "CmdDescription",
      "description": "The command format for invoking the function, corresponding to the command format field in the Create Function form.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "CreateFolderIfNotExists",
      "description": "Specifies whether to automatically create the directory if the specified path (FileFolderPath) does not exist. Valid values:\n\n*   true: Automatically creates the directory if it does not exist.\n*   false: The call fails if the directory does not exist.",
      "position": "Body",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "Example",
      "description": "An example demonstrating how to call the function, corresponding to the example field in the Create Function form.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "FileFolderPath",
      "description": "The path to the folder containing the function file.",
      "position": "Body",
      "type": "String",
      "required": true
    },
    {
      "name": "FileName",
      "description": "The function name.",
      "position": "Body",
      "type": "String",
      "required": true
    },
    {
      "name": "FunctionType",
      "description": "The function category, corresponding to the function type field in the Create Function form. Valid values: MATH (mathematical functions), AGGREGATE (aggregate functions), STRING (string processing functions), DATE (date processing functions), ANALYTIC (window functions), and OTHER (other functions).",
      "position": "Body",
      "type": "String",
      "required": true
    },
    {
      "name": "ParameterDescription",
      "description": "The function parameter description, corresponding to the parameter description field in the Create Function form.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "ProjectId",
      "description": "The DataWorks workspace ID. To find this, click the wrench icon in the upper-right corner and navigate to the workspace management page.",
      "position": "Body",
      "type": "Long",
      "required": false
    },
    {
      "name": "ProjectIdentifier",
      "description": "The unique identifier of the DataWorks workspace, which is the identifier at the top of the Data Studio page where you switch workspaces.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "Resources",
      "description": "A comma-separated list of resource names referenced by the function, corresponding to the resource list field in the Create Function form.",
      "position": "Body",
      "type": "String",
      "required": true
    },
    {
      "name": "ReturnValue",
      "description": "The return value description, corresponding to the return value field in the Create Function form.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "UdfDescription",
      "description": "The function purpose description, corresponding to the description field in the Create Function form.",
      "position": "Body",
      "type": "String",
      "required": false
    }
  ]
}