{
  "name": "CreateDataSource",
  "deprecated": false,
  "protocol": "HTTPS",
  "method": "POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ConnectionProperties",
      "description": "The connection configurations of the data source, including the connection address, access identity, and environment information. The envType parameter specifies the environment in which the data source is used. Valid values of the envType parameter:\n\n*   Dev: development environment\n*   Prod: production environment\n\nThe parameters that you need to configure for the data source vary based on the mode in which the data source is added. For more information, see [Data source connection information (ConnectionProperties)](~~2852465~~).",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ConnectionPropertiesMode",
      "description": "The mode in which you want to add the data source. The mode varies based on the data source type. Valid values for MySQL data sources:\n\n*   InstanceMode: instance mode\n*   UrlMode: connection string mode",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Description",
      "description": "The description of the data source. The description cannot exceed 3,000 characters in length.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Name",
      "description": "The name of the data source. The name can be up to 255 characters in length and can contain letters, digits, and underscores (\\_). The name must start with a letter.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ProjectId",
      "description": "The ID of the DataWorks workspace. You can log on to the [DataWorks console](https://dataworks.console.aliyun.com/overview) and go to the workspace management page to obtain the ID.\n\nThis parameter is used to determine the DataWorks workspaces used for this API call.",
      "position": "Query",
      "type": "Long",
      "required": true
    },
    {
      "name": "Type",
      "description": "The type of the data source. More than 70 types of data sources are supported in DataWorks. For more information, see [Data source types](~~2852465~~).",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}