{
  "name": "ListResourceGroupMetricData",
  "deprecated": false,
  "protocol": "HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "BeginTime",
      "description": "The start time.\n\nSupported format: Unix timestamp in milliseconds (the number of milliseconds that have elapsed since January 1, 1970).\n\nThe interval between BeginTime and EndTime must be less than or equal to 31 days.\n\nDefault: The current time minus 2 hours, expressed as a millisecond Unix timestamp.",
      "position": "Body",
      "type": "Long",
      "required": false
    },
    {
      "name": "EndTime",
      "description": "The end time.\n\nSupported format: Unix timestamp in milliseconds (the number of milliseconds that have elapsed since January 1, 1970).\n\nThe interval between BeginTime and EndTime must be less than or equal to 31 days.\n\nDefault: The current time, expressed as a millisecond Unix timestamp.",
      "position": "Body",
      "type": "Long",
      "required": false
    },
    {
      "name": "Length",
      "description": "The number of records to display on each page for paginated queries.\n\n>  The maximum value of Length for a single request is 1440.",
      "position": "Body",
      "type": "Integer",
      "required": false
    },
    {
      "name": "MetricName",
      "description": "The metric name. Valid values:\n\n*   CUSpec: Maximum CU capacity of the resource group, in CUs.\n*   CUUsage: CU usage of the resource group, in CUs.\n*   CUUtilization: CU utilization of the resource group, in %.\n*   SlotSpec: Maximum number of concurrent slots for resource group scheduling, in slots.\n*   SlotUsage: Used concurrency for resource group scheduling, in slots.\n*   SchedulerCUMaxSpec: Maximum CU quota for data computing, in CUs.\n*   SchedulerCUUsage: CU usage for data computing, in CUs.\n*   SchedulerCUMinSpec: Minimum guaranteed CUs for data computing, in CUs.\n*   DataIntegrationCUMaxSpec: Maximum CU quota for Data Integration, in CUs.\n*   DataIntegrationCUUsage: CU usage for Data Integration, in CUs.\n*   DataIntegrationCUMinSpec: Minimum guaranteed CUs for Data Integration, in CUs.\n*   DataServiceCUMaxSpec: Maximum CU quota for DataService Studio, in CUs.\n*   DataServiceCUUsage: CU usage for DataService Studio, in CUs.\n*   DataServiceCUMinSpec: Minimum guaranteed CUs for DataService Studio, in CUs.\n*   ServerIdeCUMaxSpec: Maximum CU quota for personal development environment, in CUs.\n*   ServerIdeCUUsage: CU usage for personal development environment, in CUs.\n*   ServerIdeCUMinSpec: Minimum guaranteed CUs for personal development environment, in CUs.",
      "position": "Body",
      "type": "String",
      "required": true
    },
    {
      "name": "NextToken",
      "description": "The pagination cursor.\n\n>  If this parameter is not set, the first page of data is retrieved. If a value is returned for this parameter, it indicates that there is a next page. You can use the returned NextToken as a parameter to request the next page of data until it returns Null, which means all data has been retrieved.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "Period",
      "description": "The statistical period for monitoring data.\n\nValue: A multiple of 60.\n\nUnit: Seconds.\n\nDefault: 60.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "ResourceGroupId",
      "description": "The unique identifier for the general-purpose resource group.",
      "position": "Body",
      "type": "String",
      "required": true
    }
  ]
}