{
  "name": "ApplyToken",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Actions",
      "description": "The permission type of the token. Valid values:\n\n*   **R**: read-only. You can only subscribe to the specified topics.\n*   **W**: write-only. You can only send messages to the specified topics.\n*   **R,W**: read and write. You can send messages to and subscribe to the specified topics. Separate **R** and **W** with a comma (,).",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ExpireTime",
      "description": "The timestamp that indicates the point in time when the token expires. Unit: milliseconds. The minimum validity period of a token is 60 seconds, and the maximum validity period of a token is 30 days. If you specify a validity period of more than 30 days for a token, no errors are returned. However, the token is valid only for 30 days.\n\nFor example, you want to specify a validity period of 60 seconds for a token. If the current system timestamp is 1609434061000, you must set this parameter to **1609434121000**. The value is calculated by using the following formula: 1609434061000 + 60 x 1000 = 1609434121000.",
      "position": "Query",
      "type": "Long",
      "required": true
    },
    {
      "name": "InstanceId",
      "description": "The ID of the ApsaraMQ for MQTT instance. The ID must be consistent with the ID of the instance that the ApsaraMQ for MQTT client uses. You can obtain the instance ID on the **Instance Details** page that corresponds to the instance in the [ApsaraMQ for MQTT console](https://mqtt.console.aliyun.com/).",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Resources",
      "description": "The topics on the ApsaraMQ for MQTT instance. Separate multiple topics with commas (,). Each token can be used to access up to 100 topics. Multiple topics are sorted in alphabetic order. MQTT wildcards, including single-level wildcards represented by plus signs (+) and multi-level wildcards represented by number signs (#), can be used for the Resources parameter that you register to apply for a token.\n\nFor example, if you set the **Resources** parameter to Topic1/+ when you apply for a token, the ApsaraMQ for MQTT client can manage the topics in Topic1/xxx. If you set the **Resources** parameter to Topic1/# when you apply for a token, the ApsaraMQ for MQTT client can manage topics of any level in Topic1/xxx/xxx/xxx.\n\n>  ApsaraMQ for MQTT supports subtopics. You can specify subtopics in the code for messaging instead of configuring them in the ApsaraMQ for MQTT console. Forward slashes (/) are used to separate topics of different levels. For more information, see [Terms](~~42420~~).",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}