{
  "name": "CertificatePrivateKeySign",
  "deprecated": false,
  "protocol": "HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Algorithm",
      "description": "The signature algorithm. Valid values:\n\n*   RSA_PKCS1\\_SHA\\_256\n\n*   RSA_PSS_SHA\\_256\n\n*   ECDSA_SHA\\_256\n\n*   SM2DSA\n\n>* The SM2DSA signature algorithm is supported only in regions where managed hardware security modules (HSMs) are used in mainland China. For more information, see [Managed HSM overview](~~125803~~).",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "CertificateId",
      "description": "The ID of the certificate. The ID must be globally unique in Certificates Manager.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Message",
      "description": "The data to be signed.\n\nThe value is encoded in Base64. For example, if the hexadecimal data that you want to sign is `[0x31, 0x32, 0x33, 0x34]`, the Base64-encoded data is `MTIzNA==`.\n\nIf the MessageType parameter is set to RAW, the size of the data must be less than or equal to 4 KB.\n\nIf the size of the data is greater than 4 KB, you can set the MessageType parameter to DIGEST and set the Message parameter to the digest of the data. The digest is also called hash value. You can compute the digest of the data on an on-premises machine. Certificates Manager uses the digest that you compute in your own certificate application system. The message digest algorithm that you use must match the specified signature algorithm. Comply with the following mapping between signature algorithms and message digest algorithms:\n\n*   If the signature algorithm is RSA_PKCS1\\_SHA\\_256, RSA_PSS_SHA\\_256, or ECDSA_SHA\\_256, the message digest algorithm must be SHA-256.\n*   If the signature algorithm is SM2DSA, the message digest algorithm must be SM3.\n\n>  If the key type of the certificate is EC_SM2 and the MessageType parameter is set to DIGEST, the value of the Message parameter is `e` that is described in GB/T 32918.2-2016 6.1.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "MessageType",
      "description": "The type of the message. Valid values:\n\n*   RAW: the raw data. This is the default value.\n*   DIGEST: the message digest (hash value) of the raw data.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}