{
  "name": "CreateSecret",
  "deprecated": false,
  "protocol": "HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "DKMSInstanceId",
      "description": "The version number of the secret.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Description",
      "description": "Specifies whether to enable automatic rotation. Valid values:\n\n*   true: specifies to enable automatic rotation.\n*   false: specifies to disable automatic rotation. This is the default value.\n\n>  This parameter is valid if you set the SecretType parameter to Rds, RAMCredentials, or ECS.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EnableAutomaticRotation",
      "description": "Indicates whether automatic rotation is enabled. Valid values:\n\n*   Enabled: indicates that automatic rotation is enabled.\n*   Disabled: indicates that automatic rotation is disabled.\n*   Invalid: indicates that the status of automatic rotation is abnormal. In this case, Secrets Manager cannot automatically rotate the secret.\n\n>  This parameter is returned if you set the SecretType parameter to Rds, RAMCredentials, or ECS.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "EncryptionKeyId",
      "description": "The description of the secret.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ExtendedConfig",
      "description": "The ID of the request, which is used to locate and troubleshoot issues.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RotationInterval",
      "description": "The name of the secret.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SecretData",
      "description": "The tags of the secret.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "SecretDataType",
      "description": "The extended configuration of the secret. This parameter specifies the properties of the secret of the specific type. The description can be up to 1,024 characters in length.\n\n*   If you set the SecretType parameter to Generic, you do not need to configure this parameter.\n\n*   If you set the SecretType parameter to Rds, configure the following fields for the ExtendedConfig parameter:\n\n    *   SecretSubType: required. The subtype of the secret. Valid values:\n\n        *   SingleUser: Secrets Manager manages the ApsaraDB RDS secret in single-account mode. When the secret is rotated, the password of the specified account is reset to a new random password.\n        *   DoubleUsers: Secrets Manager manages the ApsaraDB RDS secret in dual-account mode. One account is referenced by the ACSCurrent version, and the other account is referenced by the ACSPrevious version. When the secret is rotated, the password of the account referenced by the ACSPrevious version is reset to a new random password. Then, Secrets Manager switches the referenced accounts between the ACSCurrent and ACSPrevious versions.\n\n    *   DBInstanceId: required. The ApsaraDB RDS instance to which the ApsaraDB RDS account belongs.\n\n    *   CustomData: optional. The custom data. The value is a collection of key-value pairs in the JSON format. Up to 10 key-value pairs can be specified. Separate multiple key-value pairs with commas (,). Example: `{\"Key1\": \"v1\", \"fds\":\"fdsf\"}`. The default value is a pair of empty braces (`{}`).\n\n*   If you set the SecretType parameter to RAMCredentials, configure the following fields for the ExtendedConfig parameter:\n\n    *   SecretSubType: required. The subtype of the secret. Set the value to RamUserAccessKey.\n    *   UserName: required. The name of the RAM user.\n    *   CustomData: optional. The custom data. The value is a collection of key-value pairs in the JSON format. Up to 10 key-value pairs can be specified. Separate multiple key-value pairs with commas (,). The default value is a pair of empty braces (`{}`).\n\n*   If you set the SecretType parameter to ECS, configure the following fields for the ExtendedConfig parameter:\n\n    *   SecretSubType: required. The subtype of the secret. Valid values:\n\n        *   Password: the password that is used to log on to the ECS instance.\n        *   SSHKey: the SSH public key and private key that are used to log on to the ECS instance.\n\n    *   RegionId: required. The ID of the region in which the ECS instance resides.\n\n    *   InstanceId: required. The ID of the ECS instance.\n\n    *   CustomData: optional. The custom data. The value is a collection of key-value pairs in the JSON format. Up to 10 key-value pairs can be specified. Separate multiple key-value pairs with commas (,). The default value is a pair of empty braces (`{}`).\n\n>  This parameter is required if you set the SecretType parameter to Rds, RAMCredentials, or ECS.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SecretName",
      "description": "The value of the secret that you want to create. Secrets Manager encrypts the secret value and stores the encrypted value in the initial version.\n\n*   If you set the SecretType parameter to Generic that indicates a generic secret, you can customize the secret value.\n\n*   If you set the SecretType parameter to Rds that indicates a managed ApsaraDB RDS secret, the secret value must be in the format of `{\"Accounts\":[{\"AccountName\":\"\",\"AccountPassword\":\"\"}]}`. In the preceding format, `AccountName` indicates the username of the account that is used to connect to your ApsaraDB RDS instance, and `AccountPassword` specifies the password of the account.\n\n*   If you set the SecretType parameter to RAMCredentials that indicates a managed RAM secret, the secret value must be in the format of `{\"AccessKeys\":[{\"AccessKeyId\":\"\",\"AccessKeySecret\":\"\",}]}`. In the preceding format, `AccessKeyId` indicates the AccessKey ID of the RAM user and `AccessKeySecret` specifies the AccessKey secret of the RAM user. You must specify all the AccessKey pairs of the RAM user.\n\n*   If you set the SecretType parameter to ECS that indicates a managed ECS secret, the secret value must be in one of the following formats:\n\n    *   `{\"UserName\":\"\",\"Password\": \"\"}`: In the format, `UserName` specifies the username that is used to log on to the ECS instance, and `Password` specifies the password that is used to log on to the ECS instance.\n    *   `{\"UserName\":\"\",\"PublicKey\": \"\", \"PrivateKey\": \"\"}`: In the format, `PublicKey` indicates the SSH public key that is used to log on to the ECS instance, and `PrivateKey` specifies the SSH private key that is used to log on to the ECS instance.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "SecretType",
      "description": "The ID of the dedicated KMS instance.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Tags",
      "description": "The interval for automatic rotation. Valid values: 6 hours to 8,760 hours (365 days).\n\nThe value is in the `integer[unit]` format.\n\nThe unit can be d (day), h (hour), m (minute), or s (second). For example, both 7d and 604800s indicate a seven-day interval.\n\n>  This parameter is required if you set the EnableAutomaticRotation parameter to true. This parameter is ignored if you set the EnableAutomaticRotation parameter to false or if the EnableAutomaticRotation parameter is not configured.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "VersionId",
      "description": "The type of the secret value. Valid values:\n\n*   text\n*   binary\n\n>  If you set the SecretType parameter to Rds, RAMCredentials, or ECS, the SecretDataType parameter must be set to text.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}