{
  "name": "CreateCertificate",
  "deprecated": false,
  "security": [
    "AK"
  ],
  "protocol": "HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ExportablePrivateKey",
      "description": "Specifies whether the private key of the certificate can be exported for use. Valid values:\n\n*   true: The private key of the certificate can be exported for use. This is the default value.\n*   false: The private key of the certificate cannot be exported for use. We recommend that you set this parameter to false to protect keys with a higher security level.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "KeySpec",
      "description": "The type of the key. Valid values:\n\n*   RSA\\_2048\n*   EC_P256\n*   EC_SM2",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Subject",
      "description": "The certificate subject, which is the owner of the certificate.\n\nSpecify the value in the distinguished name (DN) format, as defined in [RFC 2253](https://tools.ietf.org/html/rfc2253?spm=a2c4g.11186623.2.13.265f1a1cGFCn3Q). A DN is a sequence of relative distinguished names (RDNs).\n\nRDNs are key-value pairs in the format of `attribute1=value1,attribute2=value2`. Separate multiple RDNs with commas (,).\n\nThe Subject parameter consists of the following fields:\n\n*   CN: required. The name of the certificate subject.\n*   C: required. The two-character country or region code in the [ISO 3166-1](https://www.iso.org/obp/ui/#search/code/) standard. For example, CN indicates China.\n*   O: required. The legal name of the enterprise, company, organization, or institution.\n*   OU: required. The name of the department.\n*   ST: optional. The name of the province, municipality, autonomous region, or special administrative region.\n*   L: optional. The name of the city.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "SubjectAlternativeNames",
      "description": "The subject alternative names.\n\nA domain name list is supported. A maximum of 10 domain names are supported.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}