{
  "name": "ListKeys",
  "deprecated": false,
  "protocol": "HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Filters",
      "description": "The CMK filter. The filter consists of one or more key-value pairs. You can specify a maximum of 10 key-value pairs.\n\n*   Key\n\n    *   Description: the property that you want to filter.\n\n    *   Type: string.\n\n    *   Valid values:\n\n        *   KeyState: the status of the CMK.\n        *   KeySpec: the type of the CMK.\n        *   KeyUsage: the usage of the CMK.\n        *   ProtectionLevel: the protection level.\n        *   CreatorType: the type of the creator.\n\n*   Values\n\n    *   Description: the value to be included after filtering.\n\n    *   Format: string array.\n\n    *   Length: 0 to 10.\n\n    *   Valid values:\n\n        *   When Key is set to KeyState, the value can be Enabled, Disabled, PendingDeletion, or PendingImport.\n\n        *   When Key is set to KeySpec, the value can be Aliyun_AES\\_256, Aliyun_SM4, RSA\\_2048, EC_P256, EC_P256K, or EC_SM2.\n\n            Note: You can create CMKs of the EC_SM2 or Aliyun_SM4 type only in regions where State Cryptography Administration (SCA)-certified managed HSMs reside. For more information about the regions, see [Supported regions](~~125803~~). If your region does not support EC_SM2 or Aliyun_SM4, the two values are ignored if they are specified.\n\n        *   When Key is set to KeyUsage, the value can be ENCRYPT/DECRYPT or SIGN/VERIFY. ENCRYPT/DECRYPT indicates that the CMK is used to encrypt and decrypt data. SIGN/VERIFY indicates that the CMK is used to generate and verify digital signatures.\n\n        *   When Key is set to ProtectionLevel, the value can be SOFTWARE (software) or HSM (hardware).\n\n            You can set ProtectionLevel to HSM in only specific regions. For more information about the regions, see [Supported regions](~~125803~~). If your region does not support the value HSM, the value is ignored if the value is specified.\n\n        *   If Key is set to CreatorType, the value can be User or Service. User indicates that CMKs created by the current account are queried. Service indicates that CMKs automatically created by other cloud services authorized by the current account are queried.\n\nThe logical relationship between different keys is AND, and the logical relationship between multiple items in the same key is OR. Example:\n\n`[ {\"Key\":\"KeyState\", \"Values\":[\"Enabled\",\"Disabled\"]}, {\"Key\":\"KeyState\", \"Values\":[\"PendingDeletion\"]}, {\"Key\":\"KeySpec\", \"Values\":[\"Aliyun_AES_256\"]}]`. In this example, the semantics are:`(KeyState=Enabled OR KeyState=Disabled OR KeyState=PendingDeletion) AND (KeySpec=Aliyun_AES_ 256)`.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "PageNumber",
      "description": "The number of the page to return.\n\nPages start from page 1.\n\nDefault value: 1.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "PageSize",
      "description": "The number of entries to return on each page.\n\nValid values: 1 to 100.\n\nDefault value: 10",
      "position": "Query",
      "type": "Integer",
      "required": false
    }
  ]
}