{
  "name": "AssumeRoleWithOIDC",
  "deprecated": false,
  "protocol": "HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "DurationSeconds",
      "description": "The validity period of the STS token. Unit: seconds.\n\nDefault value: 3600. Minimum value: 900. Maximum value: the value of the `MaxSessionDuration` parameter.\n\nFor more information about how to specify `MaxSessionDuration`, see [CreateRole](~~28710~~) or [UpdateRole](~~28712~~).",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "OIDCProviderArn",
      "description": "The Alibaba Cloud Resource Name (ARN) of the OIDC IdP.\n\nYou can view the ARN in the RAM console or by calling operations.\n\n*   For more information about how to view the ARN in the RAM console, see [View the information about an OIDC IdP](~~327123~~).\n*   For more information about how to view the ARN by calling operations, see [GetOIDCProvider](~~327126~~) or [ListOIDCProviders](~~327127~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "OIDCToken",
      "description": "The OIDC token that is issued by the external IdP.\n\nThe OIDC token must be 4 to 20,000 characters in length.\n\n> You must enter the original OIDC token. You do not need to enter the Base64-encoded OIDC token.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Policy",
      "description": "The policy that specifies the permissions of the returned STS token. You can use this parameter to grant the STS token fewer permissions than the permissions granted to the RAM role.\n\n*   If you specify this parameter, the permissions of the returned STS token are the permissions that are included in the value of this parameter and owned by the RAM role.\n*   If you do not specify this parameter, the returned STS token has all the permissions of the RAM role.\n\nThe value must be 1 to 2,048 characters in length.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RoleArn",
      "description": "The ARN of the RAM role.\n\nYou can view the ARN in the RAM console or by calling operations.\n\n*   For more information about how to view the ARN in the RAM console, see [How do I view the ARN of the RAM role?](~~39744~~)\n*   For more information about how to view the ARN by calling operations, see [ListRoles](~~28713~~) or [GetRole](~~28711~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RoleSessionName",
      "description": "The custom name of the role session.\n\nSet this parameter based on your business requirements. In most cases, this parameter is set to the identity of the user who calls the operation, for example, the username. In ActionTrail logs, you can distinguish the users who assume the same RAM role to perform operations based on the value of the RoleSessionName parameter. This way, you can perform user-specific auditing.\n\nThe value can contain letters, digits, periods (.), at signs (@), hyphens (-), and underscores (\\_).\n\nThe value must be 2 to 64 characters in length.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}