{
  "name": "CreateDBClusterEndpoint",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AutoAddNewNodes",
      "description": "Specifies whether to enable automatic association of newly added nodes with the cluster endpoint. Valid values:\n\n*   **Enable**\n*   **Disable** (default)",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request. You can use the client to generate the value, but you must make sure that it is unique among different requests. The token can contain only ASCII characters and cannot exceed 64 characters in length. The token is case-sensitive.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DBClusterId",
      "description": "The ID of cluster.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "DBEndpointDescription",
      "description": "The name of the custom cluster endpoint.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EndpointConfig",
      "description": "The advanced configurations of the cluster endpoint. You must specify the configurations in the JSON format. You can specify the configurations of the following attributes: consistency level, transaction splitting, connection pool, and offload reads from the primary node.\n\n*   Specify the consistency level in the format of `{\"ConsistLevel\":\"Consistency level\"}`. Default value: 1. Valid values:\n\n    *   **0**: eventual consistency.\n    *   **1**: session consistency.\n    *   **2**: global consistency.\n\n*   Specify the transaction splitting feature in the format of `{\"DistributedTransaction\":\"Transaction splitting\"}`. Valid values:\n\n    *   **on**: enables the transaction splitting feature. By default, the feature is enabled.\n    *   **off**: disables the transaction splitting feature.\n\n*   Specify the offload reads from the primary node feature in the format of `{\"MasterAcceptReads\":\"Offload reads from the primary node\"}`. Default value: off. Valid values:\n\n    *   **on**: The primary node accepts read requests.\n    *   **off**: The primary node does not accept read requests.\n\n*   Specify the connection pool in the format of `{\"ConnectionPersist\":\"Connection pool\"}`. Default value: off. Valid values:\n\n    *   **off**: disables the connection pool.\n    *   **Session**: enables the session-level connection pool.\n    *   **Transaction**: enables the transaction-level connection pool.\n\n>- You can specify the transaction splitting, connection pool, and offload reads from the primary node features for a PolarDB for MySQL cluster only if ReadWriteMode is set to ReadWrite for the cluster endpoint.\n>- Only PolarDB for MySQL supports global consistency.\n>- If the **ReadWriteMode** parameter is set to **ReadOnly**, the consistency level must be **0**.\n>- You can use one record to specify the consistency level, transaction splitting, connection pool, and offload reads from the primary node features, such as `{\"ConsistLevel\":\"1\",\"DistributedTransaction\":\"on\",\"ConnectionPersist\":\"Session\",\"MasterAcceptReads\":\"on\"}`.\n>- The transaction splitting settings are restricted by the consistency level settings. For example, if you set the consistency level to **0**, transaction splitting cannot be enabled. If you set the consistency level to **1** or **2**, transaction splitting can be enabled.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EndpointType",
      "description": "The type of the cluster endpoint. Set the value to **Custom**.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Nodes",
      "description": "The reader nodes that you want to associate with the endpoint. If you want to specify multiple reader nodes, separate the reader nodes with commas (,). If you do not specify this parameter, all nodes are used.\n\n>- You need to specify the node IDs for a PolarDB for MySQL cluster.\n>- You need to specify the role name of each node for a PolarDB for PostgreSQL cluster or a PolarDB for PostgreSQL (Compatible with Oracle) cluster. Example: `Writer, Reader1, Reader2`.\n>- If you set **ReadWriteMode** to **ReadOnly**, you can associate only one node with the endpoint. If the only node becomes faulty, the cluster endpoint may be unavailable for up to 1 hour. We recommend that you associate more than one node with the cluster endpoint in production environments. We recommend that you associate at least two nodes with the cluster endpoint to improve service availability.\n>- If you set **ReadWriteMode** to **ReadWrite**, you need to associate at least two nodes with the cluster endpoint.\n>- PolarDB for MySQL does not impose a limit on the types of the two nodes. If the nodes are read-only nodes, write requests are forwarded to the primary node. \n>- PolarDB for PostgreSQL and PolarDB for PostgreSQL (compatible with Oracle) require a primary node.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "PolarFsInstanceId",
      "description": "",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "PolarSccTimeoutAction",
      "description": "Global consistency timeout strategy. The value range is as follows:\n- **0**: Send the request to the primary node\n- **2**: Timeout degradation, when a global consistency read times out, the query operation will automatically degrade to an inconsistent read, and the client will not receive an error message",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "PolarSccWaitTimeout",
      "description": "Global consistency timeout",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ReadWriteMode",
      "description": "The read/write mode. Valid values:\n\n*   **ReadWrite**: receives and forwards read and write requests. Automatic read/write splitting is enabled.\n*   **ReadOnly**: The account has the read-only permissions on the database.\n\nDefault value: **ReadOnly**.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SccMode",
      "description": "Specifies whether to enable the global consistency (high-performance mode) feature for the nodes. Valid values:\n\n*   **ON**\n*   **OFF**",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}