{
  "name": "ModifyDBClusterEndpoint",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AutoAddNewNodes",
      "description": "Specifies whether to enable automatic association of newly added nodes with the cluster endpoint. Valid values:\n\n*   **Enable**: enables automatic association of newly added nodes with the cluster endpoint.\n*   **Disable** (default): disables automatic association of newly added nodes with the cluster endpoint.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DBClusterId",
      "description": "The ID of the cluster.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "DBEndpointDescription",
      "description": "The name of the custom cluster endpoint.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DBEndpointId",
      "description": "The ID of the endpoint.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "EndpointConfig",
      "description": "The advanced configurations of the cluster endpoint, which are in the JSON format. You can configure the consistency level, transaction splitting, and connection pool settings, and specify whether the primary node accepts read requests.\n\n*   The load balancing policy. Format: `{\\\"LoadBalancePolicy\\\":\\\"Load balancing policy\\\"}`. Valid values:\n\n    *   **0** (default): connections-based load balancing\n    *   **1**: active requests-based load balancing\n\n*   Specifies whether to allow the primary node to accept read requests. Format: `{\\\"MasterAcceptReads\\\":\\\"Specification about whether to allow the primary node to accept read requests\\\"}`. Valid values:\n\n    *   **on** (default): allows the primary node to accept read requests.\n    *   **off**: does not allow the primary node to accept read requests.\n\n*   Specifies whether to enable the transaction splitting feature. Format: `{\\\"DistributedTransaction\\\":\\\"Specification about whether to enable the transaction splitting feature\\\"}`. Valid values:\n\n    *   **on** (default): enables the transaction splitting feature.\n    *   **off**: disables the transaction splitting feature.\n\n*   The consistency level. Format: `{\\\"ConsistLevel\\\":\\\"Consistency level\\\"}`. Valid values:\n\n    *   **0**: eventual consistency (weak)\n    *   **1** (default): session consistency (medium)\n    *   **2**: global consistency (strong)\n\n*   The global consistency timeout. Format: `{\\\"ConsistTimeout\\\":\\\"Global consistency timeout\\\"}`. Valid values: 0 to 60,000. Default value: 20. Unit: ms.\n\n*   The session consistency timeout. Format: `{\\\"ConsistSessionTimeout\\\":\\\"Session consistency timeout\\\"}`. Valid values: 0 to 60,000. Default value: 0. Unit: ms.\n\n*   The global (or session) consistency timeout policy. Format: `{\\\"ConsistTimeoutAction\\\":\\\"Consistency timeout policy\\\"}`. Valid values:\n\n    *   **0** (default): PolarProxy sends read requests to the primary node.\n    *   **1**: PolarProxy returns the \"wait replication complete timeout, please retry\" error message to the application.\n\n*   Specifies whether to enable the connection pool feature. Format: `{\\\"ConnectionPersist\\\":\\\"Specification about whether to enable the connection pool feature\\\"}`. Valid values:\n\n    *   **off** (default): disables the connection pool feature.\n    *   **Session**: enables the session-level connection pool.\n    *   **Transaction**: enables the transaction-level connection pool.\n\n*   Specifies whether to enable the parallel query feature. Format: `{\\\"MaxParallelDegree\\\":\\\"Specification about whether to enable the parallel query feature\\\"}`. Valid values:\n\n    *   **on**: enables the parallel query feature.\n    *   **off** (default): disables the parallel query feature.\n\n*   Specifies whether to enable the automatic request distribution among row store and column store nodes feature. Format: `{\\\"EnableHtapImci\\\":\\\"Specification about whether to enable automatic request distribution among row store and column store nodes feature\\\"}`. Valid values:\n\n    *   **on**: enables the automatic request distribution among row store and column store nodes feature.\n    *   **off** (default): disables the automatic request distribution among row store and column store nodes feature.\n\n*   Specifies whether to enable the overload protection feature. Format: `{\\\"EnableOverloadThrottle\\\":\\\"Specification about whether to enable the overload protection feature\\\"}`. Valid values:\n\n    *   **on**: enables the overload protection feature.\n    *   **off** (default): disables the overload protection feature.\n\n> \n\n*   You can configure the transaction splitting, connection pool, and overload protection settings, and specify whether the primary node accepts read requests settings for the cluster endpoint of a PolarDB for MySQL cluster only if ReadWriteMode of the cluster endpoint is set to Read and Write (Automatic Read/Write Splitting).\n\n*   If ReadWriteMode of the cluster endpoint of a PolarDB for MySQL cluster is set to **Read-only**, you can specify the **Connections-based Load Balancing** or **Active Request-based Load Balancing** policy for the cluster endpoint. If ReadWriteMode of the cluster endpoint of a PolarDB for MySQL cluster is set to **Read/Write (Automatic Read/Write Splitting)**, you can specify only the **Active Request-based Load Balancing** policy for the cluster endpoint.\n\n*   You can enable automatic request distribution among column store and row store nodes for the cluster endpoint of a PolarDB for MySQL cluster if ReadWriteMode of the cluster endpoint is set to **Read and Write (Automatic Read/Write Splitting)**, or if the ReadWriteMode of the cluster endpoint is set to **Read-only** and the load balancing policy is set to **Active requests-based load balancing**.\n\n*   Only PolarDB for MySQL supports global consistency.\n\n*   You can set the consistency level of the cluster endpoint of a PolarDB for MySQL cluster only to **0** if **ReadWriteMode** of the cluster endpoint is set to **ReadOnly**.\n\n*   You can configure the settings for the consistency level, transaction splitting, and connection pool features, and specify whether the primary node accepts read requests settings at a time. Example: `{\\\"ConsistLevel\\\":\\\"1\\\",\\\"DistributedTransaction\\\":\\\"on\\\",\\\"ConnectionPersist\\\":\\\"Session\\\",\\\"MasterAcceptReads\\\":\\\"on\\\"}`.\n\n*   The configuration for transaction splitting is limited by the configuration for the consistency level. For example, if you set the consistency level to **0**, you cannot enable transaction splitting. If you set the consistency level to **1** or **2**, you can enable transaction splitting.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Nodes",
      "description": "The reader nodes to be associated with the endpoint. If you need to specify multiple reader nodes, separate the reader nodes with commas (,). If you do not specify this parameter, the predefined nodes are used by default.\n\n> \n\n*   You must specify the node ID for each PolarDB for MySQL cluster.\n\n*   You must specify the role name of each node for each PolarDB for PostgreSQL or PolarDB for Oracle cluster. Example: `Writer,Reader1,Reader2`.\n\n*   If you set **ReadWriteMode** to **ReadOnly**, only one node can be associated with the cluster endpoint. If the only node becomes faulty, the cluster endpoint may be unavailable for up to an hour. We recommend that you do not associate only one node with the cluster endpoint in production environments. We recommend that you associate at least two nodes with the cluster endpoint to improve service availability.\n\n*   If you set **ReadWriteMode** to **ReadWrite**, you must associate at least two nodes with the cluster endpoint.\n\n    *   No limits are imposed on the two nodes that you select for each PolarDB for MySQL cluster. If the two nodes are read-only nodes, write requests are forwarded to the primary node.\n    *   The following limit applies to PolarDB for PostgreSQL and PolarDB for Oracle clusters: One of the selected nodes must be the primary node.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "PolarSccTimeoutAction",
      "description": "Global consistency timeout policy. Valid values:\n\n*   **0**: sends the request to the primary node.\n*   **2**: downgrades the consistency level of a query to inconsistent read when a global consistent read in the query times out. No error message is returned to the client.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "PolarSccWaitTimeout",
      "description": "Global consistency timeout.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ReadWriteMode",
      "description": "The read/write mode. Valid values:\n\n*   **ReadWrite**: The cluster endpoint handles read and write requests. Automatic read/write splitting is enabled.\n*   **ReadOnly**: The cluster endpoint handles read-only requests.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SccMode",
      "description": "Specifies whether to enable the global consistency (high-performance mode) feature for the nodes. Valid values:\n\n*   **ON**\n*   **OFF**",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}