{
  "name": "ModifyMaskingRules",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "DBClusterId",
      "description": "The ID of the cluster.\n\n> You can call the [DescribeDBClusters](~~98094~~) operation to query the details of the clusters that belong to your Alibaba Cloud account, such as cluster IDs.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Enable",
      "description": "Specifies whether to enable the specified masking rule. Valid values:\n\n*   **true**\n*   **false**\n\n> This parameter is valid only when the `RuleNameList` parameter is specfied.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RuleConfig",
      "description": "The parameter that is used to specify the masking rule that you want to modify and the value in the JSON format. All parameter values are of the string type. Example: `{\"auto\": {\"databases\": [\"db1\"], \"tables\": [\"tb1\"], \"columns\": [\"c1,c2\"] }, \"description\": \"This rule will be applied to the columns c1 and c2 in table t1\", \"enabled\": true, \"applies_to\": [\"user\"]}`. Parameters in the function:\n\n*   `\"auto\"`: specifies that the dynamic masking algorithm is supported. This parameter is required.\n*   `\"databases\"`: Optional. The names of databases to which the masking rule is applied. Separate the names with commas (,). If you leave this parameter empty, the masking rule applies to all databases in the cluster.\n*   `\"tables\"`: Optional. The names of tables to which the masking rule is applied. Separate the names with commas (,). If you leave this parameter empty, the rule applies to all tables in the cluster.\n*   `\"columns\"`: Required. The names of fields to which the masking rule is applied. Separate the names with commas (,).\n*   `\"description\"`: Optional. The description of the masking rule. The description can be up to 64 characters in length.\n*   `\"enabled\"`: Required. Specifies whether to enable the masking rule. Valid values: **true** and **false**.\n*   `\"applies_to\"`: The names of database accounts to which the masking rule is applied. Separate the names with commas (,).\n*   `\"exempted\"`: The names of database accounts to which the masking rule is not applied. Separate the names with commas (,).\n\n>- If you specify `RuleName`, `RuleConfig` parameter is required. \n>- You need to select either `\"applies_to\"` or `\"exempted\"`.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RuleName",
      "description": "The name of the data masking rule. You can specify only one rule name at a time.\n\n>- You can call the [DescribeMaskingRules](~~212573~~) operation to query the details of all masking rules for a specified cluster, such as the names of the masking rules.\n>- If the rule name does not exist in the cluster, the system automatically creates a masking rule based on the name and the value of `RuleConfig`.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RuleNameList",
      "description": "The list of masking rule names. You can specify one or more masking rules at a time. Separate the masking rule names with commas (,).\n\n> You must specify either the `RuleName` or `RuleNameList` parameter.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}