{
  "version": "2022-08-28",
  "style": "restful",
  "apis": {
    "CreateAutofeExperiment": {
      "title": "CreateAutofeExperiment",
      "summary": "CreateAutofeExperiment",
      "deprecated": false
    },
    "CreateHpoExperiment": {
      "title": "CreateHpoExperiment",
      "summary": "calling HPO CreateExperiment",
      "deprecated": false
    },
    "CreateServiceIdentityRole": {
      "title": "CreateServiceIdentityRole",
      "summary": "Creates a service-linked role.",
      "deprecated": false
    },
    "DeleteHpoExperiment": {
      "title": "DeleteHpoExperiment",
      "summary": "Deletes a hyperparameter optimization (HPO) experiment. After you delete the experiment, you cannot obtain the data about the experiment and its trials by using the Get or List API operations.",
      "deprecated": false
    },
    "GetAutofeExperiment": {
      "title": "Get AutoFE Experiment Information",
      "summary": "Get AutoFE Experiment",
      "deprecated": false
    },
    "GetHpoExperiment": {
      "title": "GetHpoExperiment",
      "summary": "Queries the information about a hyperparameter optimization (HPO) experiment, including the status and configuration of the experiment, and the status of its trials.",
      "deprecated": false
    },
    "GetHpoTrial": {
      "title": "GetHpoTrial",
      "summary": "Queries information about a trial in a hyperparameter optimization (HPO) experiment.",
      "deprecated": false
    },
    "GetServiceIdentityRole": {
      "title": "GetServiceIdentityRole",
      "summary": "GetServiceIdentityRole, return role name if SLR exists, empty otherwise",
      "deprecated": false
    },
    "ListHpoExperimentLogs": {
      "title": "ListHpoExperimentLogs",
      "summary": "Queries the content of a log file for a hyperparameter optimization (HPO) experiment.",
      "deprecated": false
    },
    "ListHpoExperiments": {
      "title": "ListHpoExperiments",
      "summary": "Queries information about a hyperparameter optimization (HPO) experiment that meets specific requirements.",
      "deprecated": false
    },
    "ListHpoTrialCommands": {
      "title": "ListHpoTrialCommands",
      "summary": "Queries the command output of a trial in a hyperparameter optimization (HPO) experiment. A trial of an HPO experiment runs one or more commands in sequence based on the command set specified in the configuration. You can call this API operation to obtain the output of these commands.",
      "deprecated": false
    },
    "ListHpoTrialLogNames": {
      "title": "ListHpoTrialLogNames",
      "summary": "Lists the names of all log files of the specific trial in a specific hyperparameter optimization (HPO) experiment.",
      "deprecated": false
    },
    "ListHpoTrialLogs": {
      "title": "ListHpoTrialLogs",
      "summary": "Lists the content of a specific log file of a hyperparameter optimization (HPO) trial by pages.",
      "deprecated": false
    },
    "ListHpoTrials": {
      "title": "ListHpoTrials",
      "summary": "Returns all the trials for the specified experiment ID.",
      "deprecated": false
    },
    "RestartHpoTrials": {
      "title": "RestartHpoTrials",
      "summary": "Restarts failed trials in an hyperparameter optimization (HPO) experiment. The system extracts the configuration of the hyperparameters of a specific trial. If none of the trials that use this configuration are successful in the experiment, the system restarts trials by using this configuration.",
      "deprecated": false
    },
    "StopHpoExperiment": {
      "title": "StopHpoExperiment",
      "summary": "Stops a hyperparameter optimization (HPO) experiment, including its trials and the backend tasks.",
      "deprecated": false
    },
    "StopHpoTrials": {
      "title": "StopHpoTrials",
      "summary": "Stops specific trials in a hyperparameter optimization (HPO) experiment and the backend tasks of the trials.",
      "deprecated": false
    },
    "UpdateHpoExperiment": {
      "title": "UpdateHpoExperiment",
      "summary": "Updates the configurations of a running hyperparameter optimization (HPO) experiment. After you update the experiment, the experiment continues to run based on the new configurations.",
      "deprecated": false
    }
  }
}