{
  "name": "StartExecution",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ClientToken",
      "description": "The access token.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Description",
      "description": "The description of the execution.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "LoopMode",
      "description": "The loop mode. Valid values:\n\n*   Automatic: does not suspend the execution of the template. This is the default value.\n*   FirstBatchPause: suspends the execution of the template after the first batch is complete.\n*   EveryBatchPause: suspends the execution of the template after each batch is complete.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Mode",
      "description": "The execution mode. Valid values:\n\n*   Automatic: automatically starts the execution of the template. This is the default value.\n*   FailurePause: suspends the execution of the template upon a failure.\n*   Debug: manually starts the execution of the template.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Parameters",
      "description": "The JSON string that consists of a set of parameters. Default value: {}.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ParentExecutionId",
      "description": "The ID of the parent execution.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The ID of the region in which the execution resides.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ResourceGroupId",
      "description": "The ID of the resource group.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SafetyCheck",
      "description": "The security check mode. Valid values:\n\n*   Skip: specifies that you are aware of the risks. The system performs all actions in the execution without manual confirmation, regardless of the risk level. This parameter is valid only if the `Mode` parameter is set to Automatic.\n*   ConfirmEveryHighRiskAction: requires you to confirm each high-risk action. This is the default value. You can call the **NotifyExecution** operation to confirm or cancel an action.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Tags",
      "description": "The tags for the execution.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TemplateContent",
      "description": "The content of the template in the JSON or YAML format. This parameter is the same as the Content parameter that you can specify when you call the CreateTemplate operation. You can use this parameter to specify the tasks that you want to run. This way, you do not need to create a template before you start an execution. If you select an existing template, you do not need to specify this parameter.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TemplateName",
      "description": "The name of the template. The name must be 1 to 200 characters in length, and can contain letters, digits, hyphens (-), and underscores (\\_).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TemplateURL",
      "description": "The Object Storage Service (OSS) URL of the object that stores the content of the Operation Orchestration Service (OOS) template. The access control list (ACL) of the object must be public-read. You can use this parameter to specify the tasks that you want to run. This way, you do not need to create a template before you start an execution. If you select an existing template, you do not need to specify this parameter.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TemplateVersion",
      "description": "The version number of the template. If you do not specify this parameter, the system uses the latest version.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}