{
  "name": "SendFile",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Content",
      "description": "The content of the file. The file must not exceed 32 KB in size after it is encoded in Base64.\n\n*   If `ContentType` is set to `PlainText`, the value of Content is in plaintext.\n*   If `ContentType` is set to `Base64`, the value of Content is Base64-encoded.",
      "position": "Body",
      "type": "String",
      "required": true
    },
    {
      "name": "ContentType",
      "description": "The content type of the file. Valid values:\n\nPlainText Base64 Default value: PlainText.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "Description",
      "description": "The description of the file. The description can be up to 512 characters in length and can contain any characters.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "FileGroup",
      "description": "The user group of the file. This parameter takes effect only on Linux instances. Default value: root. The value can be up to 64 characters in length.\n\nNote If you want to use a non-root user group, make sure that the user group exists in the instances.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "FileMode",
      "description": "The permissions on the file. This parameter takes effect only on Linux instances. You can configure this parameter in the same way as you configure the chmod command.\n\nDefault value: 0644: the owner of the file has the read and write permission. The user group of the file and other users have read-only permission.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "FileOwner",
      "description": "The owner of the file. This parameter takes effect only on Linux instances. Default value: root.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "Name",
      "description": "The file name. The name can be up to 255 characters in length and can contain any characters.",
      "position": "Body",
      "type": "String",
      "required": true
    },
    {
      "name": "NodeIdList",
      "description": "The node list.",
      "position": "Body",
      "type": "Json",
      "required": true
    },
    {
      "name": "Overwrite",
      "description": "Specifies whether to overwrite file with the same name in the destination directory.\n\n*   true\n*   false\n\nDefault value: false.",
      "position": "Body",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "TargetDir",
      "description": "The directory in the Lingjun node to which the file is sent. If the specified directory does not exist, the system creates the directory automatically.",
      "position": "Body",
      "type": "String",
      "required": true
    },
    {
      "name": "Timeout",
      "description": "The timeout period for the file sending task. Unit: seconds.\n\n*   A timeout error occurs when a file cannot be sent because the process slows down or because a specific module or Cloud Assistant Agent does not exist.\n*   If the specified timeout period is less than 10 seconds, the system sets the timeout period to 10 seconds to ensure that the file can be sent.\n\nDefault value: 60.",
      "position": "Body",
      "type": "Integer",
      "required": false
    }
  ]
}