{
  "name": "CreateApplication",
  "deprecated": false,
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AccessTokenValidity",
      "description": "The validity period of the access token.\n\nValid values: 900 to 10800. Unit: seconds.\n\nDefault value: 3600.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "AppName",
      "description": "The application name.\n\nThe name can be up to 64 characters in length. The name can contain letters, digits, periods (.), underscores (\\_), and hyphens (-).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "AppType",
      "description": "The type of the application. Valid values:\n\n*   WebApp: a web application that interacts with a browser.\n*   NativeApp: a native application that runs on an operating system, such as a desktop operating system or a mobile operating system.\n*   ServerApp: an application that accesses Alibaba Cloud services without the need of manual user logon. User provisioning is automated based on the System for Cross-Domain Identity Management (SCIM) protocol.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "DisplayName",
      "description": "The display name of the application.\n\nThe name can be up to 24 characters in length.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "IsMultiTenant",
      "description": "Indicates whether the application can be installed by using other Alibaba Cloud accounts. Valid values:\n\n*   true: If you do not set this parameter for applications of the NativeApp and ServerApp types, true is used.\n*   false: If you do not set this parameter for applications of the WebApp type, false is used.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "PredefinedScopes",
      "description": "The scope of application permissions.\n\nFor more information about the application permission scope, see [Open authorization scope](~~93693~~). You can also call the [ListPredefinedScopes](~~187206~~) operation to obtain the permission scopes supported by different types of applications.\n\nIf you enter multiple permission scopes, separate them with semicolons (;).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RedirectUris",
      "description": "The callback URL.\n\nIf you enter multiple callback URLs, separate them with semicolons (;).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RefreshTokenValidity",
      "description": "The validity period of the refreshed token.\n\nValid values: 7200 to 31536000. Unit: seconds.\n\nDefault value:\n\n*   For applications of the WebApp and ServerApp types, if this parameter is left empty, the value 2592000 is used. The value 2592000 indicates that the validity period of the refreshed token is 30 days.\n*   For applications of the NativeApp type, if this parameter is left empty, the value 7776000 is used. The value 7776000 indicates that the validity period of the refreshed token is 90 days.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "RequiredScopes",
      "description": "The required permission.\n\nYou can specify one or more permissions for the `RequiredScopes` parameter. After you specify this parameter, the required permissions are automatically selected and cannot be revoked when a user grants permissions on the application.\n\nIf you enter multiple permissions, separate them with semicolons (;).\n\n>  If the permission that you specify for the `RequiredScopes` parameter is not included in value of the `PredefinedScopes` parameter, the permission does not take effect.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SecretRequired",
      "description": "Indicates whether a secret is required. Valid values:\n\n*   true\n*   false\n\n>- For applications of the WebApp and ServerApp types, this parameter is automatically set to true and cannot be changed.\n>- For applications of the NativeApp type, this parameter can be set to true or false. If you do not set this parameter, false is used. Applications of the NativeApp type run in untrusted environments and the secrets of these applications are not protected. Therefore, we recommend that you do not set this parameter to true unless otherwise specified. For more information, see [Use an application of the NativeApp type to log on to Alibaba Cloud](~~93697~~).",
      "position": "Query",
      "type": "Boolean",
      "required": false
    }
  ]
}