{
  "name": "CreateOTAVerifyJob",
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "DownloadProtocol",
      "description": "The download protocol of the update package. Valid values: **HTTPS** and **MQTT**. Default value: HTTPS. After the device receives the update package information pushed by IoT Platform, this protocol is used to download the update package.\n\n> If you want to download the update package over MQTT, take note of the following items:\n>*   The following regions are supported: China (Shanghai), China (Beijing), and China (Shenzhen).\n>*   The OTA update package can contain only one file and the size of the file cannot exceed 16 MB.\n>*   You must use the latest version of Link SDK for C to develop the device features to perform OTA updates and download files over MQTT. For more information, see [Sample code](~~330985~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "FirmwareId",
      "description": "The ID of the update package.\n\nThe **FirmwareId** parameter is returned when you call the [CreateOTAFirmware](~~147311~~) operation to create an OTA update package.\n\nYou can also call the [ListOTAFirmware](~~147450~~) operation to obtain the ID.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "IotInstanceId",
      "description": "The ID of the instance. You can view the ID of an instance on the **Overview** page in the IoT Platform console.\n\n>*   If your instance has an ID, you must specify the ID for this parameter. Otherwise, the call fails.****\n>*   If no **Overview** page or **ID** is generated for your instance, you do not need to configure this parameter.\n\nFor more information, see [Overview](~~356505~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "NeedConfirm",
      "description": "Specifies whether to control the update by using a mobile app. You must develop the mobile app as needed.\n\n*   **false** (default): no. A device obtains the information about the OTA update task based on the **NeedPush** parameter.\n*   **true**: yes To perform an OTA update on a device, you must confirm the update by using your mobile app. Then, the device can obtain the information about the OTA update task based on the **NeedPush** parameter.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "NeedPush",
      "description": "Specifies whether to automatically push update tasks from IoT Platform to devices.\n\n*   **true** (default): yes. After an update batch is created, IoT Platform automatically pushes update tasks to the specified online devices.\n\n    In this case, a device can still initiate a request to obtain the information about the over-the-air (OTA) update task from IoT Platform.\n\n*   **false**: no. A device must initiate a request to obtain the information about the OTA update task from IoT Platform.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "ProductKey",
      "description": "The ProductKey of the product to which the OTA update package belongs.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Tag",
      "description": "",
      "position": "Query",
      "type": "RepeatList",
      "required": false,
      "sub_parameters": [
        {
          "name": "Key",
          "position": "Query",
          "type": "String",
          "required": true
        },
        {
          "name": "Value",
          "position": "Query",
          "type": "String",
          "required": true
        }
      ]
    },
    {
      "name": "TargetDeviceName",
      "description": "",
      "position": "Query",
      "type": "RepeatList",
      "required": true
    },
    {
      "name": "TimeoutInMinutes",
      "description": "The timeout period for a device to update the firmware. Unit: minutes. Valid values: 1 to 1440.",
      "position": "Query",
      "type": "Integer",
      "required": false
    }
  ]
}