{
  "name": "CreateRuleAction",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Configuration",
      "description": "The configurations of the rule action. You must specify a JSON string. The configurations vary based on the types of rule actions. For more information about required syntax and examples, see the following tables.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ErrorActionFlag",
      "description": "Specifies whether the rule action forwards error operation data. Error operation data is generated when the rules engine failed to forward data from the IoT Platform topic to the destination cloud service. A data forwarding failure indicates that forwarding retries also fail. Valid values:\n\n*   **true**: forwards error operation data.\n*   **false**: forwards normal data instead of error operation data.\n\nDefault value: **false**.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "IotInstanceId",
      "description": "The ID of the instance. You can view the instance **ID** on the **Overview** page in the IoT Platform console.\n\n>*   If your instance has an ID, you must configure this parameter. If you do not set this parameter, the call fails.\n>*   If your instance has no **Overview** page or ID, you do not need to set this parameter.\n\nFor more information, see [Overview](~~356505~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RuleId",
      "description": "The ID of the rule for which you want to create an action. You can log on to the IoT Platform console, and choose **Rules** > **Data Forwarding** to view the rule ID. You can also call the [ListRule](~~69486~~) operation and view the rule ID in the response.",
      "position": "Query",
      "type": "Long",
      "required": true
    },
    {
      "name": "Type",
      "description": "The type of the rule action. Valid values:\n\n*   **REPUBLISH**: forwards topic data that is processed by the rules engine to another IoT Platform topic.\n*   **AMQP**: forwards data to an AMQP consumer group.\n*   **MNS**: forwards data that is processed by the rules engine to Message Service (MNS).\n*   **FC**: forwards topic data that is processed by the rules engine to Function Compute for event computing.\n*   **OTS**: forwards data that is processed by the rules engine to OTS for NoSQL data storage.\n\n>  If you set the **DataType** parameter to **BINARY**, rules are created in the binary format. These rules cannot be used to forward data to Tablestore.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}