{
  "name": "CreateOTAFirmware",
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "DestVersion",
      "description": "The version number of the OTA update package. The value can contain letters, digits, periods (.), hyphens (-), and underscores (\\_). The version number must be 1 to 64 characters in length.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "FirmwareDesc",
      "description": "The description of the OTA update package. The description must be 1 to 100 characters in length.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "FirmwareName",
      "description": "The name of the OTA update package. The name must be unique within an Alibaba Cloud account. The name cannot be modified after the OTA update package is created. The name must be 1 to 40 characters in length, and can contain letters, digits, hyphens (-), underscores (\\_), and parentheses (). The name must start with a letter or a digit.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "FirmwareSign",
      "description": "The signature of the OTA update package. The value is calculated by using the specified **signature algorithm** to sign the OTA update package.\n\n> If you add only one file to the OTA update package, you can configure this parameter. If you do not configure this parameter, the MD5 value of the OTA update package in OSS is used as the package signature.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "FirmwareSize",
      "description": "The size of the OTA update package. Unit: bytes.\n\n> If you add only one file to the OTA update package, you can configure this parameter. If you do not configure this parameter, the size of the OTA update package in OSS is used.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "FirmwareUrl",
      "description": "The URL of the OTA update package. This parameter specifies the storage location of the OTA update package in OSS. You can call the [GenerateOTAUploadURL](~~147310~~) operation to generate a URL for the OTA update package.\n\n>If you add only one file to the OTA update package, you must configure this parameter.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "IotInstanceId",
      "description": "The ID of the instance. You can view the ID of the instance on the **Overview** page in the IoT Platform console.\n\n>*   If your instance has an ID, you must specify the ID for this parameter. Otherwise, the call fails.\n>*   If no **Overview** page or **ID** is generated for your instance, you do not need to configure this parameter.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ModuleName",
      "description": "The name of the OTA module. OTA modules are the updatable units of devices that belong to the same product.\n\n> *   If you do not configure this parameter, the default OTA module is used. The default value indicates that the complete device firmware is updated.\n>*   You can call the [CreateOTAModule](~~186066~~) operation to create a custom OTA module. You can call the [ListOTAModuleByProduct](~~186532~~) operation to query the existing OTA modules of a product.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "MultiFiles",
      "description": "",
      "position": "Query",
      "type": "RepeatList",
      "required": false,
      "sub_parameters": [
        {
          "name": "FileMd5",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "Name",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "SignValue",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "Size",
          "position": "Query",
          "type": "Integer",
          "required": false
        },
        {
          "name": "Url",
          "position": "Query",
          "type": "String",
          "required": false
        }
      ]
    },
    {
      "name": "NeedToVerify",
      "description": "Specifies whether to verify the OTA update package before you create a batch update task.\n\n*   **true** The system verifies the OTA update package before you create a batch update task. This is the default value.\n*   **false**: The system does not verify the OTA update package before you create a batch update task.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "ProductKey",
      "description": "The **ProductKey** of the product to which the OTA update package belongs.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SignMethod",
      "description": "The signature algorithm of the OTA update package. Set the value to **MD5**. The value indicates an MD5 signature.\n\nDefault value: **MD5**.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SrcVersion",
      "description": "The version number of the OTA module of the device to be updated.\n\nYou can call the [QueryDeviceDetail](~~69594~~) operation and view the **FirmwareVersion** parameter in the response.\n\n> *   If you set the **Type** parameter to **1**, you must configure this parameter, and the value cannot be the same as the update package version that is specified by the **DestVersion** parameter.\n>*   If you set the **Type** parameter to **0**, this parameter is optional.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Type",
      "description": "The type of the OTA update package. Valid values:\n\n*   **0**: The uploaded file contains a full update package. IoT Platform pushes the full update package to a device for update.\n*   **1**: The uploaded file contains only the differences between the latest update package and the previous update package. IoT Platform pushes only the differences to a device for update.\n\nDefault value: **0**.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "Udi",
      "description": "The custom information that you want to send to a device. The format of the custom information has no limits. However, the information cannot exceed 4,096 characters in length.\n\nAfter you add the OTA update package and create an update task, IoT Platform sends the custom information to the specified device when IoT Platform pushes an update notification.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}