{
  "name": "SetDeviceGroupTags",
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "GroupId",
      "description": "The ID of the group. The ID is the globally unique identifier (GUID) for the group.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "GroupType",
      "description": "The type of the group.\n\nYou do not need to configure this parameter.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "IotInstanceId",
      "description": "The ID of the instance. On the **Overview** page in the IoT Platform console, you can view the **ID** of the instance.\n\n\n>*   If your instance has an ID, you must specify the ID for this parameter. Otherwise, the call fails.\n>*   If the **Overview** page or instance ID is not displayed in the IoT Platform console, you do not need to configure this parameter.\n\nFor more information about the instance, see [Overview](~~356505~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TagString",
      "description": "The tag data in the JSON format. The TagString parameter specifies multiple tags in the format of key-value pairs. You must specify **tagKey** and **tagValue** for each tag.\n\n*   **tagKey**: the tag key. The key must be 2 to 30 characters in length, and can contain letters, digits, and periods (.).\n*   **tagValue**: the tag value. Each value can contain letters, digits, underscores (\\_), and hyphens (-). The value must be 1 to 128 characters in length.\n\nSeparate multiple tags with commas (,). Example: `[{\"tagKey\":\"h1\",\"tagValue\":\"rr\"},{\"tagKey\":\"7h\",\"tagValue\":\"rr\"}]`\n\nIf you specify a new value for an existing tag, the new tag value overwrites the original value.\n\nIf you want to delete a tag, you do not need to specify the key and value for the tag.\n\n**\n\n**Important** `abc` is a key that is reserved by IoT Platform. You cannot set **tagKey** to abc. If you set `tagKey` to abc, the abc tag is automatically filtered when you query tags.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}