{
  "name": "UpdateRuleAction",
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ActionId",
      "description": "The ID of the rule action to be modified.\n\nAfter you call the [CreateRuleAction](~~69586~~) operation to create a rule action, the rule action ID is returned. You can call the [ListRuleActions](~~69517~~) operation to view the rule action ID.",
      "position": "Query",
      "type": "Long",
      "required": true
    },
    {
      "name": "Configuration",
      "description": "The configurations of the rule action. The configurations for different rule action types are different. For more information about the configurations for different rule action types, see [CreateRuleAction](~~69586~~).",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "IotInstanceId",
      "description": "The ID of the instance. You can view the instance **ID** on the **Overview** page in the IoT Platform console.\n\n>*   If your instance has an ID, you must configure this parameter. If you do not set this parameter, the call fails.\n>*   If your instance has no **Overview** page or ID, you do not need to set this parameter.\n\nFor more information, see [Overview](~~356505~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Type",
      "description": "The type of the rule action. Valid values:\n\n*   **MNS**: forwards topic data that is processed by the rules engine to MNS.\n*   **FC**: forwards topic data that is processed by the rules engine to Function Compute for event computing.\n*   **REPUBLISH**: forwards topic data that is processed by the rules engine to another IoT Platform topic.\n*   **AMQP**: forwards data to an AMQP consumer group.\n*   **OTS**: forwards topic data that is processed by the rules engine to Tablestore for NoSQL data storage.\n\n> *   If you set the **DataType** parameter to **BINARY**, rules are created in the binary format. These rules cannot be used to forward data to Tablestore.\n>*   Destination Alibaba Cloud services that are supported by the rules engine vary based on regions. For more information about the regions and destination cloud services that are supported by the rules engine, see [Regions and zones](~~85669~~).",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}