{
  "name": "UpdateDeviceShadow",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "DeltaUpdate",
      "description": "Specifies whether to perform an incremental update on the **desired** parameter. Valid values:\n\n*   **true**: performs an incremental update.\n*   **false**: performs a full update. This is the default value.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "DeviceName",
      "description": "The name of the device whose shadow information you want to modify.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "IotInstanceId",
      "description": "The ID of the elastic container instance. You can view the ID of the instance on the **Overview** page in the IoT Platform console.****\n\n>*   If your instance has an ID, you must specify the ID for this parameter. Otherwise, the call fails.****\n>*   If no **Overview** page or **ID** is generated for your instance, you do not need to configure this parameter.\n\nFor more information, see [Overview](~~356505~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ProductKey",
      "description": "The ProductKey of the product to which the device belongs.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ShadowMessage",
      "description": "The information that you want to specify for the device shadow.\n\nThe information includes the following parameters:\n\n*   **method**: the type of the operation. Data type: string. Set the value to **update**.\n\n*   **state**: the status of the device shadow. Data type: string. The **desired** parameter specifies the expected shadow status.\n\n*   **version**: the version of the device shadow. Data type: long.\n\n    *   If versioning is not required, set this parameter to 0.\n    *   If versioning is required, specify a version that is later than the current version.\n\n**\n\n**Important** If versioning is required, do not query the version of a device shadow in the IoT Platform console. If a large number of update and query operations are concurrently performed, multiple update operations may return the same version. In this case, the most recent update operation may first be completed. As a result, the current shadow information is not the latest shadow information. We recommend that you maintain the versions of device shadows on the on-premises device. When you call this operation, use an on-premises application to obtain the latest version of the device shadow.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}