{
  "name": "BatchCopyVpcFirewallControlPolicy",
  "deprecated": false,
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Lang",
      "description": "The language of the content within the request and response. Valid values:\n\n*   **zh**: Chinese (default)\n*   **en**: English",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SourceIp",
      "description": "The source IP address of the request.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SourceVpcFirewallId",
      "description": "The ID of the policy group of the source VPC firewall. Valid values:\n\n*   If the VPC firewall protects mutual access traffic between a VPC and a specified network instance that is attached to a Cloud Enterprise Network (CEN) instance, the value of this parameter is the ID of the CEN instance. The network instance can be a VPC, a virtual border router (VBR), or a Cloud Connect Network (CCN) instance.\n*   If the VPC firewall protects traffic between two VPCs that are connected by using an Express Connect circuit, the value of this parameter is the instance ID of the VPC firewall.\n\n>  You can call the [DescribeVpcFirewallAclGroupList](~~159760~~) operation to query the IDs of policy groups.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "TargetVpcFirewallId",
      "description": "The ID of the policy group of the destination VPC firewall. Valid values:\n\n*   If the VPC firewall protects mutual access traffic between a VPC and a specified network instance that is attached to a CEN instance, the value of this parameter is the ID of the CEN instance. The network instance can be a VPC, a VBR, or a CCN instance.\n*   If the VPC firewall protects traffic between two VPCs that are connected by using an Express Connect circuit, the value of this parameter is the instance ID of the VPC firewall.\n\n>  You can call the [DescribeVpcFirewallAclGroupList](~~159760~~) operation to query the IDs of policy groups.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}