{
  "name": "ModifyVpcFirewallConfigure",
  "deprecated": false,
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Lang",
      "description": "The language of the content within the request and response. Valid values:\n\n*   **zh**: Chinese (default)\n*   **en**: English",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "LocalVpcCidrTableList",
      "description": "The CIDR blocks of the local VPC. The value is a JSON string that contains the following parameters:\n\n*   **RouteTableId**: the ID of the route table for the local VPC.\n*   **RouteEntryList**: The value is a JSON string that contains the DestinationCidr and NextHopInstanceId parameters. The DestinationCidr parameter indicates the destination CIDR block of the local VPC. The NextHopInstanceId parameter indicates the instance ID of the next hop for the local VPC.\n\n> You can call the [DescribeVpcFirewallDetail](~~342892~~) operation to query the CIDR blocks of local VPCs for VPC firewalls.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "MemberUid",
      "description": "The UID of the member that is managed by your Alibaba Cloud account.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "PeerVpcCidrTableList",
      "description": "The CIDR blocks of the peer VPC. The value is a JSON string that contains the following parameters:\n\n*   **RouteTableId**: the ID of the route table for the peer VPC.\n*   **RouteEntryList**: The value is a JSON string that contains the DestinationCidr and NextHopInstanceId parameters. The DestinationCidr parameter indicates the destination CIDR block of the peer VPC. The NextHopInstanceId parameter indicates the instance ID of the next hop for the peer VPC.\n\n> You can call the [DescribeVpcFirewallDetail](~~342892~~) operation to query the CIDR blocks of peer VPCs for VPC firewalls.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "VpcFirewallId",
      "description": "The instance ID of the VPC firewall.\n\n> You can call the [DescribeVpcFirewallList](~~342932~~) operation to query the instance IDs of VPC firewalls.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "VpcFirewallName",
      "description": "The instance name of the VPC firewall.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}