{
  "name": "DetachHostGroupAccountsFromUser",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "HostGroups",
      "description": "The ID of the host group and the name of the host account on which you want to revoke permissions from the user. You can specify up to 10 host group IDs and up to 10 host account names for each host group. You can specify only host group IDs. In this case, the permissions on the specified host groups and all host accounts in the host groups are revoked from the user. For more information about this parameter, see the \"Description of the HostGroups parameter\" section of this topic.\n\n> You can call the [ListHostGroups](~~201307~~) operation to query the ID of the host group and the [ListHostAccounts](~~204372~~) operation to query the name of the host account.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "InstanceId",
      "description": "The ID of the bastion host for which you want to revoke permissions on the specified host groups and host accounts from the user.\n\n> You can call the [DescribeInstances](~~153281~~) operation to query the ID of the bastion host.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "RegionId",
      "description": "The region ID of the bastion host for which you want to revoke permissions on the specified host groups and host accounts from the user.\n\n> For more information about the mapping between region IDs and region names, see [Regions and zones](~~40654~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "UserId",
      "description": "The ID of the user from which you want to revoke permissions on the specified host groups and host accounts.\n\n> You can call the [ListUsers](~~204522~~) operation to query the ID of the user.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}