{
  "name": "SetDomain",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "BindStageName",
      "description": "The environment which you can access by using the domain name. If you do not specify this parameter, the domain name can be used to access all environments.\n\nIf you specify an environment, the domain name can be used to access only the specified environment. Valid values:\n\n*   TEST\n*   PRE\n*   RELEASE\n\nIf you want to use the domain name to access all environments, set this parameter to an empty string (\"\").",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "CustomDomainType",
      "description": "The network type of the domain name to be bound. Default value: INTERNET. Valid values:\n\n*   INTERNET\n*   INTRANET. If you set this parameter to this value, the domain name cannot be used on the Internet.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DomainName",
      "description": "The custom domain name.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "GroupId",
      "description": "The ID of the API group. This ID is generated by the system and globally unique.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "IsForce",
      "description": "Specifies whether this binding relationship takes precedence over the binding relationships between the domain name and other API groups. If you set this parameter to true, this binding relationship takes precedence, and the domain name is automatically unbound from other API groups. This operation brings risks. Proceed with caution.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "IsHttpRedirectToHttps",
      "description": "Specifies whether to redirect HTTP requests to HTTPS requests.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    }
  ]
}