{
  "name": "RefreshErObjectCaches",
  "deprecated": false,
  "protocol": "HTTPS",
  "method": "POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Force",
      "description": "Specifies whether to refresh resources in a directory if the resources requested are different from the resources on the origin server. Default value: false.\n\n*   **true**: refreshes all resources in the directory.\n*   **false**: refreshes the changed resources in the directory.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "MergeDomainName",
      "description": "The domain names that are merged for refreshing. POPs that provide services for the domain names are refreshed.\n\n>  Separate multiple domain names with commas (,).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ObjectPath",
      "description": "The URL that you want to refresh.\n\n> *   Separate URLs with line feeds (\\n or \\r\\n). Each object path can be up to 1,024 characters in length.\n>*   The URLs in a request must belong to the same domain name.\n>*   You can refresh up to 1,000 URLs in each request.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ObjectType",
      "description": "The refresh type. Valid values:\n\n*   **File** (default): refreshes content based on URLs.\n*   **Directory**: refreshes content based on directories.\n*   **Regex**: refreshes content based on regular expressions.\n*   **IgnoreParams**: removes the question mark (`?`) and parameters after the question mark (`?`) in a request URL and refreshes content. After you call this operation with the request URL submitted, the system compares the submitted URL with the URL of the cached resource without specific parameters. If the URLs match, the points of presence (POPs) refresh the cached resource.\n\n>  If you refresh the files in one or more directories, the resources in the directory that you want to refresh are marked as expired. You cannot delete the directory. If clients request resources on POPs that are marked as expired, Dynamic Content Delivery Network (DCDN) checks whether the resources on your origin server are updated. If resources are updated, DCDN retrieves the latest version of the resources and returns the resources to the clients. Otherwise, the origin server returns the 304 status code.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "RoutineId",
      "description": "The ID of the routine, which is in the format of \"Name.Subdomain\" and is the unique identifier of a custom routine.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}