{
  "name": "AddIpamPoolCidr",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Cidr",
      "description": "The CIDR block to provision.\n\n> Provision a CIDR block for a top-level private pool only by entering a CIDR block.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ClientToken",
      "description": "A client token that is used to ensure the idempotence of the request. Use the client to generate the token, but make sure that the token is unique among requests. The token can contain only ASCII characters.\n\n> If you do not specify this parameter, the system automatically uses the RequestId of the request as the ClientToken. The RequestId of each API request may be different.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DryRun",
      "description": "Specifies whether to perform a dry run. Valid values:\n\n- **true**: performs a dry run but does not provision the CIDR block. The system prechecks the required parameters, request syntax, and limits. If the request passes the dry run, the DryRunOperation error code is returned.\n\n- **false** (default): sends the request. If the request passes the check, a 2xx HTTP status code is returned and the operation is performed.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "IpamPoolId",
      "description": "The instance ID of the IPAM pool.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "NetmaskLength",
      "description": "The subnet mask of the CIDR block.\n\n> Provision a CIDR block for a top-level public IPv6 pool only by entering a mask.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The ID of the hosted region of the IPAM.\n\nCall [DescribeRegions](~~36063~~) to get the region ID.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}