{
  "name": "CreateIpamPoolAllocation",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Cidr",
      "description": "The CIDR block to allocate from the IPAM pool.\n\n> You must specify either the **Cidr** or **CidrMask** parameter.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "CidrMask",
      "description": "The mask of the CIDR block to allocate from the IPAM pool.\n\n> You must specify either the **Cidr** or **CidrMask** parameter.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request. Generate a value on your client to make sure that the value is unique among different requests. The token can contain only ASCII characters.\n\n> If you do not specify this parameter, the system automatically uses the RequestId of the request as the ClientToken. The RequestId may be different for each request.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DryRun",
      "description": "Specifies whether to perform a dry run. Valid values:\n\n- **true**: Sends a check request. The custom reserved CIDR block is not created. The system checks for required parameters, request format, and service limits. If the check fails, an error is returned. If the check passes, the DryRunOperation error code is returned.\n\n- **false** (default): Sends a normal request. After the request passes the check, a 2xx HTTP status code is returned and the custom reserved CIDR block is created.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "IpamPoolAllocationDescription",
      "description": "The description of the custom reserved CIDR block.\n\nThe description must be 1 to 256 characters in length. It must start with a letter or a Chinese character and cannot start with `http://` or `https://`. The default value is an empty string.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "IpamPoolAllocationName",
      "description": "The name of the custom reserved CIDR block.\n\nThe name must be 1 to 128 characters in length and cannot start with `http://` or `https://`.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "IpamPoolId",
      "description": "The ID of the IPAM pool.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "RegionId",
      "description": "The ID of the region where you want to create the custom reserved CIDR block.\n\nYou can call [DescribeRegions](~~36063~~) to obtain the region ID.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}