{
  "name": "UpdateIpam",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AddOperatingRegion",
      "description": "The list of operating regions to add to the IPAM.",
      "position": "Query",
      "type": "RepeatList",
      "required": false
    },
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request. You can use the client to generate the token, but you must make sure that the token is unique among different requests. ClientToken can contain only ASCII characters.\n\n> If you do not specify this parameter, the system automatically uses the request ID as the client token. The request ID for each request is unique.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DryRun",
      "description": "Specifies whether to perform a dry run. Valid values:\n\n- **true**: Performs a dry run. The system checks the required parameters, request format, and service limits. If the request fails the dry run, an error message is returned. If the request passes the dry run, the DryRunOperation error code is returned.\n\n- **false** (default): Sends the request. If the request passes the check, a 2xx HTTP status code is returned and the IPAM instance is modified.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "IpamDescription",
      "description": "The description of the IPAM. The description must be 1 to 256 characters in length and must start with a letter or a Chinese character. It cannot start with `http://` or `https://`. If you do not specify this parameter, the description is empty.\n\nIt must be 1 to 256 characters in length and start with a letter or a Chinese character, but cannot start with `http://` or `https://`. The default value is empty.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "IpamId",
      "description": "The instance ID of the IPAM.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "IpamName",
      "description": "The name of the IPAM. The name must be 1 to 128 characters in length and cannot start with `http://` or `https://`.\n\nThe value must be 1 to 128 characters long and cannot start with `http://` or `https://`.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The ID of the hosted region. You can call the [DescribeRegions](~~36063~~) operation to get the region ID.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "RemoveOperatingRegion",
      "description": "The list of operating regions to remove from the IPAM.",
      "position": "Query",
      "type": "RepeatList",
      "required": false
    }
  ]
}