{
  "name": "UpdateIpamPoolAllocation",
  "deprecated": false,
  "protocol": "HTTPS",
  "method": "POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ClientToken",
      "description": "A client token to ensure the idempotence of the request. Generate a unique value from your client for each request. ClientToken supports only ASCII characters.\n\n> If you do not specify this parameter, the system uses the request ID as the client token. The request ID is different for each request.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DryRun",
      "description": "Specifies whether to perform a dry run. Valid values:\n\n- **true**: Sends a check request without modifying the CIDR allocation. The system checks for required parameters, request format, and service limits. If the check fails, an error is returned. If the check passes, the DryRunOperation error code is returned.\n\n- **false** (default): Sends a normal request. After the check passes, an HTTP 2xx status code is returned and the CIDR allocation is modified.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "IpamPoolAllocationDescription",
      "description": "The description of the CIDR allocation.\n\nThe description must be 1 to 256 characters long and must start with a letter or a Chinese character. It cannot start with `http://` or `https://`. If you do not specify this parameter, the description is empty.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "IpamPoolAllocationId",
      "description": "The ID of the CIDR allocation.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "IpamPoolAllocationName",
      "description": "The name of the CIDR allocation.\n\nThe name must be 1 to 128 characters long. It cannot start with `http://` or `https://`.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The ID of the region where the CIDR allocation is located. To obtain a region ID, call the [DescribeRegions](~~36063~~) operation.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}