{
  "name": "CreateVpcPeerConnection",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AcceptingAliUid",
      "description": "The ID of the Alibaba Cloud account to which the accepter VPC belongs.\n\n*   To create a VPC peering connection within your Alibaba Cloud account, enter the ID of your Alibaba Cloud account.\n*   To create a VPC peering connection between your Alibaba Cloud account and another Alibaba Cloud account, enter the ID of the peer Alibaba Cloud account.\n\n>  If the accepter is a RAM user, set **AcceptingAliUid** to the ID of the Alibaba Cloud account that created the RAM user.",
      "position": "Body",
      "type": "Long",
      "required": true
    },
    {
      "name": "AcceptingRegionId",
      "description": "The region ID of the accepter VPC of the VPC peering connection that you want to create.\n\n*   To create an intra-region VPC peering connection, enter a region ID that is the same as that of the requester VPC.\n*   To create an inter-region VPC peering connection, enter a region ID that is different from that of the requester VPC.",
      "position": "Body",
      "type": "String",
      "required": true
    },
    {
      "name": "AcceptingVpcId",
      "description": "The ID of the accepter VPC.",
      "position": "Body",
      "type": "String",
      "required": true
    },
    {
      "name": "Bandwidth",
      "description": "The bandwidth of the VPC peering connection. Unit: Mbit/s. The value must be an integer greater than 0. Before you specify this parameter, make sure that you create an inter-region VPC peering connection.",
      "position": "Body",
      "type": "Integer",
      "required": false
    },
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request.\n\nYou can use the client to generate the token, but you must make sure that the token is unique among different requests. The token can contain only ASCII characters and cannot exceed 64 characters in length.\n\n>  If you do not specify this parameter, the system automatically uses the **request ID** as the **client token**. The **request ID** may be different for each request.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "Description",
      "description": "The description of the VPC peering connection.\n\nThe description must be 2 to 256 characters in length. The description must start with a letter but cannot start with `http://` or `https://`.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "DryRun",
      "description": "Specifies whether to perform only a dry run, without performing the actual request. Valid values:\n\n*   **true**: performs only a dry run. The system checks the request for potential issues, including missing parameter values, incorrect request syntax, and service limits. If the request fails the dry run, an error code is returned. If the request passes the dry run, the `DryRunOperation` error code is returned.\n*   **false** (default): performs a dry run and performs the actual request. If the request passes the dry run, a 2xx HTTP status code is returned and the operation is performed.",
      "position": "Body",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "Name",
      "description": "The name of the VPC peering connection.\n\nThe name must be 2 to 128 characters in length, and can contain digits, underscores (\\_), and hyphens (-). It must start with a letter.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The ID of the region where you want to create a VPC peering connection.\n\nYou can call the [DescribeRegions](~~36063~~) operation to query the most recent region list.",
      "position": "Body",
      "type": "String",
      "required": true
    },
    {
      "name": "ResourceGroupId",
      "description": "The ID of the resource group.\n\nFor more information about resource groups, see [Resource groups](~~94475~~).",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "VpcId",
      "description": "The ID of the requester VPC.",
      "position": "Body",
      "type": "String",
      "required": true
    }
  ]
}