{
  "name": "CreateVpnGateway",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AutoPay",
      "description": "Specifies whether to enable automatic payment. Valid values:\n\n*   **true**\n*   **false** (default)\n\n> To create a VPN gateway, we recommend that you enable automatic payment. If you disable automatic payment, you must manually pay the bill to create the VPN gateway.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "Bandwidth",
      "description": "The maximum bandwidth of the VPN gateway. Unit: Mbit/s.\n\n*   If you want to create a public VPN gateway, valid values are **10**, **100**, **200**, **500**, and **1000**.\n*   If you want to create a private VPN gateway, valid values are **200** and **1000**.\n\n>  The maximum bandwidth supported by VPN gateways in some regions is 500 Mbit/s. For more information, see [VPN gateway limits](~~65290~~).",
      "position": "Query",
      "type": "Integer",
      "required": true
    },
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request.\n\nYou can use the client to generate a value, and you must make sure that each request has a unique token value. The client token can contain only ASCII characters.\n\n>  If you do not specify this parameter, the system automatically uses the value of **RequestId** as the value of **ClientToken**. The value of **RequestId** for each API request is different.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DisasterRecoveryVSwitchId",
      "description": "The second vSwitch with which you want to associate the VPN gateway.\n\n*   If you call this operation in a region that supports the IPsec-VPN connections in dual-tunnel mode, this parameter is required.\n*   You need to specify two vSwitches in different zones in the virtual private cloud (VPC) that is associated with the VPN gateway to implement disaster recovery across zones.\n*   For a region that supports only one zone, disaster recovery across zones is not supported. We recommend that you specify two vSwitches in the zone to implement high availability. You can specify the same vSwitch.\n\nFor more information about the regions and zones that support the IPsec-VPN connections in dual-tunnel mode, see [IPsec-VPN connections support the dual-tunnel mode](~~2358946~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EnableIpsec",
      "description": "Specifies whether to enable IPsec-VPN for the VPN gateway. Valid values:\n\n*   **true** (default)\n*   **false**",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "EnableSsl",
      "description": "Specifies whether to enable SSL-VPN. Valid values:\n\n*   **true**\n*   **false** (default)",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "InstanceChargeType",
      "description": "The billing method of the VPN gateway. Set the value to **POSTPAY**, which specifies the pay-as-you-go billing method.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Name",
      "description": "The name of the VPN gateway. The default value is the ID of the VPN gateway.\n\nThe name must be 2 to 100 characters in length and cannot start with `http://` or `https://`. It must start with a letter and can contain letters, digits, underscores (\\_), hyphens (-), and periods (.). Other special characters are not supported.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "NetworkType",
      "description": "The network type of the VPN gateway. Valid values:\n\n*   **public** (default)\n*   **private**",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Period",
      "description": "The subscription duration. Unit: month. Valid values: **1** to **9**, **12**, **24**, and **36**.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the VPN gateway. You can call the [DescribeRegions](~~36063~~) operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ResourceGroupId",
      "description": "The ID of the resource group to which the VPN gateway belongs.\n\n*   You can call the [ListResourceGroups](~~158855~~) operation to query resource group IDs.\n\n*   If you do not specify a resource group ID, the VPN gateway belongs to the default resource group.\n\n*   After the VPN gateway is created, the following resources also belong to the resource group and you cannot change the resource group: SSL servers, SSL client certificates, IPsec servers, and IPsec-VPN connections.\n\n    If you move the VPN gateway to a new resource group, the preceding resources are also moved to the new resource group.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SslConnections",
      "description": "The maximum number of clients that can be connected at the same time. Valid values: **5** (default), **10**, **20**, **50**, **100**, **200**, **500**, and **1000**.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "VSwitchId",
      "description": "The vSwitch with which you want to associate the VPN gateway.\n\n*   If you call this operation in a region that supports the IPsec-VPN connections in dual-tunnel mode, this parameter is required. You must specify a vSwitch and specify **DisasterRecoveryVSwitchId**.\n*   If you call this operation in a region that supports the IPsec-VPN connections in single-tunnel mode and do not specify a vSwitch, the system automatically specifies a vSwitch.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "VpcId",
      "description": "The ID of the virtual private cloud (VPC) where you want to create the VPN gateway.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "VpnType",
      "description": "The type of the VPN gateway. Valid values:\n\nSet the value to **Normal** (default), which specifies a standard NAT gateway.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}