{
  "name": "CreateCustomerGateway",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Asn",
      "description": "The autonomous system number (ASN) of the gateway device in your data center. This parameter is required If you want to use Border Gateway Protocol (BGP) for the IPsec-VPN connection. Valid values: 1 to 4294967295. 45104 is not supported.\n\n**Asn** is a 4-byte number. You can enter it in two segments and separate the first 16 bits from the following 16 bits with a period (.). Enter the number in each segment in decimal format.\n\nFor example, if you enter 123.456, the ASN is 8061384. The ASN is calculated by using the following formula: 123 × 65536 + 456 = 8061384.\n\n> - We recommend that you use a private ASN to establish BGP connections to Alibaba Cloud. For information about the range of private ASNs, see the relevant documentation.\n> - 45104 is a unique identifier assigned by IANA to Alibaba Cloud. It is used to identify Alibaba Cloud during route selection and data transmission over the Internet.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "AuthKey",
      "description": "The authentication key of the BGP routing protocol for the gateway device in the data center.\n\nThe key must be 1 to 64 characters in length. It can contain only ASCII characters and cannot contain spaces or question marks (?).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request.\n\nYou can use the client to generate the token, but you must make sure that the token is unique among different requests. The token can contain only ASCII characters and cannot exceed 64 characters in length.\n\n> If you do not specify this parameter, the system automatically uses the **request ID** as the **client token**. The **request ID** may be different for each request.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Description",
      "description": "The description of the customer gateway.\n\nThe description must be 1 to 100 characters in length, and cannot start with `http://` or `https://`.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "IpAddress",
      "description": "The static IP address of the gateway device in the data center.\n\n*   If you want to create a public IPsec-VPN connection, enter a public IP address.\n*   If you want to create a private IPsec-VPN connection, enter a private IP address.\n\nYou cannot use the following IP addresses. Otherwise, a IPsec-VPN connection cannot be established:\n\n*   100.64.0.0~100.127.255.255\n*   127.0.0.0~127.255.255.255\n*   169.254.0.0~169.254.255.255\n*   224.0.0.0~239.255.255.255\n*   255.0.0.0~255.255.255.255",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Name",
      "description": "The name of the customer gateway.\n\nThe name must be 1 to 100 characters in length, and cannot start with `http://` or `https://`.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the customer gateway.\n\nYou can call the [DescribeRegions](~~36063~~) operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ResourceGroupId",
      "description": "The ID of the resource group to which the customer gateway belongs.\n\n- You can call the [ListResourceGroups](~~158855~~) operation to query the resource group list.\n\n- If you do not specify a resource group, the customer gateway will belong to the default resource group after being created.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Tags",
      "description": "The tag value.\n\nThe tag value can be an empty string and cannot exceed 128 characters in length. It cannot start with `aliyun` or `acs:`, and cannot contain `http://` or `https://`.\n\nEach tag key corresponds to one tag value. You can specify up to 20 tag values in each call.",
      "position": "Query",
      "type": "RepeatList",
      "required": false,
      "sub_parameters": [
        {
          "name": "Key",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "Value",
          "position": "Query",
          "type": "String",
          "required": false
        }
      ]
    }
  ]
}