{
  "name": "CreateVpnPbrRouteEntry",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request.\n\nYou can use the client to generate a token, but you must make sure that the token is unique among different requests. The client token can contain only ASCII characters.\n\n>  If you do not specify this parameter, the system automatically uses the request ID as the client token. The request ID is different for each request.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Description",
      "description": "The description of the policy-based route.\n\nThe description must be 1 to 100 characters in length, and cannot start with http:// or https://.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DryRun",
      "description": "",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "NextHop",
      "description": "The next hop of the policy-based route.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "OverlayMode",
      "description": "The tunneling protocol. Set the value to **Ipsec**.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Priority",
      "description": "The priority of the policy-based route. Valid values: **1** to **100**. Default value: **10**.\n\nA smaller value indicates a higher priority.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "PublishVpc",
      "description": "Specifies whether to advertise the policy-based route to a virtual private cloud (VPC) route table. Valid values:\n\n*   **true**\n*   **false**",
      "position": "Query",
      "type": "Boolean",
      "required": true
    },
    {
      "name": "RegionId",
      "description": "The region ID of the VPN gateway. You can call the [DescribeRegions](~~36063~~) operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "RouteDest",
      "description": "The destination CIDR block of the policy-based route.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "RouteSource",
      "description": "The source CIDR block of the policy-based route.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "VpnGatewayId",
      "description": "The VPN gateway ID.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Weight",
      "description": "The weight of the policy-based route.\n\nIf you use the same VPN gateway to establish active/standby IPsec-VPN connections, you can configure route weights to specify which connection is active. A value of 100 specifies the active connection, whereas a value of 0 specifies the standby connection.\n\nYou can configure health checks to automatically check the connectivity of IPsec-VPN connections. If the active connection is down, the standby connection automatically takes over. For more information, see [CreateVpnConnection](~~120391~~).\n\n*   **100**: The IPsec-VPN connection associated with the policy-based route serves as an active connection.\n*   **0**: The IPsec-VPN connection associated with the policy-based route serves as a standby connection.\n\n>  If you specify active/standby IPsec-VPN connections, the active policy-based route and the standby policy-based route must have the same source and destination CIDR blocks.",
      "position": "Query",
      "type": "Integer",
      "required": true
    }
  ]
}