{
  "name": "CreateForwardEntry",
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request.\n\nYou can use the client to generate the token, but you must make sure that the token is unique among different requests. The token can contain only ASCII characters.\n\n>  If you do not specify this parameter, the system automatically uses the **request ID** as the **client token**. The **request ID** may be different for each request.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ExternalIp",
      "description": "*   The EIP that can be accessed over the Internet when you configure a DNAT entry for an Internet NAT gateway.\n*   The NAT IP address that can be accessed by external networks when you configure a DNAT entry for a VPC NAT gateway.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ExternalPort",
      "description": "*   The external port range that is used for port forwarding when you configure a DNAT entry for an Internet NAT gateway.\n\n    *   Valid values: **1** to **65535**.\n    *   To specify a port range, separate the first port and the last port with a forward slash (/), for example, `10/20`.\n    *   If you set **ExternalPort** to a port range, you must also set **InternalPort** to a port range, and the number of ports specified by these parameters must be the same. For example, if you set **ExternalPort** to `10/20`, you can set **InternalPort** to `80/90`.\n\n*   The port that can be accessed by external networks when you configure a DNAT entry for a VPC NAT gateway. Valid values: **1** to **65535**.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ForwardEntryName",
      "description": "The name of the DNAT entry.\n\nThe name must be 2 to 128 characters in length. It must start with a letter but cannot start with `http://` or `https://`.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ForwardTableId",
      "description": "The ID of the DNAT table.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "InternalIp",
      "description": "*   The private IP address of the ECS instance that needs to communicate with the Internet when you configure a DNAT entry for an Internet NAT gateway. The private IP address must meet the following requirements:\n\n    *   It must belong to the CIDR block of the VPC where the NAT gateway is deployed.\n    *   The DNAT entry takes effect only if the private IP address is assigned to an ECS instance and the ECS instance is not associated with an EIP.\n\n*   The private IP address that uses DNAT when you add a DNAT entry to a VPC NAT gateway.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "InternalPort",
      "description": "*   The internal port or port range that is used for port forwarding when you configure a DNAT entry for an Internet NAT gateway. Valid values: **1** to **65535**.\n*   The port of the destination ECS instance to be mapped when you configure a DNAT entry for a VPC NAT gateway. Valid values: **1** to **65535**.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "IpProtocol",
      "description": "The protocol. Valid values:\n\n*   **TCP**\n*   **UDP**\n*   **Any** If you set **IpProtocol** to **Any**, you must also set **ExternalPort** and **InternalPort** to **Any** to implement DNAT IP mapping.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "PortBreak",
      "description": "Specifies whether to remove limits on the port range. Valid values:\n\n*   **true**\n*   **false** (default)\n\n>  If a DNAT entry and an SNAT entry have the same public IP address, ou must specify a port that is larger that 1024, and set **PortBreak** to **true**.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the NAT gateway.\n\nYou can call the [DescribeRegions](~~36063~~) operation to obtain the region ID.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}