{
  "name": "DeleteVpc",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request.\n\nYou can use the client to generate the token, but you must make sure that the token is unique among different requests. The token can contain only ASCII characters.\n\n>  If you do not specify this parameter, the system automatically uses the **RequestId** as the **ClientToken**. The **RequestId** may be different for each request.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DryRun",
      "description": "Specifies whether to perform a dry run. Valid values:\n\n- **true**: performs a dry run. The system checks the required parameters, request syntax, and limits. If the request fails the dry run, an error message is returned. If the request passes the dry run, the `DryRunOperation` error code is returned.\n- **false** (default): performs a dry run and sends the request. If the request passes the dry run, a 2xx HTTP status code is returned and the operation is performed.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "ForceDelete",
      "description": "Specifies whether to forcefully delete the VPC. Valid values:\n\n- **true**: yes\n- **false** (default): no\n\nYou can forcefully delete a VPC in the following scenarios:\n\n- Only an IPv4 gateway and routes that point to the IPv4 gateway exist in the VPC.\n- Only an IPv6 gateway and routes that point to the IPv6 gateway exist in the VPC.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The ID of the region where the VPC is deployed.\n\nYou can call the [DescribeRegions](~~36063~~) operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "VpcId",
      "description": "The ID of the VPC that you want to delete.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}