{
  "name": "ListNatIpCidrs",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request.\n\nYou can use the client to generate the value, but you must make sure that it is unique among different requests. The token can contain only ASCII characters and cannot exceed 64 characters in length.\n\n>  If you do not set this parameter, the system automatically uses **RequestId** as **ClientToken**. **RequestId** may be different for each API request.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DryRun",
      "description": "Specifies whether to only precheck this request. Valid values:\n\n*   **true**: checks the API request. The CIDR blocks of the NAT gateway are not queried if the API request passes the precheck. The system checks whether your AccessKey pair is valid, whether the Resource Access Management (RAM) user is authorized, and whether the required parameters are set. If the request fails to pass the precheck, the corresponding error message is returned. If the check succeeds, the DryRunOperation error code is returned.\n*   **false**: sends the API request. If the request passes the precheck, 2xx HTTP status code is returned and the CIDR blocks of the NAT gateway are queried. This is the default value.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "MaxResults",
      "description": "The number of entries to return on each page. Valid values: **1** to **100**. Default value: **20**.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "NatGatewayId",
      "description": "The ID of the VPC NAT gateway that you want to query.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "NatIpCidr",
      "description": "The CIDR block of the NAT gateway that you want to query.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "NatIpCidrName",
      "description": "The name of the CIDR block that you want to query. Valid values of **N**: **1** to **20**.",
      "position": "Query",
      "type": "RepeatList",
      "required": false
    },
    {
      "name": "NatIpCidrStatus",
      "description": "The status of the CIDR block that you want to query. Set the value to **Available**.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "NatIpCidrs",
      "description": "The CIDR block of the NAT gateway that you want to query. Valid values of **N**: **1** to **20**.",
      "position": "Query",
      "type": "RepeatList",
      "required": false
    },
    {
      "name": "NextToken",
      "description": "The token that is used for the next query. Set the value as needed.\n\n*   If this is your first query or no next query is to be sent, ignore this parameter.\n*   If a next query is to be sent, set the value to the value of NextToken that is returned from the last call.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the Virtual Private Cloud (VPC) NAT gateway that you want to query.\n\nYou can call the [DescribeRegions](~~36063~~) operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}