{
  "name": "ModifySnatEntry",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request.\n\nYou can use the client to generate the token, but you must make sure that the token is unique among different requests. The client token can contain only ASCII characters.\n\n>  If you do not specify this parameter, the system automatically uses the **request ID** as the **client token**. The **request ID** may be different for each request.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the NAT gateway.\n\nYou can call the [DescribeRegions](~~36063~~) operation to obtain the region ID.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "SnatEntryId",
      "description": "The ID of the SNAT entry that you want to modify.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "SnatEntryName",
      "description": "The name of the SNAT entry.\n\nThe name must be 2 to 128 characters in length. It must start with a letter but cannot start with `http://` or `https://`.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SnatIp",
      "description": "*   The elastic IP addresses (EIPs) specified in the SNAT entry when you modify an SNAT entry of an Internet NAT gateway. Separate EIPs with commas (,).\n\n    If you select multiple EIPs to create an SNAT address pool, connections are hashed to these EIPs. Network traffic may not be evenly distributed to the EIPs because the amount of traffic passes through each connection varies. We recommend that you associate these EIPs with the same EIP bandwidth plan to prevent service interruptions due to the bandwidth limit of an individual EIP.\n\n*   When you modify an SNAT entry of a VPC NAT gateway, this parameter specifies the NAT IP address in the SNAT entry.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SnatTableId",
      "description": "The ID of the SNAT table to which the SNAT entry belongs.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}