{
  "name": "ModifyForwardEntry",
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request.\n\nYou can use the client to generate the token, but you must make sure that the token is unique among different requests. The client token can contain only ASCII characters.\n\n>  If you do not specify this parameter, the system automatically uses the **request ID** as the **client token**. The **request ID** may be different for each request.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ExternalIp",
      "description": "*   When you modify DNAT entries of Internet NAT gateways, this parameter specifies the elastic IP addresses (EIPs) that are used to access the Internet.\n*   When you modify DNAT entries of Virtual Private Cloud (VPC) NAT gateways, this parameter specifies the NAT IP addresses that are accessed by external networks.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ExternalPort",
      "description": "*   The external port that is used to forward traffic when you modify DNAT entries of Internet NAT gateways.\n\n    *   Valid values: **1** to **65535**.\n    *   If you want to modify the port range, separate port numbers with a forward slash (/), such as `10/20`.\n    *   If you need to modify **ExternalPort** and **InternalPort** at the same time, and **ExternalPort** specifies a port range, make sure that **InternalPort** also specifies a port range, and both ranges specify the same number of ports. For example, you can set **ExternalPort** to `10/20` and **InternalPort** to `80/90`.\n\n*   The port that is accessed by external networks when you modify DNAT entries of VPC NAT gateways. Valid values: **1** to **65535**.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ForwardEntryId",
      "description": "The ID of the DNAT entry.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ForwardEntryName",
      "description": "The new name of the DNAT entry.\n\nThe name must be 2 to 128 characters in length. It must start with a letter but cannot start with `http://` or `https://`.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ForwardTableId",
      "description": "The ID of the DNAT table to which the DNAT entry belongs.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "InternalIp",
      "description": "*   The private IP address of the ECS instance that uses DNAT entries to communicate with the Internet when you modify DNAT entries of Internet NAT gateways.\n*   The private IP address that uses DNAT entries to communicate when you modify DNAT entries of VPC NAT gateways.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "InternalPort",
      "description": "*   The internal port or port range that is used to forward traffic when you modify DNAT entries of Internet NAT gateways. Valid values: **1** to **65535**.\n*   The port of the destination ECS instance to be mapped when you modify DNAT entries of VPC NAT gateways. Valid values: **1** to **65535**.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "IpProtocol",
      "description": "The protocol. Valid values:\n\n*   **TCP**\n*   **UDP**\n*   **Any**",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "PortBreak",
      "description": "Specifies whether to remove limits on the port range. Valid values:\n\n*   **true**\n*   **false** If an SNAT entry and a DNAT entry use the same public IP address, and you want to specify a port number greater than `1024`, set `PortBreak` to `true`.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the NAT gateway.\n\nYou can call the [DescribeRegions](~~36063~~) operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}