{
  "name": "CreateCloudMigrationTask",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "DBInstanceName",
      "description": "The ID of the destination instance. You can call the DescribeDBInstances operation to query the instance ID.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "SourceAccount",
      "description": "The username of the account that is used to connect to the self-managed PostgreSQL instance. Enter the username of the account that you created in the [Create an account for cloud migration on a self-managed PostgreSQL instance](~~369500~~) topic.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "SourceCategory",
      "description": "The environment in which the self-managed PostgreSQL instance runs.\n\n*   **idcOnVpc**: The self-managed PostgreSQL instance resides in a data center. The data center can communicate with the VPC to which the ApsaraDB RDS for PostgreSQL instance belongs.\n*   **ecsOnVpc**: The self-managed PostgreSQL instance resides on an ECS instance.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "SourceIpAddress",
      "description": "The private or public IP address that is used to connect to the self-managed PostgreSQL instance.\n\n*   If the self-managed PostgreSQL instance resides on an Elastic Compute Service (ECS) instance, enter the private IP address of the ECS instance. For more information about how to obtain the private IP address of an ECS instance, see [View IP addresses](~~273914~~).\n*   If the self-managed PostgreSQL instance resides in a data center, enter the private IP address of the data center.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "SourcePassword",
      "description": "The password of the account that is used to connect to the self-managed PostgreSQL instance. Enter the password of the account that you created in the [Create an account for cloud migration on a self-managed PostgreSQL instance](~~369500~~) topic.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "SourcePort",
      "description": "The port number that is used to connect to the self-managed PostgreSQL instance. You can run the `netstat -a | grep PGSQL` command to obtain the port number.",
      "position": "Query",
      "type": "Long",
      "required": true
    },
    {
      "name": "TaskName",
      "description": "The name of the task. If you do not specify this parameter, ApsaraDB RDS automatically generates a name for the cloud migration task.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}