{
  "name": "DescribeSlowLogs",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "DBInstanceId",
      "description": "The instance ID. You can call the DescribeDBInstances operation to query the instance ID.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "DBName",
      "description": "The name of the database.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EndTime",
      "description": "The end of the time range to query. The end time must be later than the start time. The time span between the start time and the end time cannot exceed 31 days. Specify the time in the ISO 8601 standard in the *yyyy-MM-dd*Z format. The time must be in UTC.\n\n>  If the end date of the query is the same as the start date of the query, you can query the logs that are generated at 08:00 on the start date of the query. You can query the slow logs within a maximum time range of 24 hours.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "PageNumber",
      "description": "The page number. Pages start from 1.\n\nDefault value: **1**.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "PageSize",
      "description": "The number of entries per page. Valid values: **30** to **100**. Default value: **30**.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "SortKey",
      "description": "The dimension based on which the system sorts the entries to return. Valid values:\n\n*   **TotalExecutionCounts**: The system sorts the entries to return based on the number of times that SQL statements are executed.\n*   **TotalQueryTimes**: The system sorts the entries to return based on the total execution duration.\n*   **TotalLogicalReads**: The system sorts the entries to return based on the total number of logical reads.\n*   **TotalPhysicalReads**: The system sorts the entries to return based on the total number of physical reads.\n\n> This parameter is supported only for instances that run SQL Server 2008 R2.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "StartTime",
      "description": "The beginning of the time range to query. Specify the time in the ISO 8601 standard in the *yyyy-MM-dd*Z format. The time must be in UTC.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}