{
  "name": "DescribeHistoryTasks",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "FromExecTime",
      "description": "The minimum execution duration of the task. This parameter is used to filter tasks whose execution duration is longer than the minimum execution duration. Unit: seconds. The default value is 0, which indicates that no limit is imposed.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "FromStartTime",
      "description": "The beginning of the time range to query. Only tasks that have a start time later than or equal to the time specified by this parameter are queried. Specify the time in the ISO 8601 standard in the yyyy-MM-ddTHH:mm:ssZ format. The time must be in UTC. The start time can be up to 30 days earlier than the current time. If you set this parameter to a time more than 30 days earlier than the current time, the specified time is automatically converted to a time that is exactly 30 days earlier than the current time.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "InstanceId",
      "description": "The instance ID. Separate multiple instance IDs with commas (,). You can specify up to 30 instance IDs. This parameter is empty by default, which indicates that you can specify an unlimited number of instance IDs.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "InstanceType",
      "description": "Only Instance is supported.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "PageNumber",
      "description": "The page number. Pages start from page 1. Default value: **1**.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "PageSize",
      "description": "The number of entries per page. Valid values: **10 to 100**. Default value: **10**.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the pending event. You can call the DescribeRegions operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ResourceGroupId",
      "description": "The ID of the resource group.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Status",
      "description": "The task status. Valid values:\n\n*   **Scheduled**\n*   **Running**\n*   **Succeed**\n*   **Failed**\n*   **Cancelling**\n*   **Canceled**\n*   **Waiting**\n\nSeparate multiple values with commas (,). By default, this parameter is left empty, which indicates that tasks in all statuses are queried.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TaskId",
      "description": "The task ID. You can call the DescribeTasks operation to query the task ID. If multiple task IDs exist, separate them with commas (,). You can specify up to 30 task IDs. By default, this parameter is left empty, which indicates that all tasks are queried.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TaskType",
      "description": "The task type. Separate multiple task types with commas (,). You can specify up to 30 task types. This parameter is empty by default, which indicates that you can specify an unlimited number of task types.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ToExecTime",
      "description": "The maximum execution duration of a task. This parameter is used to filter tasks whose execution duration is shorter than or equal to the maximum execution duration. Unit: seconds. The default value is 0, which indicates that no limit is imposed.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "ToStartTime",
      "description": "The end of the time range to query. Only tasks that have a start time earlier than or equal to the time specified by this parameter are queried. Specify the time in the ISO 8601 standard in the yyyy-MM-ddTHH:mm:ssZ format. The time must be in UTC.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}