{
  "name": "DescribeHistoryEvents",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ArchiveStatus",
      "description": "The resource status. Valid values: **importing**, failed, checksuccess, and deleted.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EventCategory",
      "description": "The system event category. For more information, see [View the event history of an ApsaraDB RDS instance](~~129759~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EventId",
      "description": "The event ID.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EventLevel",
      "description": "The event level. Valid values: ***high***, **medium**, and **low**.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EventStatus",
      "description": "The status of the exception. Valid values:\n\n*   1: pending\n*   2: ignored\n*   4: confirmed\n*   8: marked as false positive\n*   16: handling\n*   32: handled\n*   64: expired",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EventType",
      "description": "The system event type. This parameter takes effect only when InstanceEventType.N is not specified. Valid values: SystemMaintenance.Reboot: The instance is restarted due to system maintenance. SystemMaintenance.Redeploy: The instance is redeployed due to system maintenance. SystemFailure.Reboot: The instance is restarted due to a system error. SystemFailure.Redeploy: The instance is redeployed due to a system error. SystemFailure.Delete: The instance is released due to an instance creation failure. InstanceFailure.Reboot: The instance is restarted due to an instance error. InstanceExpiration.Stop: The subscription instance is stopped due to expiration. InstanceExpiration.Delete: The subscription instance is released due to expiration. AccountUnbalanced.Stop: The pay-as-you-go instance is stopped due to an overdue payment. AccountUnbalanced.Delete: The pay-as-you-go instance is released due to an overdue payment. For more information, see Overview. The values of this parameter are applicable only to instance system events, but not to disk system events.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "FromStartTime",
      "description": "The beginning of the time range to query. Only tasks that have a start time later than or equal to the time specified by this parameter are queried. Specify the time in the ISO 8601 standard in the yyyy-MM-ddTHH:mm:ssZ format. The time must be in UTC. The start time can be up to 30 days earlier than the current time. If you set this parameter to a time more than 30 days earlier than the current time, this time is automatically converted to a time that is exactly 30 days earlier than the current time.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "InstanceId",
      "description": "The instance ID.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "PageNumber",
      "description": "The page number. Valid values: any non-zero positive integer. Default value: **1**.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "PageSize",
      "description": "The number of entries per page. Default value: 30.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID. You can call the [DescribeRegions](~~610399~~) operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ResourceGroupId",
      "description": "The resource group ID.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ResourceType",
      "description": "The resource type. Set the value to **INSTANCE**.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SecurityToken",
      "description": "",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TaskId",
      "description": "The task ID. This value is used to query the data of a specific task.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ToStartTime",
      "description": "The end of the time range to query. Only tasks that have a start time earlier than or equal to the time specified by this parameter are queried. Specify the time in the ISO 8601 standard in the yyyy-MM-ddTHH:mm:ssZ format. The time must be in UTC.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}