{
  "name": "ImportUserBackupFile",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "BackupFile",
      "description": "A JSON array that consists of the information about the full backup file stored as an object in an OSS bucket. Example: `{\"Bucket\":\"test\", \"Object\":\"test/test_db_employees.xb\",\"Location\":\"ap-southeast-1\"}`\n\nThe JSON array contains the following fields:\n\n*   **Bucket**: The name of the OSS bucket in which the full backup file is stored as an object. You can call the [GetBucket](~~31965~~) operation to query the name of the bucket.\n*   **Object**: The path of the full backup file that is stored as an object in the OSS bucket. You can call the [GetObject](~~31980~~) operation to query the path of the object.\n*   **Location**: The ID of the region in which the OSS bucket is located. You can call the [GetBucketLocation](~~31967~~) operation to query the region of the bucket.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "BucketRegion",
      "description": "The region ID of the OSS bucket where the full backup file of the self-managed MySQL database is located. You can call the DescribeRegions operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Comment",
      "description": "The description of the full backup file.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EngineVersion",
      "description": "The version of the database engine that is run on the self-managed MySQL database and ApsaraDB RDS for MySQL instance. Set the value to **5.7**.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the instance. You can call the DescribeRegions operation to query the most recent region list.\n\n> *   The value of this parameter is the ID of the region in which you want to create the instance.\n> *   The value of this parameter must be consistent with the value of **BucketRegion**.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ResourceGroupId",
      "description": "The resource group ID. You can call the DescribeDBInstanceAttribute operation to query the resource group ID.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RestoreSize",
      "description": "The amount of storage that is required to restore the data of the full backup file. Unit: GB.\n\n> *   The default value of this parameter is 5 times the size of the full backup file.\n> *   The minimum value of this parameter is 20.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "Retention",
      "description": "The retention period of the full backup file. Unit: days. Valid values: any **non-zero** positive integer.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "ZoneId",
      "description": "The zone ID. You can call the DescribeRegions operation to query the zone ID.\n\n> *   If you specify this parameter, the system creates a snapshot in single-digit seconds, which greatly reduces the time that is required to import the full backup file.\n> *   When you call the CreateDBInstance operation to create an instance by using the full backup file, the instance is created in the zone that you specify for this parameter.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}