{
  "name": "ModifyParameterGroup",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ModifyMode",
      "description": "The modification mode of the parameter template. Valid values:\n\n*   **Collectivity** (default): adds new parameters or modifies parameters in the original parameter template.\n\n>  If you set the ModifyMode parameter to Collectivity, the system adds the value of the **Parameters** parameter to the original parameter template or modifies the corresponding parameters in the original parameter template. Other parameters in the original parameter template are not affected.\n\n*   **Individual**: overwrites original parameters.\n\n>  If you set the ModifyMode parameter to Individual, the system uses the value of the **Parameters** parameter to overwrite the parameter settings in the original parameter template.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ParameterGroupDesc",
      "description": "The new description of the parameter template. The description can be up to 200 characters in length.\n\n> If you do not specify this parameter, the original description of the parameter template is retained.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ParameterGroupId",
      "description": "The parameter template ID. You can call the DescribeParameterGroups operation to query the parameter template ID.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ParameterGroupName",
      "description": "The parameter template name.\n\n*   The name can contain letters, digits, periods (.), and underscores (\\_). It must start with a letter.\n*   It can be 8 to 64 characters in length.\n\n> If you do not specify this parameter, the original name of the parameter template is retained.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Parameters",
      "description": "A JSON string that consists of parameters and their values in the parameter template. Format: {\"Parameter 1\":\"Value of Parameter 1\",\"Parameter 2\":\"Value of Parameter 2\"...}. For more information about the parameters that can be modified, see [Modify the parameters of an ApsaraDB RDS for MySQL instance](~~96063~~) or [Modify the parameters of an ApsaraDB RDS for PostgreSQL instance](~~96751~~).\n\n> *   If **ModifyMode** is set to **Individual** and this parameter is specified, the new parameters overwrite the parameters in the original parameter template.\n> *   If you set **ModifyMode** to **Collectivity** and specify this parameter, the new parameters are added to the original parameter template, or the parameters in the original parameter template are modified.\n> *   If you do not specify this parameter, the parameters in the original parameter template remain unchanged.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID. You can call the DescribeRegions operation to query the most recent region list.\n\n>  The region of a parameter template cannot be changed. You can call the CloneParameterGroup operation to replicate a parameter template to a specific region.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ResourceGroupId",
      "description": "The resource group ID. You can call the DescribeDBInstanceAttribute operation to query the resource group ID.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}