{
  "name": "ModifyParameter",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request. You can use the client to generate the token, but you must make sure that the token is unique among different requests. The token can contain only ASCII characters and cannot exceed 64 characters in length.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DBInstanceId",
      "description": "The instance ID.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Forcerestart",
      "description": "Specifies whether to restart the instance for a new parameter value to take effect. Valid values:\n\n*   **true**: The system forcefully restarts the instance. If a new parameter value takes effect only after the instance restarts, you must set this parameter to true. Otherwise, the new parameter value cannot take effect.\n*   **false**: The system does not forcefully restart the instance.\n\nDefault value: **false**.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "ParameterGroupId",
      "description": "The parameter template ID.\n\n> \n\n*   If you specify this parameter, you do not need to specify **Parameters**.\n\n*   If the parameter template can be applied only after the instance is restarted, you must specify **Forcerestart**.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Parameters",
      "description": "The JSON strings of parameters and their values. All the parameter values are of the string type. Format: {\"Parameter name 1\":\"Parameter value 1\",\"Parameter name 2\":\"Parameter value 2\"...}. You can call the DescribeParameterTemplates operation to query parameter names and values.\n\n>  If you specify this parameter, you do not need to specify **ParameterGroupId**.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SwitchTime",
      "description": "The time at which the modification takes effect. Specify the time in the ISO 8601 standard in the *yyyy-MM-dd*T*HH:mm:ss*Z format. The time must be in UTC.\n\n> This time must be later than the time at which you call this operation.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SwitchTimeMode",
      "description": "The time at which the modification takes effect. Valid values:\n\n*   **Immediately**: immediately modifies the parameter. This is the default value.\n*   **MaintainTime**: modifies the parameter during the maintenance window of the instance. You can call the ModifyDBInstanceMaintainTime operation to change the maintenance window.\n*   **ScheduleTime**: modifies the parameter at the point in time that you specify. If you specify this value, you must also specify **SwitchTime**.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}