{
  "name": "ModifySecurityIps",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "DBInstanceIPArrayAttribute",
      "description": "The attribute of the IP address whitelist. By default, this parameter is empty.\n\n> The IP address whitelists that have the hidden attribute are not displayed in the ApsaraDB RDS console. These IP address whitelists are used to access Alibaba Cloud services, such as Data Transmission Service (DTS).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DBInstanceIPArrayName",
      "description": "The name of the IP address whitelist that you want to modify. Default value: **Default**.\n\n> A maximum of 200 IP address whitelists can be configured for each instance.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DBInstanceId",
      "description": "The instance ID. You can call the DescribeDBInstances operation to query the instance ID.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "FreshWhiteListReadins",
      "description": "The read-only instances to which you want to synchronize the IP address whitelist.\n\n*   This parameter applies only to ApsaraDB RDS for PostgreSQL instances.\n*   If the instance is attached with a read-only instance, you can use this parameter to synchronize the IP address whitelist to the read-only instance. If the instance is attached with multiple read-only instances, separate the read-only instances with commas (,).\n*   If the instance is not attached with a read-only instance, leave this parameter empty.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ModifyMode",
      "description": "The method that is used to modify the whitelist. Valid values:\n\n*   **Cover**: Use the IP addresses and CIDR blocks that are specified in the **SecurityIps** parameter to overwrite the existing IP addresses and CIDR blocks in the IP address whitelist.\n*   **Append**: Add the IP addresses and CIDR blocks that are specified in the **SecurityIps** parameter to the IP address whitelist.\n*   **Delete**: Delete the IP addresses and CIDR blocks that are specified in the **SecurityIps** parameter from the IP address whitelist. You must retain at least one IP address or CIDR block.\n\nDefault value: **Cover**.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SecurityIPType",
      "description": "The IP address type. The value is fixed as IPv4.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SecurityIps",
      "description": "The IP addresses in an IP address whitelist. Separate multiple IP addresses with commas (,). Each IP address in the IP address whitelist must be unique. The entries in the IP address whitelist must be in one of the following formats:\n\n*   IP addresses, such as 10.23.XX.XX.\n*   CIDR blocks, such as 10.23.XX.XX/24. In this example, 24 indicates that the prefix of each IP address in the IP address whitelist is 24 bits in length. You can replace 24 with a value within the range of 1 to 32.\n\n> A maximum of 1,000 IP addresses or CIDR blocks can be added for each instance. If you want to add a large number of IP addresses, we recommend that you merge them into CIDR blocks, such as 10.23.XX.XX/24.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "WhitelistNetworkType",
      "description": "The network type of the IP address whitelist. Valid values:\n\n*   **Classic**: classic network in enhanced whitelist mode\n*   **VPC**: virtual private cloud (VPC) network type in enhanced whitelist mode.\n*   **MIX**: standard whitelist mode\n\nDefault value: **MIX**.\n\n> \n\n*   In standard whitelist mode, IP addresses and CIDR blocks are added only to the default IP address whitelist. In enhanced whitelist mode, IP addresses and CIDR blocks are added to the IP address whitelists of the classic network type and the VPC network type.\n\n*   If your RDS instance runs PostgreSQL and uses cloud disks, set this parameter to MIX. If you set it to another value, the system automatically changes the value to MIX.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}