{
  "name": "ModifyDBInstanceSSL",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ACL",
      "description": "The method that is used to verify the identities of clients. This parameter is supported only when the instance runs PostgreSQL with cloud disks. In addition, this parameter is available only when the public key of the CA that issues client certificates is enabled. Valid values:\n\n*   **cert**\n*   **perfer**\n*   **verify-ca**\n*   **verify-full** (supported only when the instance runs PostgreSQL 12 or later)",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "CAType",
      "description": "The type of the server certificate. This parameter is supported only when the instance runs PostgreSQL with cloud disks. If you set SSLEnabled to **1**, the default value of this parameter is **aliyun**. Valid values:\n\n*   **aliyun**: a cloud certificate\n*   **custom**: a custom certificate",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ClientCACert",
      "description": "The public key of the CA that issues client certificates. This parameter is supported only when the instance runs PostgreSQL with cloud disks. This parameter must be specified when ClientCAEbabled is set to **1**.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ClientCAEnabled",
      "description": "Specifies whether to enable the public key of the CA that issues client certificates. This parameter is supported only when the instance runs PostgreSQL with cloud disks. Valid values:\n\n*   **1**: enables the public key.\n*   **0**: disables the public key.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "ClientCertRevocationList",
      "description": "The CRL that contains revoked client certificates. This parameter is supported only when the instance runs PostgreSQL with cloud disks. This parameter must be specified when ClientCrlEnabled is set to **1**.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ClientCrlEnabled",
      "description": "Specifies whether to enable a certificate revocation list (CRL) that contains revoked client certificates. This parameter is supported only when the instance runs PostgreSQL with cloud disks. In addition, this parameter is available only when the public key of the CA that issues client certificates is enabled. Valid values:\n\n*   **1**: enables the CRL.\n*   **0**: disables the CRL.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "ConnectionString",
      "description": "The internal or public endpoint for which the server certificate needs to be created or updated.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "DBInstanceId",
      "description": "The instance ID. You can call the DescribeDBInstances operation to query the instance ID.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ForceEncryption",
      "description": "",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ReplicationACL",
      "description": "The method that is used to verify the replication permission. This parameter is supported only when the instance runs PostgreSQL with cloud disks. In addition, this parameter is available only when the public key of the CA that issues client certificates is enabled. Valid values:\n\n*   **cert**\n*   **perfer**\n*   **verify-ca**\n*   **verify-full** (supported only when the instance runs PostgreSQL 12 or later)",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SSLEnabled",
      "description": "Specifies whether to enable or disable the SSL encryption feature. Valid values:\n\n*   **1**: enables the feature.\n*   **0**: disables the feature.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "ServerCert",
      "description": "The content of the server certificate. This parameter is supported only when the instance runs PostgreSQL with cloud disks. This parameter must be specified when CAType is set to **custom**.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ServerKey",
      "description": "The private key of the server certificate. This parameter is supported only when the instance runs PostgreSQL with cloud disks. This parameter must be specified when CAType is set to **custom**.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TlsVersion",
      "description": "",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}