{
  "name": "ModifyDBNode",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AutoPay",
      "description": "Specifies whether to automatically complete the payment. Valid values:\n\n1.  **true**: automatically completes the payment. Make sure that your account balance is sufficient.\n2.  **false**: does not automatically complete the payment. An unpaid order is generated.\n\n>  The default value is true. If your account balance is insufficient, you can set the AutoPay parameter to false to generate an unpaid order. Then, you can log on to the ApsaraDB RDS console to pay for the order.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DBInstanceId",
      "description": "The instance ID.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "DBInstanceStorage",
      "description": "The new storage capacity of the instance. Unit: GB For more information, see [Instance types](~~26312~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DBInstanceStorageType",
      "description": "The storage type of the instance. Valid values:\n\n*   **cloud_essd**: performance level 1 (PL1) enhanced SSD (ESSD)\n*   **cloud_essd2**: PL2 ESSD\n*   **cloud_essd3**: PL3 ESSD",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DBNode",
      "description": "The information about the node.\n\n>  This parameter is used for ApsaraDB RDS for MySQL instances that run RDS Cluster Edition.",
      "position": "Query",
      "type": "Json",
      "required": false,
      "sub_parameters": [
        {
          "name": "classCode",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "nodeId",
          "position": "Query",
          "type": "String",
          "required": false
        }
      ]
    },
    {
      "name": "DryRun",
      "description": "Specifies whether to perform a dry run. Valid values: Valid values:\n\n*   **true**: performs a dry run and does not perform the actual request. The system checks items such as the request parameters, request format, service limits, and available resources.\n*   **false** (default): performs a dry run and performs the actual request. If the request passes the dry run, the operation is performed.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "EffectiveTime",
      "description": "The time when you want the change to take effect. Valid values:\n\n*   **Immediate** (default): The change immediately takes effect.\n*   **MaintainTime**: The effective time is within the maintenance window. For more information, see ModifyDBInstanceMaintainTime.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ProduceAsync",
      "description": "Specifies whether to asynchronously perform the operation. Valid values:\n\n*   **true** (default): sends only the order. The operation is asynchronously performed.\n*   **false**: sends the request. After the request passes the check, the operation is directly performed.\n\n>  The default value is true, which indicates that the change operation is asynchronously performed. If you set this parameter to false, the change operation is simultaneously performed. This prolongs the response time of the operation.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    }
  ]
}