{
  "name": "ModifyDasInstanceConfig",
  "deprecated": false,
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request. You can use the client to generate the token, but you must make sure that the generated token is unique among different requests. The token can contain only ASCII characters and cannot exceed 64 characters in length.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DBInstanceId",
      "description": "The instance ID. You can call the DescribeDBInstances operation to query the instance ID.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "StorageAutoScale",
      "description": "Specifies whether to enable automatic storage expansion. Valid values:\n\n*   **Enable**\n*   **Disable**",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "StorageThreshold",
      "description": "The threshold in percentage based on which an automatic storage expansion is triggered. If the available storage reaches the threshold, ApsaraDB RDS increases the storage capacity of the instance. Valid values:\n\n*   **10**\n*   **20**\n*   **30**\n*   **40**\n*   **50**\n\n>  If you set the StorageAutoScale parameter to **Enable**, you must specify this parameter.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "StorageUpperBound",
      "description": "The maximum storage capacity that is allowed for an automatic storage expansion. The value of this parameter must be greater than or equal to the current storage capacity of the RDS instance.\n\n*   If the RDS instance uses ESSDs, the maximum value of this parameter can be set to 32000 GB.\n*   If the RDS instance uses standard SSDs, the maximum value of this parameter can be set to 6000 GB.\n\n>  If you set the **StorageAutoScale** parameter to **Enable**, you must specify this parameter.",
      "position": "Query",
      "type": "Integer",
      "required": false
    }
  ]
}