{
  "name": "ModifyRCInstance",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AutoPay",
      "description": "Specifies whether to enable the automatic payment feature. Valid values:\n\n*   **true** (default): enables the feature. You must make sure that your account balance is sufficient.\n*   **false**: disables the feature. An unpaid order is generated.\n\n>  If your account balance is insufficient, you can set AutoPay to false. In this case, an unpaid order is generated. You can complete the payment in the Expenses and Costs console.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "AutoUseCoupon",
      "description": "",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "Direction",
      "description": "The type of the change that you want to perform on the instance. Valid values:\n\n>  This parameter is optional. The system can automatically determine whether the instance change is an upgrade or a downgrade. If you want to specify this parameter, take note of the following items:\n\n*   **Upgrade** (default): upgrades the instance type. Make sure that your account balance is sufficient.\n*   **Down**: downgrades the instance type. If the new instance type specified by InstanceType has lower specifications than the current instance type, set Direction to Down.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DryRun",
      "description": "Specifies whether to perform only a dry run, without performing the actual request. Valid values:\n\n*   **true**: performs only a dry run. The system checks the request for potential issues, including missing parameter values, incorrect request syntax, service limits, and resource inventory.\n*   **false**: performs a dry run and performs the actual request. If the request passes the dry run, the operation is performed.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "InstanceId",
      "description": "The instance ID.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "InstanceType",
      "description": "The new instance type. For more information about the instance types that are supported by RDS Custom instances, see [Instance types of RDS Custom instances](~~2844823~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "PromotionCode",
      "description": "",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RebootTime",
      "description": "",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RebootWhenFinished",
      "description": "",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the instance.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}