{
  "name": "RemoveTagsFromResource",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request. You can use the client to generate the token, but you must make sure that the token is unique among different requests. The token can contain only ASCII characters and cannot exceed 64 characters in length.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DBInstanceId",
      "description": "The instance ID.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "RegionId",
      "description": "The region ID. You can call the DescribeRegions operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ResourceGroupId",
      "description": "The resource group ID. You can call the ListResourceGroups operation to query the resource group ID.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Tag.1.key",
      "description": "The TagKey of the first tag that you want to unbind. Each tag consists of a TagKey and a TagValue. You can specify up to five tags in a single request. You cannot specify an empty string as the tag key. You can specify an empty string as the tag value.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Tag.1.value",
      "description": "The TagValue of the first tag that you want to unbind. Each tag consists of a TagKey and a TagValue. You can specify up to five tags in a single request. You cannot specify an empty string as the tag key. You can specify an empty string as the tag value.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Tag.2.key",
      "description": "The TagKey of the second tag that you want to unbind. Each tag consists of a TagKey and a TagValue. You can specify up to five tags in a single request. You cannot specify an empty string as the tag key. You can specify an empty string as the tag value.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Tag.2.value",
      "description": "The TagValue of the second tag that you want to unbind. Each tag consists of a TagKey and a TagValue. You can specify up to five tags in a single request. You cannot specify an empty string as the tag key. You can specify an empty string as the tag value.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Tag.3.key",
      "description": "The TagKey of the third tag that you want to unbind. Each tag consists of a TagKey and a TagValue. You can specify up to five tags in a single request. You cannot specify an empty string as the tag key. You can specify an empty string as the tag value.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Tag.3.value",
      "description": "The TagValue of the third tag that you want to unbind. Each tag consists of a TagKey and a TagValue. You can specify up to five tags in a single request. You cannot specify an empty string as the tag key. You can specify an empty string as the tag value.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Tag.4.key",
      "description": "The TagKey of the fourth tag that you want to unbind. Each tag consists of a TagKey and a TagValue. You can specify up to five tags in a single request. You cannot specify an empty string as the tag key. You can specify an empty string as the tag value.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Tag.4.value",
      "description": "The TagValue of the fourth tag that you want to unbind. Each tag consists of a TagKey and a TagValue. You can specify up to five tags in a single request. You cannot specify an empty string as the tag key. You can specify an empty string as the tag value.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Tag.5.key",
      "description": "The TagKey of the fifth tag that you want to unbind. Each tag consists of a TagKey and a TagValue. You can specify up to five tags in a single request. You cannot specify an empty string as the tag key. You can specify an empty string as the tag value.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Tag.5.value",
      "description": "The TagValue of the fifth tag that you want to unbind. Each tag consists of a TagKey and a TagValue. You can specify up to five tags in a single request. You cannot specify an empty string as the tag key. You can specify an empty string as the tag value.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Tags",
      "description": "A set of a TagKey and a TagValue that you use to unbind the tag. Format: {\"key1\":\"value1\"}.\n\n>  You cannot specify an empty string for TagKey. You can specify an empty string for TagValue.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "proxyId",
      "description": "The ID of the proxy mode.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}