{
  "name": "ResizeRCInstanceDisk",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AutoPay",
      "description": "Specifies whether to enable the automatic payment feature for the instance. Valid values:\n\n*   **true** (default): enables the feature. Make sure that your account balance is sufficient.\n*   **false**: disables the feature. An unpaid order is generated.\n\n>  If your account balance is insufficient, you can set AutoPay to false. In this case, an unpaid order is generated. You can complete the payment in the Expenses and Costs console.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "DiskId",
      "description": "",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DryRun",
      "description": "Specifies whether to perform only a dry run, without performing the actual request. Valid values:\n\n*   **true**: performs only a dry run. The system checks the request for potential issues, including missing parameter values, incorrect request syntax, service limits, and insufficient inventory errors.\n*   **false**: performs a dry run and performs the actual request. If the request passes the dry run, the instance is created.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "InstanceId",
      "description": "The instance ID.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "NewSize",
      "description": "The new disk size. Unit: GiB.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the instance.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Type",
      "description": "The method that you want to use to resize the disk. Valid values:\n\n*   **offline** (default): resizes disks offline. After you resize a disk offline, you must restart the instance for the resizing operation to take effect.\n*   **online**: resizes disks online. After you resize a disk online, the resizing operation takes effect immediately and you do not need to restart the instance.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}