{
  "name": "ExecuteMultiAccountSQLQuery",
  "deprecated": false,
  "protocol": "HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Expression",
      "description": "The SQL statement to be executed.\n\nThe number of characters in the SQL statement must be less than 2,000.\n\nFor more information about the SQL syntax, see [Basic SQL syntax](~~2539395~~).",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "MaxResults",
      "description": "The maximum number of entries to return on each page.\n\nValid values: 1 to 1000.\n\nDefault value: 1000.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "NextToken",
      "description": "The pagination token that is used in the next request to retrieve a new page of results. You do not need to specify this parameter for the first request. You must specify the token that is obtained from the previous query as the value of NextToken.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Scope",
      "description": "The search scope. The value of this parameter can be one of the following items:\n\n*   ID of a resource directory: Resources within the management account and all members of the resource directory are searched.\n*   ID of the Root folder: Resources within all members in the Root folder and the subfolders of the Root folder are searched.\n*   ID of a folder: Resources within all members in the folder are searched.\n*   ID of a member: Resources within the member are searched.\n*   ID of a member/ID of a Resource group: Resources within the member in the resource group are searched.\n\nFor more information about how to obtain the ID of a resource directory, the Root folder, a folder, a member, or a resource group, see [GetResourceDirectory](~~159995~~), [ListFoldersForParent](~~159997~~), [ListFoldersForParent](~~159997~~), [ListAccounts](~~160016~~), or [ListResourceGroups](~~158855~~).",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}