{
  "name": "DescribeExposedInstanceList",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "CurrentPage",
      "description": "The number of the page to return.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "ExposureComponent",
      "description": "The server component that is exposed on the Internet.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ExposureIp",
      "description": "The public IP address of the server.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ExposurePort",
      "description": "The port that is exposed on the Internet.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "GroupId",
      "description": "The ID of the server group.\n\n> You can call the [DescribeAllGroups](~~DescribeAllGroups~~) operation to query the IDs of server groups.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "HealthStatus",
      "description": "The health status of the Elastic Compute Service (ECS) instance in the scaling group. ECS instances that are not in the Running state are considered unhealthy. Valid values:\n\n*   Healthy\n*   Unhealthy\n\nAuto Scaling automatically removes unhealthy ECS instances from the scaling group and then releases the automatically created instances among the unhealthy instances.\n\nUnhealthy ECS instances that are manually added to the scaling group are released based on the management mode of the instance lifecycle. If the lifecycle of the ECS instances is not managed by the scaling group, Auto Scaling removes the instances from the scaling group but does not release them. If the lifecycle of the ECS instances is managed by the scaling group, Auto Scaling removes the instances from the scaling group and releases them.\n\n>  Make sure that you have sufficient balance within your account. If you have overdue payments in your account, pay-as-you-go and preemptible instances are stopped or released. For information about how the status of ECS instances changes when you have overdue payments in your account, see [Overdue payments](~~170589~~).",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "InstanceId",
      "description": "The ID of the server.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "InstanceName",
      "description": "The name of the server.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "PageSize",
      "description": "The number of entries to return on each page. Default value: 20. If you leave this parameter empty, 20 entries are returned on each page.\n\n>  We recommend that you do not leave this parameter empty.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "VulStatus",
      "description": "Specifies whether the server has vulnerabilities. Valid values:\n\n*   **true**: The server has vulnerabilities.\n*   **false**: The server does not have vulnerabilities.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    }
  ]
}