{
  "name": "ExportRecord",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ExportType",
      "description": "The type of the check result list to export. Valid values:\n\n*   **assetInstance**: the list of servers displayed on the Host page\n*   **user**: the list of fingerprints for accounts\n*   **port**: the list of fingerprints for ports\n*   **process**: the list of fingerprints for processes\n*   **sca**: the list of fingerprints for middleware assets\n*   **database**: the list of fingerprints for databases\n*   **web**: the list of fingerprints for web services\n*   **software**: the list of fingerprints for software assets\n*   **cron**: the list of fingerprints for scheduled tasks\n*   **autorun**: the list of fingerprints for startup items\n*   **lkm**: the list of fingerprints for kernel modules\n*   **webserver**: the list of fingerprints for websites\n*   **imageVulExport**: the list of image system vulnerabilities\n*   **imageBaseLineExport**: the list of check results for image baselines\n*   **imageAffectedMaliciousExport**: the list of check results for malicious image samples\n*   **baseline**: the list of check results for configuration assessment\n*   **attack**: the list of alert events for attack analysis\n*   **accessKey**: the list of alert events that are generated for AccessKey pair leaks",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Lang",
      "description": "The language of the content within the request and response. Default value: **zh**. Valid values:\n\n*   **zh**: Chinese\n*   **en**: English",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Params",
      "description": "The conditions that are used to filter check results.\n\n> This operation is a common export operation for multiple features of Security Center. The available configuration fields of this parameter vary based on the features. We recommend that you do not specify this parameter when you call the operation. You can export an information list without specifying this parameter, and then filter data in the exported Excel file.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}