{
  "name": "DescribeUrlObservationData",
  "deprecated": false,
  "protocol": "HTTPS",
  "method": "GET|POST",
  "pathPattern": "/",
  "parameters": [
    {
      "name": "ClientPlatform",
      "description": "The platform of the device. If the parameter is left empty, all devices are queried.\n\n*   PC\n*   Mobile",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EndTime",
      "description": "The end of the time range to query.\n\nSpecify the time in the ISO 8601 standard in the yyyy-MM-ddTHH:mm:ssZ format. The time must be in UTC. The time must be in UTC.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Metric",
      "description": "The metric data that is detected.\n\n*   TTFB: Measures the time between when a resource initiates a request and when the first byte of the response starts to arrive.\n*   FCP: Measures the time between when the page is loaded and when any part of the page's content is rendered on the screen.\n*   LCP: Reports the rendering time of the largest image or text block visible in the viewport.\n*   CLS: A metric that measures the maximum layout mutation score for every unexpected layout change that occurs throughout the life of the page.\n*   INP: Measures the responsiveness of the page, or how long it takes for the page to respond to user input in a visible way.\n*   FID: Measures the time between when the user first interacts with the page and when the browser is actually able to start processing the event handler in response to that interaction.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SiteId",
      "description": "The website ID, which can be obtained by calling the [ListSites](~~ListSites~~) operation.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "StartTime",
      "description": "The beginning of the time range to query.\n\nThe time follows the ISO 8601 standard in the yyyy-MM-ddTHH:mm:ssZ format. The time is displayed in UTC.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Url",
      "description": "The URL of the web page to monitor.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}