{
  "name": "PurgeCaches",
  "deprecated": false,
  "protocol": "HTTPS",
  "method": "POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Content",
      "description": "Content to be refreshed.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EdgeComputePurge",
      "description": "Used for refreshing cached resources in edge computing, such as allowing the refresh of content cached using the CacheAPI interface of an edge function.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "Force",
      "description": "Indicates whether to refresh all resources under the directory when the content from the origin and the source resource are inconsistent. The default is false.\n- **true**: Refreshes all resources under the specified directory.\n- **false**: Refreshes only the changed resources under the specified directory.\n\n> \n>  Applies to: Directory refresh, cachetag refresh, ignoreParams refresh, hostname refresh, and purge all cache of the site.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "SiteId",
      "description": "Site ID, which can be obtained by calling the [ListSites](~~2850189~~) interface.",
      "position": "Query",
      "type": "Long",
      "required": true
    },
    {
      "name": "Type",
      "description": "The type of refresh task. Possible values:\n- **file** (default): File refresh.\n- **cachekey**: Cachekey refresh.\n- **cachetag**: Cachetag refresh.\n- **directory**: Directory refresh.\n- **ignoreParams**: Ignore parameters refresh. Ignoring parameters means removing the ? and everything after it in the request URL. When performing an ignore parameters refresh, the user first submits the URL without parameters through the interface. The submitted URLs to be refreshed will then be matched against the cached resource URLs with the parameters removed. If the cached resource URL, after removing the parameters, matches the URL to be refreshed, the CDN node will refresh the cached resources.\n- **hostname**: Hostname refresh.\n- **purgeall**: Purge all cache under the site.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}