{
  "name": "ListDashboards",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ClusterId",
      "description": "The ID of the ACK cluster.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ClusterType",
      "description": "Valid values: ACK, ASK, cloud-product-prometheus, and Node. You can query the dashboards of a virtual cluster by specifying the cluster type. For InfluxDB, set this parameter to `cloud-product-prometheus`.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DashboardName",
      "description": "The unique names of the dashboards. You can query dashboards by specifying their names. The **dashboard title** can be changed whereas the **dashboard name** cannot. You can specify multiple names and separate them with commas (,), for example, `k8s-event,k8s-overview`. A dashboard may have multiple versions. If you want to specify a version, you can add version information after the name, for example, `k8s-event:v1,k8s-overview:latest`.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Language",
      "description": "The language of the Grafana dashboards. Valid values: en and zh. Default value: en.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Product",
      "description": "The code of the cloud service. This parameter is required if you set the ClusterType parameter to `cloud-product-prometheus`. The following cloud services are available: Serverless App Engine, Microservices Engine, Message Queue for Apache RocketMQ, Lindorm, Message Queue for Apache Kafka, ApsaraDB for ClickHouse, Data Lake Analytics, Message Queue for RabbitMQ, ApsaraDB for MongoDB, Time Series Database (TSDB) for InfluxDB, MSE Cloud-native Gateway, Grafana Service, SchedulerX, Global Transaction Service, Enterprise Distributed Application Service, Machine Learning Platform for AI - Elastic Algorithm Service (EAS), Application High Availability Service, and Performance Testing.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RecreateSwitch",
      "description": "Specifies whether to create or query a virtual cluster. This parameter provides backward compatibility.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Title",
      "description": "The dashboard title. The dashboard title can be changed. We recommend that you specify the **DashboardName** parameter.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}