{
  "name": "AssociateAclsWithListener",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AclIds",
      "description": "The ID of the ACL. You can associate up to two ACL IDs.",
      "position": "Query",
      "type": "RepeatList",
      "required": true
    },
    {
      "name": "AclType",
      "description": "The type of the ACL. Valid values:\n\n*   **white**: Only requests from the IP addresses or CIDR blocks in the ACL are forwarded. Whitelists are suitable for scenarios in which you want to allow access from specific IP addresses to an application. If a whitelist is improperly configured, risks may arise. After a whitelist is configured for a listener, only requests from the IP addresses that are added to the whitelist are distributed by the listener. If a whitelist is enabled but no IP address is added to the whitelist, the listener forwards all requests.\n*   **black**: All requests from the IP addresses or CIDR blocks in the ACL are rejected. Blacklists are suitable for scenarios in which you want to deny access from specific IP addresses to an application. If the blacklist is enabled but no IP addresses are added to the ACL, the listener forwards all requests.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request.\n\nYou can use the client to generate the token, but you must make sure that the token is unique among different requests. The token can contain only ASCII characters.\n\n>  If you do not specify this parameter, the system automatically uses the **request ID** as the **client token**. The **request ID** may be different for each request.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DryRun",
      "description": "Specifies whether to only precheck the request. Default value: false. Valid values:\n\n*   **true**: prechecks the request without performing the operation. The system checks the required parameters, request syntax, and limits. If the request fails the precheck, an error message is returned. If the request passes the precheck, the `DryRunOperation` error code is returned.\n*   **false**: sends the request. If the request passes the precheck, a 2xx HTTP status code is returned and the operation is performed.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "ListenerId",
      "description": "The listener ID.\n\nOnly intelligent routing listeners support ACLs.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "RegionId",
      "description": "The region ID of the Global Accelerator (GA) instance. Set the value to **cn-hangzhou**.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}