{
  "name": "CreateApplicationMonitor",
  "deprecated": false,
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AcceleratorId",
      "description": "The ID of the GA instance on which you want to perform the origin probing task.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Address",
      "description": "The URL or IP address that you want to probe.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request.\n\nYou can use the client to generate the token, but you must make sure that the token is unique among different requests. The token can contain only ASCII characters.\n\n>  If you do not specify this parameter, the system automatically uses the value of **RequestId** as the value of **ClientToken**. The **request ID** may be different for each request.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DetectEnable",
      "description": "Specifies whether to enable the automatic diagnostics feature. Valid values:\n\n*   **true**\n*   **false** (default)",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "DetectThreshold",
      "description": "The threshold that is used to trigger the automatic diagnostics feature. Unit: percentage.\n\nValid values: **0** to **100**.\n\nThe default value is **0**, which indicates that the automatic diagnostics feature is not triggered.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "DetectTimes",
      "description": "The number of times that the threshold must be reached before the automatic diagnostics feature is triggered.\n\nValid values: **1** to **20**. Default value: **1**.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "ListenerId",
      "description": "The ID of the listener on which you want to perform the origin probing task.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "OptionsJson",
      "description": "The extended options of the listener protocol that is used by the origin probing task. The options vary based on the listener protocol.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the GA instance. Set the value to **cn-hangzhou**.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "SilenceTime",
      "description": "The silence period of the automatic diagnostics feature. This parameter specifies the interval at which the automatic diagnostics feature is triggered. If the availability rate does not return to normal after GA triggers an automatic diagnostic task, GA must wait until the silence period ends before GA can trigger another automatic diagnostic task.\n\nIf the number of consecutive times that the availability rate drops below the threshold of automatic diagnostics reaches the value of **DetectTimes**, the automatic diagnostics feature is triggered. The automatic diagnostics feature is not triggered again within the silence period even if the availability rate remains below the threshold. If the availability rate does not return to normal after the silence period ends, the automatic diagnostics feature is triggered again.\n\nUnit: seconds. Valid values: **300** to **86400**. Default value: **300**.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "TaskName",
      "description": "The name of the origin probing task.\n\nThe name must be 4 to 100 characters in length, and can contain digits, underscores (\\_), and hyphens (-). It must start with a letter.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}