{
  "name": "UpdateApplicationMonitor",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Address",
      "description": "The URL or IP address that is probed.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request.\n\nYou can use the client to generate the token, but you must make sure that the token is unique among different requests. The token can contain only ASCII characters.\n\n>  If you do not specify this parameter, the system automatically uses the **request ID** as the **client token**. The **request ID** may be different for each request.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DetectEnable",
      "description": "Specifies whether to enable the automatic diagnostics feature. Valid values:\n\n*   **true**\n*   **false** (default)",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "DetectThreshold",
      "description": "Set the threshold that is used to trigger the automatic diagnostics feature. If the liveness of the origin in percentile drops below the specified threshold, the automatic diagnostics feature is triggered.\n\nValid values: **0** to **100**.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "DetectTimes",
      "description": "The number of times that the threshold must be reached before the automatic diagnostics feature is triggered.\n\nValid values: **1** to **20**.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "ListenerId",
      "description": "The ID of the listener that you want to modify. The listener runs the origin probing task.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "OptionsJson",
      "description": "The extended options of the listener protocol that is used by the origin probing task. The options vary based on the listener protocol.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The ID of the region where the Global Accelerator (GA) instance is deployed. Set the value to **cn-hangzhou**.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SilenceTime",
      "description": "The silence period of the automatic diagnostics feature. This parameter specifies the interval at which the automatic diagnostics feature is triggered. If the availability rate does not return to normal after GA triggers an automatic diagnostic task, GA must wait until the silence period ends before GA can trigger another automatic diagnostic task.\n\nIf the number of consecutive times that the availability rate drops below the threshold of automatic diagnostics reaches the value of the **DetectTimes** parameter, the automatic diagnostics feature is triggered. The automatic diagnostics feature is not triggered again within the silence period even if the availability rate stays below the threshold. If the availability rate does not return to normal after the silence period ends, the automatic diagnostics feature is triggered again.\n\nUnit: seconds. Valid values: **300** to **86400**.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "TaskId",
      "description": "The ID of the origin probing task that you want to modify.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "TaskName",
      "description": "The name of the origin probing task.\n\nThe name must be 1 to 128 characters in length and can contain letters, digits, periods (.), underscores (\\_), and hyphens (-). The name must start with a letter.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}