{
  "name": "AddZone",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ClientToken",
      "description": "A client token that is used to ensure the idempotence of the request. You can use the client to generate a token, but you must make sure that the token is unique among different requests. The token can contain only ASCII characters and cannot exceed 64 characters in length.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DnsGroup",
      "description": "The location of the built-in authoritative zone. Valid values:\n\n- **NORMAL\\_ZONE**: Standard zone. DNS responses are cached. If a cache miss occurs, the query is sent to the built-in authoritative standard zone. The time to live (TTL) value affects the time when a DNS record change takes effect. You cannot use custom DNS lines or weighted round-robin.\n\n- **FAST\\_ZONE**: Accelerated zone (recommended). DNS queries are directly responded to with the lowest latency. DNS record changes take effect in real time. You can use custom DNS lines and weighted round-robin.\n\nDefault value: **NORMAL\\_ZONE**.\n\n> The built-in authoritative accelerated zone is located before the cache module. DNS responses are not cached. This may increase the number of DNS queries and your costs.\n\n<props=\"china\">\n\n> Starting from April 30, 2025 (UTC+8), when new users activate Alibaba Cloud DNS PrivateZone, added zones are set as accelerated zones by default.\n\n</props>",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Lang",
      "description": "The language of the response. Valid values:\n\n- **zh**: Chinese.\n\n- **en**: English.\n\nDefault value: **en**.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ProxyPattern",
      "description": "Specifies whether to enable subdomain recursive proxy. Valid values:\n\n- **ZONE**: Disables the feature. If a DNS query for a subdomain that does not exist under the current domain name is received, an NXDOMAIN error is returned.\n\n- **RECORD**: Enables the feature. If a DNS query for a subdomain that does not exist under the current domain name is received, the query is processed by the forwarding and recursion modules in sequence. The final result is used to respond to the DNS query.\n\nDefault value: **ZONE**.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ResourceGroupId",
      "description": "The ID of the resource group.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ZoneName",
      "description": "The name of the zone to add.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ZoneTag",
      "description": "This parameter is not available to users. You do not need to specify this parameter.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ZoneType",
      "description": "This parameter is not available to users. You do not need to specify this parameter.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}