{
  "name": "ListApplications",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AppVersions",
      "description": "The version number of the application. Separate multiple version numbers with commas (,). If you want to query data of all versions of applications, specify All for this parameter. By default, only data of applications in the stable versions are queried.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ClusterNames",
      "description": "The name of the application cluster. Separate multiple names with commas (,). If you want to query applications of all clusters in your account, specify All for this parameter. Default value: All.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Level",
      "description": "The region level by which edge resources of the application are collected. The value is of the enumeration type. Valid values:\n\n*   National: Chinese mainland\n*   Big: area\n*   Middle: province\n*   Small: city\n*   RegionId: edge node\n\nDefault value: National.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "MaxDate",
      "description": "The end of the time range to query. Specify the time in the 2006-01-02 format. By default, the time range to query is not restricted.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "MinDate",
      "description": "The beginning of the time range to query. Specify the time in the 2006-01-02 format. By default, the time range to query is not restricted.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "OutAppInfoParams",
      "description": "Specifies whether to return other information about the application, such as statistics on resource instances and pods. The value must be a JSON string. By default, all information is returned.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "PageNumber",
      "description": "The page number. Pages start from page 1. This parameter is optional if you want to return all information about the applications.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "PageSize",
      "description": "The number of entries per page. This parameter is optional if you want to return all information about the applications.",
      "position": "Query",
      "type": "Integer",
      "required": false
    }
  ]
}