{
  "name": "ModifyInstanceAttribute",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "HostName",
      "description": "The hostname of the Elastic Compute Service (ECS) instance. The value can be 2 to 64 characters in length. You can use periods (.) to separate the value into multiple segments. Each segment can contain letters, digits, hyphens (-), and periods. Consecutive periods or hyphens are not allowed. The name cannot start or end with a period (.) or a hyphen (-).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "InstanceId",
      "description": "The ID of the instance for which you want to modify attributes. You can specify only one ID.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "InstanceName",
      "description": "The name of the instance.\n\nThe name must be 2 to 128 characters in length. It must start with a letter but cannot start with `http://` or `https://`. The name can contain letters, digits, colons (:), underscores (\\_), and hyphens (-).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Password",
      "description": "The password of the instance.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "UserData",
      "description": "The user data of the instance. User data must be encoded in Base64.\n\nThe size of your UserData cannot exceed 16 KB. We recommend that you do not pass in confidential information such as passwords and private keys in the plaintext format. If you must pass in confidential information, we recommend that you encrypt and Base64-encode the information before you pass it in. Then you can decode and decrypt the information in the same way within the instance.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}