{
  "name": "ListLogStores",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET",
  "pathPattern": "/logstores",
  "parameters": [
    {
      "name": "logstoreName",
      "description": "The name of the Logstore. Fuzzy match is supported. For example, if you enter test, Logstores whose name contains test are returned.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "mode",
      "description": "The type of the Logstore. Valid values: standard and query.\n\n*   **standard**: Standard Logstore. This type of Logstore supports the log analysis feature and is suitable for scenarios such as real-time monitoring and interactive analysis. You can also use this type of Logstore to build a comprehensive observability system.\n*   **query**: Query Logstore. This type of Logstore supports high-performance queries. The index traffic fee of a Query Logstore is approximately half that of a Standard Logstore. Query Logstores do not support SQL analysis. Query Logstores are suitable for scenarios in which the volume of data is large, the log retention period is long, or log analysis is not required. Log retention periods of weeks or months are considered long.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "offset",
      "description": "The line from which the query starts. Default value: 0.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "project",
      "description": "The name of the project.",
      "position": "Host",
      "type": "String",
      "required": true
    },
    {
      "name": "size",
      "description": "The number of entries per page. Maximum value: 500. Default value: 200.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "telemetryType",
      "description": "The type of the data that you want to query. Valid values:\n\n*   None: logs\n*   Metrics: metrics",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}