{
  "name": "DescribeNetworkFlowTopNMetric",
  "protocol": "HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Filter",
      "description": "An array of filter conditions. Multiple filter parameters use AND logic.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "InstanceId",
      "description": "The Web Application Firewall (WAF) instance ID.\n\n>  Call the [DescribeInstanceInfo](~~140857~~) operation to retrieve the WAF instance ID.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Limit",
      "description": "Returns up to 10 data entries, sorted in descending order.",
      "position": "Query",
      "type": "Long",
      "required": true
    },
    {
      "name": "Metric",
      "description": "Specifies the data type to be returned. Valid values:\n\n*   real_client_ip: The top N requests, sorted in descending order by source IP address, aggregated from all the current user's WAF requests.\n*   request_path: The top N requests, sorted in descending order by user-agent, aggregated from all the current user's WAF requests.\n*   request_path: The top N requests, sorted in descending order by request URL, aggregated from all the current user's WAF requests.\n*   matched_host_by_total_requests: The top N protected objects and their request counts for the current user.\n*   matched_host_by_qps: The top N protected objects and their queries per second (QPS) values.\n*   matched_host_by_status: When using it, you must specify status in the Conditions field of the Filter parameter. If the HTTP response code returned by WAF matches the status specified in the Conditions, then the top N data is returned, sorted in descending order by protected objects. The format for specifying the status is as follows:\\\n    {\"Key\":\"status\",\"OpValue\":\"eq\",\"Values\":\"200\"}\n*   matched_host_by_upstream_status: When using it, you must specify upstream_status in the Conditions field of the Filter parameter. If the HTTP response code returned by the origin server matches the upstream_status specified, the top N data is returned, sorted in descending order by protected objects. The format for specifying the upstream_status is as follows:\\\n    {\"Key\":\"upstream_status\",\"OpValue\":\"eq\",\"Values\":\"200\"}",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "RegionId",
      "description": "The region ID of the WAF instance. Valid values:\n\n*   **cn-hangzhou**: The Chinese mainland.\n*   **ap-southeast-1**: Outside the Chinese mainland.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ResourceManagerResourceGroupId",
      "description": "The resource group ID.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}