{
  "name": "DescribeSecurityEventTimeSeriesMetric",
  "protocol": "HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Filter",
      "description": "The filter conditions for the query. Multiple conditions are evaluated by using a logical AND.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "InstanceId",
      "description": "The ID of the Web Application Firewall (WAF) instance.\n\n>  You can call the [DescribeInstanceInfo](~~140857~~) operation to query the ID of the WAF instance.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Metric",
      "description": "The metric whose time series data you want to return. The following metrics are supported:\n\n*   mitigated_requests: The system returns the time series data of requests that are blocked.\n*   monitored_requests: The system returns the time series data of requests that match Monitor protection rules.\n*   mitigated_requests_group_by_defense_scene: The system returns the number of requests that match each protection module. The returned results are grouped by protection module and can be used to generate time series charts. A request can match multiple protection modules. Therefore, the total number of matched requests is inconsistent with the total number of requests.\n*   mitigated_requests_group_by_block_defense_scene: The system returns the number of requests that are blocked by each protection module. The returned results are grouped by protection module and can be used to generate time series charts. A request can be blocked by only one protection module. Therefore, the total number of blocked requests is consistent with the total number of requests.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "RegionId",
      "description": "The region ID of the WAF instance. Valid values:\n\n*   **cn-hangzhou**: The Chinese mainland.\n*   **ap-southeast-1**: Outside the Chinese mainland.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ResourceManagerResourceGroupId",
      "description": "The ID of the Alibaba Cloud resource group.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}