{
  "name": "DescribeSecurityEventTopNMetric",
  "protocol": "HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Filter",
      "description": "The filter conditions for the query. Multiple conditions are evaluated by using a logical AND.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "InstanceId",
      "description": "The ID of the Web Application Firewall (WAF) instance.\n\n>  You can call the [DescribeInstanceInfo](~~140857~~) operation to query the ID of the WAF instance.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Limit",
      "description": "The number of data entries that can be returned. Data entries are sorted in descending order before they are returned. Maximum value: 10.",
      "position": "Query",
      "type": "Long",
      "required": true
    },
    {
      "name": "Metric",
      "description": "The metric whose top N data entries you want to return. The following metrics are supported:\n\n>  For more information about attack requests, see the \"Operation description\" section of this topic.\n\n*   real_client_ip: The system aggregates the source IP addresses of attack requests to collect statistics, sorts the statistical results in descending order, and returns top N data entries.\n*   http_user_agent: The system aggregates the User-Agent header field of attack requests to collect statistics, sorts the statistical results in descending order, and returns top N data entries.\n*   matched_host: The system aggregates the protected objects that are matched by attack requests to collect statistics, sorts the statistical results in descending order, and returns top N data entries.\n*   remote_region_id: The system aggregates the countries to which the source IP addresses of attack requests belong to collect statistics, sorts the statistical results in descending order, and returns top N data entries.\n*   request_path: The system aggregates the URLs of attack requests to collect statistics, sorts the statistical results in descending order, and returns top N data entries. The URLs exclude query strings.\n*   block_defense_scene: The system aggregates the protection modules that block attack requests to collect statistics, sorts the statistical results in descending order, and returns top N data entries. The requests match protection rules whose actions are not set to Monitor.\n*   defense_scene: The system aggregates the protection modules that are matched by attack requests to collect statistics, sorts the statistical results in descending order, and returns top N data entries.\n*   defense_scene_rule_id: The system returns the IDs of top N protection rules that are matched by attack requests and also the related protection modules. Only protection rules whose actions are not set to Monitor are counted. The system returns the value in the following format:\\\n    `{ \"Attribute\": \"waf_base\", \"Value\": 140, \"Name\": \"111034\" }`\n*   defense_scene_with_rule_id: The system returns the IDs of top N protection rules that are matched by attack requests and also the related protection modules. The IDs and protection modules are connected by using hyphens (-). Protection rules whose actions are set to Monitor and Block are counted. The system returns the value in the following format:\\\n    `{ \"Attribute\": \"\", \"Value\": 1, \"Name\": \"120075-waf_base\" }`\n*   defense_scene_top_rule_id: The system returns top N matched protection rules of a specific protection module. You can specify Conditions in Filter to configure filter conditions. For example, you can use the following condition to query top N matched protection rules of the custom rule module:\\\n    `{ \"Key\": \"defense_scene_map\", \"OpValue\": \"contain\", \"Values\": \"custom_acl\" }`\n*   defense_scene_rule_type: The system returns top N matched protection rules of the core web protection module. This metric is supported only by the core web protection module because only this module supports subtypes of protection rules. You must specify Conditions in Filter to configure filter conditions. Example:\\\n    `{ \"Key\": \"defense_scene\", \"OpValue\": \"eq\", \"Values\": \"waf_base\" }`",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "RegionId",
      "description": "The region ID of the WAF instance. Valid values:\n\n*   **cn-hangzhou**: The Chinese mainland.\n*   **ap-southeast-1**: Outside the Chinese mainland.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ResourceManagerResourceGroupId",
      "description": "The ID of the Alibaba Cloud resource group.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}