{
  "name": "OnsConsumerResetOffset",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "GroupId",
      "description": "The ID of the consumer group whose dead-letter message you want to query.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "InstanceId",
      "description": "The ID of the instance to which the consumer group belongs.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ResetTimestamp",
      "description": "The timestamp to which you want to reset the consumer offset. This parameter takes effect only when the **Type** parameter is set to **1**. Unit: milliseconds.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "Topic",
      "description": "The name of the topic for which you want to reset the consumer offset.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Type",
      "description": "The method that you want to use to clear accumulated messages. Valid values:\n\n*   **0:** All accumulated messages are cleared. Messages that are not consumed are ignored. Consumers in the specified consumer group consume only messages that are published to the topic after the specified point in time.\n\nIf \"reconsumeLater\" is returned, the accumulated messages are not cleared because the system is retrying to resend the messages to consumers.\n\n*   **1:** The messages that were published to the topic before the specified point in time are cleared. You must specify a point in time. Consumers in the specified consumer group consume only the messages that are published to the topic after the specified point in time.\n\nYou can specify a point in time from the earliest point in time when a message was published to the topic to the most recent point in time when a message was published to the topic. Points in time that are not within the allowed time range are invalid.",
      "position": "Query",
      "type": "Integer",
      "required": true
    }
  ]
}