{
  "name": "OnsGroupCreate",
  "deprecated": false,
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "GroupId",
      "description": "The ID of the consumer group that you want to create. The group ID must meet the following rules:\n\n*   The group ID must be 2 to 64 characters in length and can contain only letters, digits, hyphens (-), and underscores (\\_).\n*   If the ApsaraMQ for RocketMQ instance in which you want to create the consumer group uses a namespace, the group ID must be unique in the instance. The group ID cannot be the same as an existing group ID or a topic name in the instance. The group ID can be the same as a group ID or a topic name in another instance that uses a different namespace. For example, if Instance A and Instance B use different namespaces, a group ID in Instance A can be the same as a group ID or a topic name in Instance B.\n*   If the instance does not use a namespace, the group ID must be globally unique across instances and regions. The group ID cannot be the same as an existing group ID or topic name in ApsaraMQ for RocketMQ instances that belong to your Alibaba Cloud account.\n\n> \n\n*   After the consumer group is created, the group ID cannot be changed.\n\n*   To check whether an instance uses a namespace, log on to the ApsaraMQ for RocketMQ console, go to the **Instance Details** page, and then view the value of the Namespace field in the **Basic Information** section.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "GroupType",
      "description": "The protocol over which clients in the consumer group communicate with the ApsaraMQ for RocketMQ broker. All clients in a consumer group communicate with the ApsaraMQ for RocketMQ broker over the same protocol. You must create different groups for TCP clients and HTTP clients. Valid values:\n\n*   **tcp**: Clients in the consumer group consume messages over TCP. This is the default value.\n*   **http**: Clients in the consumer group consume messages over HTTP.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "InstanceId",
      "description": "The ID of the instance in which you want to create the consumer group.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Remark",
      "description": "The description of the consumer group.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}