{
  "name": "OnsGroupList",
  "deprecated": false,
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "GroupId",
      "description": "This parameter is required only when you query specific consumer groups by using the fuzzy search method. If this parameter is not configured, the system queries all consumer groups that can be accessed by the current account.\n\nIf you set this parameter to GID_ABC, the information about the consumer groups whose IDs contain GID_ABC is returned. For example, the information about the GID_test_GID_ABC\\_123 and GID_ABC\\_356 consumer groups is returned.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "GroupType",
      "description": "The protocol over which the queried consumer group publishes and subscribes to messages. All clients in a consumer group communicate with the ApsaraMQ for RocketMQ broker over the same protocol. You must create different consumer groups for TCP clients and HTTP clients. Valid values:\n\n*   **tcp**: specifies that the consumer group publishes or subscribes to messages over TCP. This value is the default value.\n*   **http**: specifies that the consumer group publishes or subscribes to messages over HTTP.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "InstanceId",
      "description": "The ID of the instance to which the consumer group you want to query belongs.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Tag",
      "description": "The list of tags that are attached to the consumer group. A maximum of 20 tags can be included in the list.",
      "position": "Query",
      "type": "RepeatList",
      "required": false,
      "sub_parameters": [
        {
          "name": "Key",
          "position": "Query",
          "type": "String",
          "required": true
        },
        {
          "name": "Value",
          "position": "Query",
          "type": "String",
          "required": true
        }
      ]
    }
  ]
}