{
  "name": "OnsMessagePageQueryByTopic",
  "deprecated": false,
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "BeginTime",
      "description": "The beginning of the time range to query. The value of this parameter is a UNIX timestamp in milliseconds. If you specify a valid value for the **TaskId** parameter in the request, this parameter does not take effect. The system uses the value of the BeginTime parameter that you specified in the request when you created the specified query task.",
      "position": "Query",
      "type": "Long",
      "required": true
    },
    {
      "name": "CurrentPage",
      "description": "The number of the page to return. Pages start from page 1. Valid values: 1 to 50.",
      "position": "Query",
      "type": "Integer",
      "required": true
    },
    {
      "name": "EndTime",
      "description": "The end of the time range to query. The value of this parameter is a UNIX timestamp in milliseconds. If you specify a valid value for the **TaskId** parameter in the request, this parameter does not take effect. The system uses the value of the EndTime parameter that you specified in the request when you created the specified query task.",
      "position": "Query",
      "type": "Long",
      "required": true
    },
    {
      "name": "InstanceId",
      "description": "The ID of the instance to which the message you want to query belongs.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "PageSize",
      "description": "The number of entries to return on each page. Valid values: 5 to 50. Default value: 20. If you specify a valid value for the **TaskId** parameter in the request, this parameter does not take effect. The system uses the value of the PageSize parameter that you specified in the request for creating the query task.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "TaskId",
      "description": "The ID of the query task. The first time you call this operation to query the information about messages in a specified topic within a specified time range, this parameter is not required. This parameter is required in subsequent queries for messages on a specified page. You can obtain the task ID from the returned result of the first query.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Topic",
      "description": "The name of the topic whose messages you want to query.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}