{
  "name": "OnsTopicCreate",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "InstanceId",
      "description": "The ID of the instance in which you want to create the topic.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "MessageType",
      "description": "The type of messages that you want to publish to the topic. Valid values:\n\n*   **0**: normal messages\n*   **1**: partitionally ordered messages\n*   **2**: globally ordered messages\n*   **4**: transactional messages\n*   **5**: scheduled or delayed messages\n\nFor more information about message types, see [Message types](~~155952~~).",
      "position": "Query",
      "type": "Integer",
      "required": true
    },
    {
      "name": "Remark",
      "description": "The description of the topic that you want to create.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Topic",
      "description": "The name of the topic that you want to create. The name must meet the following rules:\n\n*   The name must be 3 to 64 characters in length and can contain letters, digits, hyphens (-), and underscores (\\_).\n*   The topic name cannot start with CID or GID because CID and GID are reserved prefixes for group IDs.\n*   If the ApsaraMQ for RocketMQ instance in which you want to create the topic uses a namespace, the topic name must be unique in the instance. The topic name cannot be the same as an existing topic name or a group ID in the instance. The topic name can be the same as a topic name or a group ID in another instance that uses a different namespace. For example, if Instance A and Instance B use different namespaces, a topic name in Instance A can be the same as a topic name or a group ID in Instance B.\n*   If the instance in which you want to create the topic does not use a namespace, the topic name must be globally unique across instances and regions. The topic name cannot be the same as an existing topic name or group ID in all ApsaraMQ for RocketMQ instances that belong to your Alibaba Cloud account.\n\n> To check whether an instance uses a namespace, log on to the ApsaraMQ for RocketMQ console, go to the **Instance Details** page, and then view the value of the Namespace field in the **Basic Information** section.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}