{
  "version": "2020-04-07",
  "style": "rpc",
  "apis": {
    "CancelCertificateForPackageRequest": {
      "title": "CancelCertificateForPackageRequest",
      "summary": "Revokes an issued certificate and cancels the application order of the certificate.",
      "deprecated": false
    },
    "CancelOrderRequest": {
      "title": "CancelOrderRequest",
      "summary": "Cancels a certificate application order that is in the pending validation or being reviewed state.",
      "deprecated": false
    },
    "CreateCertificateForPackageRequest": {
      "title": "CreateCertificateForPackageRequest",
      "summary": "Submits a certificate application.",
      "deprecated": false
    },
    "CreateCertificateRequest": {
      "title": "CreateCertificateRequest",
      "summary": "Purchases, applies for, and issues a domain validated (DV) certificate by using extended certificate services.",
      "deprecated": false
    },
    "CreateCertificateWithCsrRequest": {
      "title": "CreateCertificateWithCsrRequest",
      "summary": "Purchases, applies for, and issues a domain validated (DV) certificate by using a custom certificate signing request (CSR) file. You can use extended certificate services to purchase and apply for a DV certificate with a few clicks.",
      "deprecated": false
    },
    "CreateCsr": {
      "title": "CreateCsr",
      "summary": "Creates a certificate signing request (CSR). A CSR file contains the information about an SSL certificate that you want to apply for. The information includes the domain names that you want to bind to the certificate and the name and the geographical location of the certificate holder. When you submit a certificate application to a certificate authority (CA), you must provide a CSR. After the CA approves your certificate application, the CA uses the private key of the root CA to sign your CSR and generates a public key file. The public key file is the SSL certificate that the CA issues to you. The private key of the SSL certificate is generated when you create the CSR.",
      "deprecated": false
    },
    "CreateDeploymentJob": {
      "title": "CreateDeploymentJob",
      "summary": "Creates a certificate deployment task. After an SSL certificate is issued, you can create a certificate deployment task to immediately deploy the certificate to an Alibaba Cloud service or deploy the certificate to the service at a specific point in time. Then, the certificate can implement trusted identity authentication and ensure the security of data transmission for your website hosted on the service.",
      "deprecated": false
    },
    "Decrypt": {
      "title": "Decrypt",
      "summary": "Decrypts a certificate in a certificate repository.",
      "deprecated": false
    },
    "DeleteCertificateRequest": {
      "title": "DeleteCertificateRequest",
      "summary": "Deletes an order in which the application for a domain validated (DV) certificate failed.",
      "deprecated": false
    },
    "DeleteCsr": {
      "title": "DeleteCsr",
      "summary": "Deletes a Certificate Signing Request (CSR) that is no longer required.",
      "deprecated": false
    },
    "DeleteDeploymentJob": {
      "title": "DeleteDeploymentJob",
      "summary": "Deletes a deployment task.",
      "deprecated": false
    },
    "DeletePCACert": {
      "title": "DeletePCACert",
      "summary": "Deletes a private certificate from a certificate application repository.",
      "deprecated": false
    },
    "DeleteUserCertificate": {
      "title": "DeleteUserCertificate",
      "summary": "Deletes an expired or uploaded certificate.",
      "deprecated": false
    },
    "DeleteWorkerResource": {
      "title": "DeleteWorkerResource",
      "summary": "Deletes the worker of a deployment task.",
      "deprecated": false
    },
    "DescribeCertificateState": {
      "title": "DescribeCertificateState",
      "summary": "Queries the status of a specified certificate application order.",
      "deprecated": false
    },
    "DescribeCloudResourceStatus": {
      "title": "DescribeCloudResourceStatus",
      "summary": "Queries the number of third-party cloud resources on which you deployed certificates by using a multi-cloud deployment task.",
      "deprecated": false
    },
    "DescribeDeploymentJob": {
      "title": "DescribeDeploymentJob",
      "summary": "Queries the details of a deployment task. You can call the CreateDeploymentJob operation to create a deployment task and obtain the ID of the task.",
      "deprecated": false
    },
    "DescribeDeploymentJobStatus": {
      "title": "DescribeDeploymentJobStatus",
      "summary": "Queries the number of worker tasks in a deployment task.",
      "deprecated": false
    },
    "DescribePackageState": {
      "title": "DescribePackageState",
      "summary": "Queries the quota for domain validated (DV) certificates that you purchase and the quota usage.",
      "deprecated": false
    },
    "Encrypt": {
      "title": "Encrypt",
      "summary": "Encrypts a certificate in a certificate repository.",
      "deprecated": false
    },
    "GetCertWarehouseQuota": {
      "title": "GetCertWarehouseQuota",
      "summary": "Queries the API call quota for certificate application repositories. When you call API operations for signature generation, signature verification, data encryption, and data decryption, your API call quota for certificate application repositories is consumed. If your API call quota is exhausted, you can no longer call specific certificate application repository-related operations. You can call this operation to query the API call quota for certificate application repositories.",
      "deprecated": false
    },
    "GetCsrDetail": {
      "title": "GetCsrDetail",
      "summary": "Obtains the content of a certificate signing request (CSR) file.",
      "deprecated": false
    },
    "GetUserCertificateDetail": {
      "title": "GetUserCertificateDetail",
      "summary": "Queries certificate details, including the basic information and public and private key content. You can call this operation to download the certificate and private key.",
      "deprecated": false
    },
    "ListCert": {
      "title": "ListCert",
      "summary": "Queries the certificates in a certificate repository.",
      "deprecated": false
    },
    "ListCertWarehouse": {
      "title": "ListCertWarehouse",
      "summary": "Queries certificate repositories.",
      "deprecated": false
    },
    "ListCloudAccess": {
      "title": "ListCloudAccess",
      "summary": "Queries a list of AccessKey pairs for multi-cloud deployment.",
      "deprecated": false
    },
    "ListCloudResources": {
      "title": "ListCloudResources",
      "summary": "Queries the certificate resources of a cloud service provider and cloud services.",
      "deprecated": false
    },
    "ListContact": {
      "title": "ListContact",
      "summary": "Queries a list of contacts.",
      "deprecated": false
    },
    "ListCsr": {
      "title": "ListCsr",
      "summary": "Queries the details of Certificate Signing Requests (CSRs).",
      "deprecated": false
    },
    "ListDeploymentJob": {
      "title": "ListDeploymentJob",
      "summary": "Queries a list of deployment tasks that are created.",
      "deprecated": false
    },
    "ListDeploymentJobCert": {
      "title": "ListDeploymentJobCert",
      "summary": "Queries the basic information about a deployment task. After you create a deployment task, you can call this operation to obtain the basic information about the deployment task, including the instance ID, type, and name of the certificate.",
      "deprecated": false
    },
    "ListDeploymentJobResource": {
      "title": "ListDeploymentJobResource",
      "summary": "Queries the cloud resources of cloud services in a deployment task.",
      "deprecated": false
    },
    "ListUserCertificateOrder": {
      "title": "ListUserCertificateOrder",
      "summary": "Queries the certificates or certificate orders of users.",
      "deprecated": false
    },
    "ListWorkerResource": {
      "title": "ListWorkerResource",
      "summary": "Queries the details about the worker tasks of a deployment task. Alibaba Cloud allows you to deploy multiple certificates at a time. Therefore, a deployment task may include multiple worker tasks in multiple cloud services. A worker task refers to a task that deploys a certificate to a cloud resource in a cloud service.",
      "deprecated": false
    },
    "MoveResourceGroup": {
      "title": "MoveResourceGroup",
      "summary": "Changes the resource group to which a certificate or certificate order belongs.",
      "deprecated": false
    },
    "RenewCertificateOrderForPackageRequest": {
      "title": "RenewCertificateOrderForPackageRequest",
      "summary": "Submits a renewal application for an issued certificate.",
      "deprecated": false
    },
    "Sign": {
      "title": "Sign",
      "summary": "Signs a private certificate in a certificate application repository.",
      "deprecated": false
    },
    "UpdateCsr": {
      "title": "UpdateCsr",
      "summary": "Uploads or updates the private key for a Certificate Signing Request (CSR). If you did not upload the required priviate when you uploaded a CSR, you can call this operation to upload or update the private key.",
      "deprecated": false
    },
    "UpdateDeploymentJob": {
      "title": "UpdateDeploymentJob",
      "summary": "Updates a deployment task.",
      "deprecated": false
    },
    "UpdateDeploymentJobStatus": {
      "title": "UpdateDeploymentJobStatus",
      "summary": "Updates the status of a deployment task.",
      "deprecated": false
    },
    "UpdateWorkerResourceStatus": {
      "title": "UpdateWorkerResourceStatus",
      "summary": "Rolls back or executes a worker task in a deployment task.",
      "deprecated": false
    },
    "UploadCsr": {
      "title": "UploadCsr",
      "summary": "Uploads an existing Certificate Signing Request (CSR). You can use the CSR when you upload a certificate. You can also manage the uploaded CSRs in a centralized manner.",
      "deprecated": false
    },
    "UploadUserCertificate": {
      "title": "UploadUserCertificate",
      "summary": "Uploads a certificate.",
      "deprecated": false
    },
    "Verify": {
      "title": "Verify",
      "summary": "Verifies the signature of a private certificate in a certificate application repository.",
      "deprecated": false
    }
  }
}