{
  "name": "CreateOfficeConversionTask",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "CredentialConfig",
      "description": "**If you have no special requirements, leave this parameter empty.**\n\nThe authorization chain settings. For more information, see [Use authorization chains to access resources of other entities](~~465340~~).",
      "position": "Query",
      "type": "Json",
      "required": false
    },
    {
      "name": "EndPage",
      "description": "The ending page for document conversion. The default value is -1, which converts the file until the last page of the file.\n\n> \n\n*   If the source is a spreadsheet file, specify the index number of the corresponding sheet instead.\n\n*   If you convert a large number of pages within the document, we recommend that you split the pages into several document conversion tasks to prevent conversion timeouts.\n\n*   This parameter takes effect only when you convert the file into an image. It does not take effect when you convert the file into a PDF or TXT file.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "FirstPage",
      "description": "Specifies whether to return only the first resulting image when you convert a spreadsheet document to images. The number of rows and the number of columns in the first image are determined by the automatic splitting process. Valid values:\n\n*   false (default): does not return only the first resulting image. All the resulting images are returned.\n*   true: returns only the first resulting image. A thumbnail is generated.\n\n>  This parameter takes effect only when the **LongPicture** parameter is set to `true`.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "FitToHeight",
      "description": "Specifies whether to convert all rows of a spreadsheet document to one single image or a single-page PDF document when you convert the table document to an image or a PDF document. Valid values:\n\n*   false (default): converts all rows of the document to multiple images or a multi-page PDF document. This is the default value.\n*   true: converts all rows of the document to one single image or a single-page PDF document.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "FitToWidth",
      "description": "Specifies whether to convert all columns of a spreadsheet document to one single image or a single-page PDF document when you convert the spreadsheet file to an image or a PDF document. Valid values:\n\n*   false (default): converts all columns of the document to multiple images or a multi-page PDF document.\n*   true: converts all columns of the document to one single image or a single-page PDF document.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "HoldLineFeed",
      "description": "Specifies whether to retain line feeds in the output file when a document is converted to a text file. Valid values:\n\n*   false (default): does not retain the line feeds.\n*   true: retains the line feeds.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "ImageDPI",
      "description": "The dots per inch (DPI) of output images. Valid values: 96 to 600. Default value: 96.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "LongPicture",
      "description": "Specifies whether to convert the document to a long image. Valid values:\n\n*   false (default): does not convert the document to a long image.\n*   true: converts the document to a long image.\n\n>  You can convert up to 20 pages of a document into a long image. If you convert more than 20 pages to a long image, an error may occur.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "LongText",
      "description": "Specifies whether to convert the document to a long text file. Valid values:\n\n*   false (default): does not convert the document to a long text file. Each page of the document is converted to a text file.\n*   true: converts the entire document to a long text file.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "MaxSheetColumn",
      "description": "The maximum number of spreadsheet columns to be converted to an image. By default, all columns within the spreadsheet file are converted.\n\n>  This parameter takes effect only when the **LongPicture** parameter is set to `true`.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "MaxSheetRow",
      "description": "The maximum number of spreadsheet rows to be converted to an image. By default, all rows within the spreadsheet file are converted.\n\n>  This parameter takes effect only when the **LongPicture** parameter is set to `true`.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "Notification",
      "description": "The notification settings. For information about the asynchronous notification format, see [Asynchronous message examples](~~2743997~~).",
      "position": "Query",
      "type": "Json",
      "required": false
    },
    {
      "name": "Pages",
      "description": "The numbers of pages to be converted. This parameter takes precedence over the StartPage and EndPage parameters. The value of this parameter can be in different formats:\n\n*   If you specify pages separately by page number, separate page numbers with commas (,). Example: 1,2\n*   If you specify consecutive pages by using a page range, connect the starting and ending page numbers with a hyphen (-). Example: 1,2-4,7",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "PaperHorizontal",
      "description": "Specifies whether to place sheets of paper horizontally for converting a spreadsheet document to images. Conversion to images is similar to printing the content on a sheet of paper. Valid values:\n\n*   false (default): does not place sheets of paper horizontally. Paper sheets are placed vertically.\n*   true: places sheets of paper horizontally.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "PaperSize",
      "description": "The paper size for converting a spreadsheet document to images. Conversion to images is similar to printing the content on a sheet of paper. Valid values:\n\n*   A0\n*   A2\n*   A4 (default)\n\n>  This parameter takes effect only when the **FitToHeight** and **FitToWidth** parameters are specified.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Password",
      "description": "The password that protects the source document. To convert a password-protected document, specify this parameter.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ProjectName",
      "description": "The name of the project.[](~~478153~~)",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Quality",
      "description": "The quality of the output file. Valid values: 0 to 100. A smaller value indicates lower quality and better conversion performance. By default, the system specifies an appropriate value that provides an optimal balance between the quality and conversion performance based on the document content.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "ScalePercentage",
      "description": "The percentage scale relative to the source document. Valid values: 20 to 199. The default value is 100, which indicates that the document is not scaled.\n\n> A value that is less than 100 indicates a size reduction. A value that is greater than 100 indicates an enlargement.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "SheetCount",
      "description": "The number of sheets to be converted to an image. By default, all sheets within the spreadsheet file are converted.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "SheetIndex",
      "description": "The index number of the sheet to be converted to an image. The value ranges from 1 to the index number of the last sheet. By default, the conversion starts from the first sheet.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "ShowComments",
      "description": "Specifies whether to display comments in resulting images when a text document is converted to images. Valid values:\n\n*   false (default): does not display comments in resulting images.\n*   true: displays comments in resulting images.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "SourceType",
      "description": "The name extension of the source file. By default, the type of the source file is determined based on the name extension of the source object in OSS. If the object in OSS does not have a name extension, you can specify this parameter. Valid values:\n\n*   Text documents: doc, docx, wps, wpss, docm, dotm, dot, dotx, and html\n*   Presentation documents: pptx, ppt, pot, potx, pps, ppsx, dps, dpt, pptm, potm, ppsm, and dpss\n*   Spreadsheet documents: xls, xlt, et, ett, xlsx, xltx, csv, xlsb, xlsm, xltm, and ets\n*   PDF documents: pdf",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SourceURI",
      "description": "The URI of the source file.\n\nSpecify the OSS URI in the oss://${Bucket}/${Object} format, where `${Bucket}` is the name of the bucket in the same region as the current project and `${Object}` is the path of the object with the extension included.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Sources",
      "description": "The list of images. The sequence of image URIs in the list determines the order in which they are converted. (**This parameter is not officially available and is not recommended.**)",
      "position": "Body",
      "type": "Json",
      "required": false,
      "sub_parameters": [
        {
          "name": "Rotate",
          "position": "FormData",
          "type": "Long",
          "required": false
        },
        {
          "name": "URI",
          "position": "FormData",
          "type": "String",
          "required": false
        }
      ]
    },
    {
      "name": "StartPage",
      "description": "The starting page for document conversion. Default value: 1.\n\n> \n\n*   If the document is a spreadsheet file, specify the index number of the corresponding sheet instead.\n\n*   This parameter takes effect only when you convert the file to an image format. It does not take effect when you convert the file into a PDF or TXT file.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "Tags",
      "description": "The custom tags in dictionary format. You can use the custom tags to search for the task.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TargetType",
      "description": "The format of the output file. Valid values:\n\n*   png: a PNG image.\n*   jpg: a JPG image.\n*   pdf: a PDF file.\n*   txt: a TXT file. You can specify this value to extract the text content of the source document. Only presentation, text, or spreadsheet documents can be converted to a TXT file. If the source document is a spreadsheet, only one TXT is created and sheet-related parameters do not take effect.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "TargetURI",
      "description": "The address template of the output file.\n\nSpecify the value in the `oss://{bucket}/{tags.custom}/{dirname}/{barename}.{autoext}` format. For more information, see [TargetURI template](~~465762~~).\n\n>  Specify at least one of the TargetURI and TargetURIPrefix parameters.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TargetURIPrefix",
      "description": "The prefix of the storage address of the output file.\n\nSpecify the prefix in the `oss://${Bucket}/${Prefix}/` format, where `${Bucket}` is the name of the bucket in the same region as the current project and `${Prefix}` is the prefix of the output file.\n\n>  Specify at least one of the TargetURI and TargetURIPrefix parameters.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TrimPolicy",
      "description": "The trim policy for converting a spreadsheet file. Empty rows and columns may generate blank spaces in the output file if no appropriate trim policy is specified.",
      "position": "Query",
      "type": "Json",
      "required": false
    },
    {
      "name": "UserData",
      "description": "The custom information, which is returned in an asynchronous notification and facilitates notification management. The maximum information length is 2,048 bytes.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}