{
  "name": "CreateStory",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Address",
      "description": "The address of the story. IMM filters candidate photos to generate a story based on the value of this parameter. This parameter takes effect only if you set StoryType to TravelMemory.\n\n>  If the caller of the operation is located in Hong Kong (China), Macao (China), Taiwan (China), or another region outside the Chinese mainland, the system cannot convert the GPS information in the Chinese mainland into the textual address version.",
      "position": "Body",
      "type": "Json",
      "required": false
    },
    {
      "name": "CustomId",
      "description": "The custom ID. A custom ID of a generated story may differ from the value of ObjectID and can be utilized for subsequent retrieval and sorting of stories.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "CustomLabels",
      "description": "The custom labels. Labels specify the custom information of the story. This enables retrieval based on your business requirements.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "DatasetName",
      "description": "The name of the dataset. For information about how to obtain the name of a dataset, see [Create a dataset](~~478160~~).",
      "position": "Body",
      "type": "String",
      "required": true
    },
    {
      "name": "MaxFileCount",
      "description": "The maximum number of photo files in the story. The actual number of photo files ranges from the value of MinFileCount to the value of MaxFileCount. The value of this parameter must be an integer greater than the value of MinFileCount. To provide the desired effect, the algorithm limits the maximum number of photo files to 1,500. If you set MaxFileCount to a value greater than 1,500, this parameter does not take effect.",
      "position": "Body",
      "type": "Long",
      "required": false
    },
    {
      "name": "MinFileCount",
      "description": "The minimum number of photo files in the story. The actual number of photo files ranges from the value of MinFileCount to the value of MaxFileCount. The value of this parameter must be an integer greater than 1. If the actual number of candidate photos is less than the value of this parameter, a null story is returned.",
      "position": "Body",
      "type": "Long",
      "required": false
    },
    {
      "name": "Notification",
      "description": "The notification settings. For information about the asynchronous notification format, see [Asynchronous message examples](~~2743997~~).",
      "position": "Query",
      "type": "Json",
      "required": false
    },
    {
      "name": "NotifyTopicName",
      "description": "The topic name of the asynchronous reverse notification.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "ObjectId",
      "description": "The ID of the story. This parameter is optional. If you leave this parameter empty, IMM assigns a unique identifier to the story. You can query and update a story based on its ID. You can also manually create an ID for a story. After you create an ID for a story, you must specify this parameter to pass the ID into the system. This way, IMM can record the ID as the unique identifier of the story. If you pass an existing ID into the system, IMM updates the story that corresponds to the ID.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "ProjectName",
      "description": "The name of the project. You can obtain the name of the project from the response of the [CreateProject](~~478153~~) operation.",
      "position": "Body",
      "type": "String",
      "required": true
    },
    {
      "name": "StoryEndTime",
      "description": "The end time of the photo collection for which you want to create the story. StoryStartTime and StoryEndTime form a time interval based on which IMM filters candidate photos to generate a story. The value must be a string in the RFC3339 format.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "StoryName",
      "description": "The name of the story.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "StoryStartTime",
      "description": "The start time of the photo collection for which you want to create the story. StoryStartTime and StoryEndTime form a time interval based on which IMM filters candidate photos to generate a story. The value must be a string in the RFC3339 format.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "StorySubType",
      "description": "The subtype of the story. For information about valid subtypes, see [Story types and subtypes](~~2743998~~).",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "StoryType",
      "description": "The type of the story. For information about valid types, see [Story types and subtypes](~~2743998~~).",
      "position": "Body",
      "type": "String",
      "required": true
    },
    {
      "name": "Tags",
      "description": "The tags. You can specify this parameter in one of the following scenarios:\n\n*   Specify tags as custom data, which is returned in messages provided by Simple Message Queue.\n*   Search for tasks by tag.\n*   Specify tags as variables in destination URIs.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "UserData",
      "description": "The custom information, which is returned as asynchronous notifications to facilitate notification management in your system. The maximum information length is 2,048 bytes.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}