{
  "name": "EncodeBlindWatermark",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Content",
      "description": "The text content of watermarks. It can be up to 256 characters in length.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ImageQuality",
      "description": "This parameter takes effect only if the input image format is JPG.\n\nThe storage quality of the output image that carries the watermarks. Default value: 90. Valid values: 70 to 100. The higher the quality, the larger the image size and the higher the watermark resolution quality.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "ProjectName",
      "description": "The name of the project. For more information, see [CreateProject](~~478153~~).",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "SourceURI",
      "description": "The Object Storage Service (OSS) URI of the image.\n\nSpecify the value in the oss://${Bucket}/${Object} format. `${Bucket}` specifies the name of the OSS bucket that resides in the same region with the current project. `${Object}` specifies the path of the object with the extension included.\n\nSupported image formats: JPG, PNG, BMP, TIFF, and WebP.\n\nImage size limit: 10,000 px maximum and 80 px x 80 px minimum.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "StrengthLevel",
      "description": "The watermark strength level. The higher the strength, the more resistant the watermarked image is to attacks, but the more the image is distorted. Default value: low. Valid values: \\[low, medium, high].",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TargetURI",
      "description": "The URI of the output image in OSS.\n\nSpecify the URI in the oss://${Bucket}/${Object} format, where `${Bucket}` is the name of the bucket in the same region as the current project and `${Object}` is the path of the object with the extension included.\n\n> \n\n*   The format of the output image is the same as that of the input image.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}