{
  "name": "GenerateWebofficeToken",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "CachePreview",
      "description": "Cache preview flag: \n- true: When enabled, the document preview will no longer update collaborative editing content, suitable for scenarios where only preview is needed. \n- false: When disabled, it defaults to collaborative preview, allowing the preview to synchronously update collaborative editing content.\n><notice>The price for cache preview and non-cache preview differs. Please refer to the billing item description for more details.</notice> ><notice>Search and print functions are not supported during cache preview.</notice> <notice>Updating cached content is currently not supported in cache preview mode.</notice>",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "CredentialConfig",
      "description": "**If there are no special requirements, leave this blank.**\n\nChained authorization configuration, not required. For more information, see [Using Chained Authorization to Access Other Entity Resources](~~465340~~).",
      "position": "Query",
      "type": "Json",
      "required": false
    },
    {
      "name": "ExternalUploaded",
      "description": "Indicates whether uploading a file with the same name to OSS is an expected behavior. Possible values are as follows:\n\n- true: Uploading a file with the same name to OSS is an expected behavior. The uploaded document will overwrite the original document and generate a new version. After setting it to true, you still need to close the currently editing document and wait for about 5 minutes before reopening it to load the new document. The upload is only effective when the document is closed; if the document is open, the new save will overwrite the uploaded file.\n- false (default): Uploading a file with the same name to OSS is not an expected behavior, and the interface will return an error.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "Filename",
      "description": "Filename, which must include the file extension. By default, it is the last segment of the **SourceURI** parameter.\nSupported file extensions (PDF is only supported for preview):\n- Text documents (Word): doc, docx, txt, dot, wps, wpt, dotx, docm, dotm, rtf \n- Presentation documents (PPT): ppt, pptx, pptm, ppsx, ppsm, pps, potx, potm, dpt, dps - Spreadsheet documents (Excel): et, xls, xlt, xlsx, xlsm, xltx, xltm, csv \n- PDF documents: pdf",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Hidecmb",
      "description": "Whether to hide the toolbar. This parameter can be set in document preview mode. Possible values are as follows:\n\n- false (default): Do not hide the toolbar.\n- true: Hide the toolbar.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "Notification",
      "description": "Notification message configuration, currently supporting only MNS. For the asynchronous notification message format, refer to [WebOffice Message Notification Format](~~2743999~~).\n\n> There will be message notifications when the file is saved or renamed.",
      "position": "Query",
      "type": "Json",
      "required": false
    },
    {
      "name": "NotifyTopicName",
      "description": "Supports notifying some events to customers via MNS messages. This parameter is the topic for MNS asynchronous message notifications.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Password",
      "description": "The password to open the document.\n> If you need to preview or edit a password-protected document, set this parameter.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Permission",
      "description": "User permission information, represented in JSON format.\n\nUser permissions include the following options:\n\nEach option is of type Boolean, with a default value of false, and can be set to true or false.\n\n- Readonly (optional): Preview mode.\n- Rename (optional): File renaming permission, which only provides message notification functionality. The renaming event will be sent to MNS.\n- History (optional): Permission to view historical versions.\n- Copy (optional): Copy permission.\n- Export (optional): PDF export permission.\n- Print (optional): Print permission.\n\n>PDF only supports preview functionality, so the \"Readonly\" parameter must be set to true.\n>\n>PDF files do not support exporting.\n> \n>To use the multi-version feature, you must first enable the multi-version feature in OSS and then set the \"History\" parameter to true.\n>\n><notice>Printing is not supported in cached preview.></notice>\n><notice>Historical versions can be viewed in edit mode but not in preview mode.></notice>",
      "position": "Query",
      "type": "Json",
      "required": false
    },
    {
      "name": "PreviewPages",
      "description": "Limits the number of pages that can be previewed. By default, there is no limit. The maximum cannot exceed 5000.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "ProjectName",
      "description": "Project name, for how to obtain it, please refer to [Create Project](~~478153~~).",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Referer",
      "description": "OSS anti-leeching. IMM needs to obtain the source file from OSS. If OSS has set up anti-leeching, IMM must pass the corresponding header to OSS to get the source file.\n> If the Bucket where the document is located has Referer set, please configure this parameter.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SourceURI",
      "description": "OSS address of the document to be previewed or edited. The OSS address follows the rule `oss://${Bucket}/${Object}`, where `Bucket` is the name of the OSS Bucket in the same region as the current project, and `Object` is the full path of the file including the file extension.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "User",
      "description": "User information. You can pass in user information from the business side, which will be displayed on the WebOffice page.\n\nThe system distinguishes different users by User.Id, and User.Name is used only for front-end display. If User.Id is not provided, the backend will generate a random ID. Users with different IDs are considered different entities and cannot modify or delete each other's comments.\n\nThe default format is: Unknown_random string. If User.Id is not provided, the user information will default to \"Unknown\".",
      "position": "Query",
      "type": "Json",
      "required": false
    },
    {
      "name": "UserData",
      "description": "User-defined information. It only takes effect when Notification parameters are filled in for MNS configuration. It will be returned in asynchronous message notifications, which can help you correlate and process messages within your system. The maximum length is 2048 bytes.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Watermark",
      "description": "Watermark information. The watermark is generated on the front end and is not written into the source document. The same document with different parameters will result in different watermarks.",
      "position": "Query",
      "type": "Json",
      "required": false
    }
  ]
}