{
  "name": "SimpleQuery",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Aggregations",
      "description": "The aggregations.\n\n>  If you perform an aggregate query, the aggregation returned in the response contains only statistical results, not the actual metadata.",
      "position": "Query",
      "type": "Json",
      "required": false,
      "sub_parameters": [
        {
          "name": "Field",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "Operation",
          "position": "Query",
          "type": "String",
          "required": false
        }
      ]
    },
    {
      "name": "DatasetName",
      "description": "The name of the dataset.[](~~478160~~)",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "MaxResults",
      "description": "*   If the Aggregations parameter is not specified, this parameter specifies the maximum number of files that can be returned. Valid values: 1 to 100.\n*   If the Aggregations parameter is specified, this parameter specifies the maximum number of aggregation groups that can be returned. Valid values: 0 to 2000.\n*   If you do not specify this parameter or set the parameter to 0, the default value of 100 is used.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "NextToken",
      "description": "The pagination token is used in the next request to retrieve a new page of results if the total number of results exceeds the value of the MaxResults parameter.\n\nThe next call to the operation returns results lexicographically after the NextToken parameter value.\n\nYou do not need to specify this parameter in your initial request.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Order",
      "description": "The sort order. Valid values:\n\n*   asc: sorts the results in ascending order.\n*   desc: sorts the results in descending order. This is the default value.\n\n*   You can specify multiple sort orders that are separated by commas. Example: asc,desc.\n\n*   The number of elements in the Order parameter must be less than or equal to the number of elements in the Sort parameter. For example, if the value of the Sort parameter is Size,Filename, you can set the Order parameter to desc,asc.\n\n*   If the number of sort orders is less than the number of sort fields, the sort fields for which no sorting orders are explicitly specified use the asc order by default. For example, if you set Sort to Size,Filename and Order to asc, the Filename field defaults to the value of asc.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ProjectName",
      "description": "The name of the project.[](~~478153~~)",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Query",
      "description": "The query conditions.",
      "position": "Query",
      "type": "Json",
      "required": false
    },
    {
      "name": "Sort",
      "description": "The sort fields. For more information, see [Supported fields and operators](~~2743991~~).\n\n> \n\n*   If you specify multiple sort fields, separate them with commas (,), as in Size,Filename.\n\n*   You can specify up to five sort fields.\n\n*   The order of the sort fields determines their precedence in the sorting process.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "WithFields",
      "description": "The fields that you want to include in the response. You can use this parameter to reduce the size of the response.\n\nIf you do not specify this parameter or leave this parameter empty, the operation returns all metadata fields.",
      "position": "Query",
      "type": "Json",
      "required": false
    },
    {
      "name": "WithoutTotalHits",
      "description": "Specifies whether to return the total number of hits. Valid values:\n\n*   true\n*   false",
      "position": "Query",
      "type": "Boolean",
      "required": false
    }
  ]
}