{
  "version": "2020-09-30",
  "style": "rpc",
  "apis": {
    "AddImageMosaic": {
      "title": "AddImageMosaic",
      "summary": "Adds mosaics, Gaussian blurs, or solid color shapes to blur one or more areas of an image for privacy protection and saves the output image to the specified path in Object Storage Service (OSS).",
      "deprecated": false
    },
    "AddStoryFiles": {
      "title": "AddStoryFiles",
      "summary": "Adds objects to a story.",
      "deprecated": false
    },
    "AttachOSSBucket": {
      "title": "AttachOSSBucket",
      "summary": "Binds an Object Storage Service (OSS) bucket to the specified project. The binding enables you to use IMM features by using the x-oss-process parameter.",
      "deprecated": false
    },
    "BatchDeleteFileMeta": {
      "title": "BatchDeleteFileMeta",
      "summary": "Deletes the metadata of multiple files from a dataset.",
      "deprecated": false
    },
    "BatchGetFigureCluster": {
      "title": "BatchGetFigureCluster",
      "summary": "Queries face clusters.",
      "deprecated": false
    },
    "BatchGetFileMeta": {
      "title": "BatchGetFileMeta",
      "summary": "Queries metadata of multiple objects or files in the specified dataset.",
      "deprecated": false
    },
    "BatchIndexFileMeta": {
      "title": "BatchIndexFileMeta",
      "summary": "Indexes metadata of multiple objects into the specified dataset. The process involves data processing operations such as label detection, face detection, and location detection. Metadata indexing helps meet diverse data retrieval requirements.",
      "deprecated": false
    },
    "BatchUpdateFileMeta": {
      "title": "BatchUpdateFileMeta",
      "summary": "Updates some metadata items of files indexed into a dataset.",
      "deprecated": false
    },
    "CompareImageFaces": {
      "title": "CompareImageFaces",
      "summary": "Compares the similarity of the largest faces in two images. The largest face refers to the largest face frame in an image after face detection.",
      "deprecated": false
    },
    "ContextualAnswer": {
      "title": "ContextualAnswer",
      "summary": "Phase II of AI Assistant, Q\\\\\\&A API",
      "deprecated": false
    },
    "ContextualRetrieval": {
      "title": "ContextualRetrieval",
      "summary": "Retrieves semantically similar documents. The operation is designed for multi-turn conversations and can process message input in historical conversations. The operation returns results that are highly related to the current conversation based on an in-depth understanding of contextual content. It provides consistent and efficient information retrieval in multi-turn conversations.",
      "deprecated": false
    },
    "CreateArchiveFileInspectionTask": {
      "title": "CreateArchiveFileInspectionTask",
      "summary": "Creates an archive file inspection task to preview the files in a package without decompressing the package.",
      "deprecated": false
    },
    "CreateBatch": {
      "title": "CreateBatch",
      "summary": "Creates a batch processing task to perform a data processing operation, such as transcoding or format conversion, on multiple existing files at a time.",
      "deprecated": false
    },
    "CreateBinding": {
      "title": "CreateBinding",
      "summary": "Creates a binding relationship between a dataset and an Object Storage Service (OSS) bucket. This allows for the automatic synchronization of incremental and full data and indexing.",
      "deprecated": false
    },
    "CreateCompressPointCloudTask": {
      "title": "CreateCompressPointCloudTask",
      "summary": "Compresses point cloud data (PCD) in Object Storage Service (OSS) to reduce the amount of data transferred over networks.",
      "deprecated": false
    },
    "CreateCustomizedStory": {
      "title": "CreateCustomizedStory",
      "summary": "Creates a story based on the specified images and videos.",
      "deprecated": false
    },
    "CreateDataset": {
      "title": "CreateDataset",
      "summary": "Creates a dataset.",
      "deprecated": false
    },
    "CreateDecodeBlindWatermarkTask": {
      "title": "CreateDecodeBlindWatermarkTask",
      "summary": "Decodes the blind watermark in an image.",
      "deprecated": false
    },
    "CreateFacesSearchingTask": {
      "title": "CreateFacesSearchingTask",
      "summary": "Searches the dataset for the specified number of images most similar to the specified image or face and returns face IDs and boundaries in descending order of similarity.",
      "deprecated": false
    },
    "CreateFigureClusteringTask": {
      "title": "CreateFigureClusteringTask",
      "summary": "Creates a face clustering task to cluster faces of different persons in images by person based on the intelligent algorithms.",
      "deprecated": false
    },
    "CreateFigureClustersMergingTask": {
      "title": "CreateFigureClustersMergingTask",
      "summary": "Merges two or more face clustering groups into one face clustering group.",
      "deprecated": false
    },
    "CreateFileCompressionTask": {
      "title": "CreateFileCompressionTask",
      "summary": "Creates a file packing task.",
      "deprecated": false
    },
    "CreateFileUncompressionTask": {
      "title": "CreateFileUncompressionTask",
      "summary": "Extracts the specified files from a ZIP, RAR, or 7z package to the specified directory or decompresses the entire package.",
      "deprecated": false
    },
    "CreateImageModerationTask": {
      "title": "CreateImageModerationTask",
      "summary": "Creates an image moderation task to ensure image content compliance. You can call this operation to identify inappropriate content, such as pornography, violence, terrorism, politically sensitive content, undesirable scenes, unauthorized logos, and non-compliant ads.",
      "deprecated": false
    },
    "CreateImageSplicingTask": {
      "title": "CreateImageSplicingTask",
      "summary": "Creates an image splicing task. You can call this operation to splice multiple images into one based on a given rule and save the final image into an Object Storage Service (OSS) bucket.",
      "deprecated": false
    },
    "CreateImageToPDFTask": {
      "title": "CreateImageToPDFTask",
      "summary": "Converts multiple images into one single PDF file and stores the PDF file to the specified path in Object Storage Service (OSS).",
      "deprecated": false
    },
    "CreateLocationDateClusteringTask": {
      "title": "CreateLocationDateClusteringTask",
      "summary": "Creates a spatiotemporal clustering task to cluster photos and videos based on geolocation and time information. Spatiotemporal clustering allows you to group photos and videos taken during a travel or at different places by their spatial and temporal similarity. Based on spatiotemporal clustering, you can develop media capabilities such as media file categorization, photo collections, and image and video-based stories.",
      "deprecated": false
    },
    "CreateMediaConvertTask": {
      "title": "CreateMediaConvertTask",
      "summary": "Creates an asynchronous media transcoding task to provide audio and video file processing abilities, such as media transcoding, media splicing, video frame capturing, and video to GIF conversion.",
      "deprecated": false
    },
    "CreateOfficeConversionTask": {
      "title": "CreateOfficeConversionTask",
      "summary": "Creates a document format conversion task to convert the format of a document stored in an Object Storage Service (OSS) bucket.",
      "deprecated": false
    },
    "CreateProject": {
      "title": "CreateProject",
      "summary": "Creates a project.",
      "deprecated": false
    },
    "CreateSimilarImageClusteringTask": {
      "title": "CreateSimilarImageClusteringTask",
      "summary": "Clusters images indexed into a dataset by similarity. Image clustering is suitable for image deduplication and selection. For example, you can use image clustering to filter photos in your album that are taken in continuous shooting mode.",
      "deprecated": false
    },
    "CreateStory": {
      "title": "CreateStory",
      "summary": "Creates a story.",
      "deprecated": false
    },
    "CreateTrigger": {
      "title": "CreateTrigger",
      "summary": "Creates a trigger. A trigger can trigger Intelligent Media Management (IMM) based on events such as events in Object Storage Service (OSS) to process files, such as images, videos, and documents based on data processing templates.",
      "deprecated": false
    },
    "CreateVideoLabelClassificationTask": {
      "title": "CreateVideoLabelClassificationTask",
      "summary": "Detects the scene, object, and event tag information of video content. Scene information includes categories such as natural landscapes, life scenes, and disaster scenes. Event information includes categories such as talent shows, office events, performances, and production events. Object information includes categories such as tableware, electronic products, furniture, and transportation. Video tag detection supports more than 30 tag categories and thousands of tags.",
      "deprecated": false
    },
    "CreateVideoModerationTask": {
      "title": "CreateVideoModerationTask",
      "summary": "Detects risky or non-compliant content from videos. You can use this operation in scenarios such as intelligent pornography detection, terrorist content and political bias detection, ad violation detection, and logo detection.",
      "deprecated": false
    },
    "DeleteBatch": {
      "title": "DeleteBatch",
      "summary": "Deletes a batch processing task.",
      "deprecated": false
    },
    "DeleteBinding": {
      "title": "DeleteBinding",
      "summary": "Deletes the binding between a dataset and an Object Storage Service (OSS) bucket.",
      "deprecated": false
    },
    "DeleteDataset": {
      "title": "DeleteDataset",
      "summary": "Deletes a dataset.",
      "deprecated": false
    },
    "DeleteFileMeta": {
      "title": "DeleteFileMeta",
      "summary": "Removes the metadata of a file from a dataset.",
      "deprecated": false
    },
    "DeleteLocationDateCluster": {
      "title": "DeleteLocationDateCluster",
      "summary": "Deletes a spatiotemporal cluster.",
      "deprecated": false
    },
    "DeleteProject": {
      "title": "DeleteProject",
      "summary": "Deletes a project.",
      "deprecated": false
    },
    "DeleteStory": {
      "title": "DeleteStory",
      "summary": "Deletes a story.",
      "deprecated": false
    },
    "DeleteTrigger": {
      "title": "DeleteTrigger",
      "summary": "Deletes a trigger.",
      "deprecated": false
    },
    "DetachOSSBucket": {
      "title": "DetachOSSBucket",
      "summary": "Unbinds an Object Storage Service (OSS) bucket from the corresponding project.",
      "deprecated": false
    },
    "DetectImageBodies": {
      "title": "DetectImageBodies",
      "summary": "Detects human body information, such as the confidence level and body bounding box, in an image.",
      "deprecated": false
    },
    "DetectImageCars": {
      "title": "DetectImageCars",
      "summary": "Detects the outline data, attributes, and license plate information of vehicles in an image. The vehicle attributes include the vehicle color (CarColor) and vehicle type (CarType). The license plate information includes the recognition content (Content) and plate frame (Boundary).",
      "deprecated": false
    },
    "DetectImageCodes": {
      "title": "DetectImageCodes",
      "summary": "Detects barcodes and QR codes in an image.",
      "deprecated": false
    },
    "DetectImageCropping": {
      "title": "DetectImageCropping",
      "summary": "Detects the cropping area that produces the optimal visual effect based on a given image ratio by using AI model capabilities.",
      "deprecated": false
    },
    "DetectImageFaces": {
      "title": "DetectImageFaces",
      "summary": "Detects faces from an image, including face boundary information, attributes, and quality. The boundary information includes the distance from the y-coordinate of the vertex to the top edge (Top), distance from the x-coordinate of the vertex to the left edge (Left), height (Height), and width (Width). Face attributes include the age (Age), age standard deviation (AgeSD), gender (Gender), emotion (Emotion), mouth opening (Mouth), beard (Beard), hat wearing (Hat), mask wearing (Mask), glasses wearing (Glasses), head orientation (HeadPose), attractiveness (Attractive), and confidence levels for preceding attributes. Quality information includes the face quality score (FaceQuality) and face resolution (Sharpness).",
      "deprecated": false
    },
    "DetectImageLabels": {
      "title": "DetectImageLabels",
      "summary": "Detects scene, object, and event information in an image. Scene information includes natural landscapes, daily life, and disasters. Event information includes talent shows, office events, performances, and production events. Object information includes tableware, electronics, furniture, and transportation. The DetectImageLabels operation supports more than 30 different categories and thousands of labels.",
      "deprecated": false
    },
    "DetectImageScore": {
      "title": "DetectImageScore",
      "summary": "Calculates the aesthetics quality score of an image based on metrics such as the composition, brightness, contrast, color, and resolution. The operation returns a score within the range from 0 to 1. A higher score indicates better image quality.",
      "deprecated": false
    },
    "DetectImageTexts": {
      "title": "DetectImageTexts",
      "summary": "Recognizes and extracts text content from an image.",
      "deprecated": false
    },
    "DetectMediaMeta": {
      "title": "DetectMediaMeta",
      "summary": "Queries media metadata, including the media format and stream information.",
      "deprecated": false
    },
    "DetectTextAnomaly": {
      "title": "DetectTextAnomaly",
      "summary": "Detects whether specified text contains anomalies, such as pornography, advertisements, excessive junk content, politically sensitive content, and abuse.",
      "deprecated": false
    },
    "EncodeBlindWatermark": {
      "title": "EncodeBlindWatermark",
      "summary": "Embeds specific textual information into an image as watermarks. These watermarks are visually imperceptible and do not affect the aesthetics of the image or the integrity of the original data. The watermarks can be extracted by using the CreateDecodeBlindWatermarkTask operation.",
      "deprecated": false
    },
    "ExtractDocumentText": {
      "title": "Extract Document Text",
      "summary": "Extract text from the document",
      "deprecated": false
    },
    "FuzzyQuery": {
      "title": "FuzzyQuery",
      "summary": "Queries the extracted file metadata, including the file name, labels, path, custom tags, text, and other fields. If the value of a metadata field of a file matches the specified string, the metadata of the file is returned.",
      "deprecated": false
    },
    "GenerateVideoPlaylist": {
      "title": "GenerateVideoPlaylist",
      "summary": "Generates a live transcoding playlist and converts video files into M3U8 files. After a playlist is generated, the videos in the playlist are immediately played and the video files are transcoded based on the playback progress. Compared with offline transcoding, online transcoding significantly reduces the time spent in waiting for the videos to be transcoded and reduces transcoding and storage costs.",
      "deprecated": false
    },
    "GenerateWebofficeToken": {
      "title": "Obtain Weboffice Token",
      "summary": "Obtain Document Preview and Edit Token",
      "deprecated": false
    },
    "GetBatch": {
      "title": "GetBatch",
      "summary": "Queries the information about a batch processing task.",
      "deprecated": false
    },
    "GetBinding": {
      "title": "GetBinding",
      "summary": "Queries the binding relationship between a specific dataset and an Object Storage Service (OSS) bucket.",
      "deprecated": false
    },
    "GetDataset": {
      "title": "GetDataset",
      "summary": "Queries a dataset.",
      "deprecated": false
    },
    "GetDecodeBlindWatermarkResult": {
      "title": "GetDecodeBlindWatermarkResult",
      "summary": "Queries the result of an invisible watermark parsing task.",
      "deprecated": false
    },
    "GetFigureCluster": {
      "title": "GetFigureCluster",
      "summary": "Obtains basic information about face clustering, including the creation time, number of images, and cover.",
      "deprecated": false
    },
    "GetFileMeta": {
      "title": "GetFileMeta",
      "summary": "Queries metadata of a file whose metadata is indexed into the dataset.",
      "deprecated": false
    },
    "GetImageModerationResult": {
      "title": "GetImageModerationResult",
      "summary": "Queries an image compliance detection task.",
      "deprecated": false
    },
    "GetOSSBucketAttachment": {
      "title": "GetOSSBucketAttachment",
      "summary": "Queries the name of the project bound to an Object Storage Service (OSS) bucket.",
      "deprecated": false
    },
    "GetProject": {
      "title": "GetProject",
      "summary": "Queries the basic information, datasets, and file statistics of a project.",
      "deprecated": false
    },
    "GetStory": {
      "title": "GetStory",
      "summary": "Queries a story.",
      "deprecated": false
    },
    "GetTask": {
      "title": "GetTask",
      "summary": "Queries information about an asynchronous task. Intelligent Media Management (IMM) has multiple asynchronous data processing capabilities, each of which has its own operation for creating tasks. For example, you can call the CreateFigureClusteringTask operation to create a face clustering task and the CreateFileCompressionTask operation to create a file compression task. The GetTask operation is a general operation. You can call this operation to query information about asynchronous tasks by task ID or type.",
      "deprecated": false
    },
    "GetTrigger": {
      "title": "GetTrigger",
      "summary": "Queries the information about a trigger.",
      "deprecated": false
    },
    "GetVideoLabelClassificationResult": {
      "title": "GetVideoLabelClassificationResult",
      "summary": "Queries the results of a video label detection task.",
      "deprecated": false
    },
    "GetVideoModerationResult": {
      "title": "GetVideoModerationResult",
      "summary": "Queries the result of a video moderation task.",
      "deprecated": false
    },
    "IndexFileMeta": {
      "title": "IndexFileMeta",
      "summary": "Creates an index from metadata extracted by using techniques such as label recognition, face detection, and location detection from input files. You can retrieve data from the same dataset by using multiple methods.",
      "deprecated": false
    },
    "ListAttachedOSSBuckets": {
      "title": "List OSS Bucket Binding Relationships",
      "summary": "List bound attachments",
      "deprecated": false
    },
    "ListBatches": {
      "title": "ListBatches",
      "summary": "Queries batch processing tasks. You can query batch processing tasks based on conditions such task tags and status. The results can be sorted.",
      "deprecated": false
    },
    "ListBindings": {
      "title": "ListBindings",
      "summary": "Queries bindings between a dataset and Object Storage Service (OSS) buckets.",
      "deprecated": false
    },
    "ListDatasets": {
      "title": "ListDatasets",
      "summary": "Queries a list of datasets. You can query the list by dataset prefix.",
      "deprecated": false
    },
    "ListProjects": {
      "title": "ListProjects",
      "summary": "Queries projects. You can call this operation to query the basic information, datasets, and file statistics of multiple projects at the same time.",
      "deprecated": false
    },
    "ListRegions": {
      "title": "List of Regions Supporting IMM Service",
      "summary": "Get the list of regions",
      "deprecated": false
    },
    "ListTasks": {
      "title": "ListTasks",
      "summary": "Lists tasks based on specific conditions, such as by time range and by tag.",
      "deprecated": false
    },
    "ListTriggers": {
      "title": "ListTriggers",
      "summary": "Queries triggers by tag or status.",
      "deprecated": false
    },
    "QueryFigureClusters": {
      "title": "QueryFigureClusters",
      "summary": "Queries face groups based on given conditions.",
      "deprecated": false
    },
    "QueryLocationDateClusters": {
      "title": "QueryLocationDateClusters",
      "summary": "Queries a list of spatiotemporal clusters based on the specified conditions.",
      "deprecated": false
    },
    "QuerySimilarImageClusters": {
      "title": "QuerySimilarImageClusters",
      "summary": "You can call this operation to query the list of similar image clusters.",
      "deprecated": false
    },
    "QueryStories": {
      "title": "QueryStories",
      "summary": "Queries stories based on the specified conditions.",
      "deprecated": false
    },
    "RefreshWebofficeToken": {
      "title": "Refresh Weboffice Token",
      "summary": "Refresh Document Preview and Editing Token",
      "deprecated": false
    },
    "RemoveStoryFiles": {
      "title": "RemoveStoryFiles",
      "summary": "Deletes files from a story.",
      "deprecated": false
    },
    "ResumeBatch": {
      "title": "ResumeBatch",
      "summary": "Resumes a batch processing task that is in the Suspended or Failed state.",
      "deprecated": false
    },
    "ResumeTrigger": {
      "title": "ResumeTrigger",
      "summary": "Resumes a trigger that is in the Suspended or Failed state.",
      "deprecated": false
    },
    "SearchImageFigureCluster": {
      "title": "SearchImageFigureCluster",
      "summary": "Queries face clusters that contain a specific face in an image. Each face cluster contains information such as bounding boxes and similarity.",
      "deprecated": false
    },
    "SemanticQuery": {
      "title": "SemanticQuery",
      "summary": "Queries metadata in a dataset by inputting natural language.",
      "deprecated": false
    },
    "SimpleQuery": {
      "title": "SimpleQuery",
      "summary": "Queries files in a dataset by performing a simple query operation. The operation supports logical expressions.",
      "deprecated": false
    },
    "SuspendBatch": {
      "title": "SuspendBatch",
      "summary": "Suspends a batch processing task.",
      "deprecated": false
    },
    "SuspendTrigger": {
      "title": "SuspendTrigger",
      "summary": "Suspends a running trigger.",
      "deprecated": false
    },
    "UpdateBatch": {
      "title": "UpdateBatch",
      "summary": "Updates information about a batch processing task, including the input data source, data processing settings, and tags.",
      "deprecated": false
    },
    "UpdateDataset": {
      "title": "Update Dataset",
      "summary": "Update Media Set",
      "deprecated": false
    },
    "UpdateFigureCluster": {
      "title": "UpdateFigureCluster",
      "summary": "Updates information about a face cluster, such as the cluster name and labels.",
      "deprecated": false
    },
    "UpdateFileMeta": {
      "title": "UpdateFileMeta",
      "summary": "Updates the partial metadata of the indexed files in a dataset.",
      "deprecated": false
    },
    "UpdateLocationDateCluster": {
      "title": "UpdateLocationDateCluster",
      "summary": "Updates a spatiotemporal cluster.",
      "deprecated": false
    },
    "UpdateProject": {
      "title": "UpdateProject",
      "summary": "Updates information about a project.",
      "deprecated": false
    },
    "UpdateStory": {
      "title": "UpdateStory",
      "summary": "Updates the information about a story, such as the story name and cover image.",
      "deprecated": false
    },
    "UpdateTrigger": {
      "title": "UpdateTrigger",
      "summary": "Updates information about a trigger, such as the input data source, data processing settings, and tags.",
      "deprecated": false
    }
  }
}