{
  "name": "ListDoctorComputeSummary",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ClusterId",
      "description": "The cluster ID.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ComponentTypes",
      "description": "The resource types, which are used to filter query results. Valid values:\n\n*   engine: filters results by engine.\n*   queue: filters results by queue.\n*   cluster: displays the results at the cluster level.\n\nIf you do not specify this parameter, the information at the cluster level is displayed by default. Currently, only one resource type is supported. If you specify multiple resource types, the first resource type is used by default.",
      "position": "Query",
      "type": "Array",
      "required": false
    },
    {
      "name": "DateTime",
      "description": "Specify the date in the ISO 8601 standard. For example, 2023-01-01 represents January 1, 2023.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "MaxResults",
      "description": "The maximum number of entries to return on each page.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "NextToken",
      "description": "The pagination token that is used in the request to retrieve a new page of results.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "OrderBy",
      "description": "The basis on which you want to sort the query results. Valid values:\n\n1.  vcoreSeconds: the total CPU consumption over time in seconds.\n2.  memSeconds: the total memory consumption over time in seconds.\n3.  vcoreUtilization: the average CPU utilization. The meaning is the same as the %CPU parameter in the output of the top command in Linux.\n4.  memUtilization: the average memory usage.\n5.  vcoreSecondsDayGrowthRatio: the day-to-day growth rate of the total CPU consumption over time in seconds.\n6.  memSecondsDayGrowthRatio: the day-to-day growth rate of the total memory consumption over time in seconds.\n7.  readSize: the total amount of data read from the file system.\n8.  writeSize: the total amount of data written to the file system.\n9.  healthyJobCount: the total number of healthy jobs.\n10. subHealthyJobCount: the total number of sub-healthy jobs.\n11. unhealthyJobCount: the total number of unhealthy jobs.\n12. needAttentionJobCount: the total number of jobs that require attention.\n13. score: the score for jobs.\n14. scoreDayGrowthRatio: the day-to-day growth rate of the score for jobs.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "OrderType",
      "description": "The order in which you want to sort the query results. Valid values:\n\n*   ASC: in ascending order.\n*   DESC: in descending order.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}