{
  "name": "ListDoctorHiveTables",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ClusterId",
      "description": "The cluster ID.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "DateTime",
      "description": "Specify the date in the ISO 8601 standard. For example, 2023-01-01 represents January 1, 2023.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "MaxResults",
      "description": "The maximum number of entries to return on each page.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "NextToken",
      "description": "The pagination token that is used in the request to retrieve a new page of results.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "OrderBy",
      "description": "The basis on which you want to sort the query results. Valid values:\n\n*   partitionNum: the number of partitions.\n*   totalFileCount: the total number of files.\n*   largeFileCount: the number of large files. Large files are those with a size greater than 1 GB.\n*   mediumFileCount: the number of medium files. Medium files are those with a size greater than or equal to 128 MB and less than or equal to 1 GB.\n*   smallFileCount: the number of small files. Small files are those with a size greater than or equal to 10 MB and less than 128 MB.\n*   tinyFileCount: the number of very small files. Very small files are those with a size greater than 0 MB and less than 10 MB.\n*   emptyFileCount: the number of empty files. Empty files are those with a size of 0 MB.\n*   largeFileRatio: the proportion of large files. Large files are those with a size greater than 1 GB.\n*   mediumFileRatio: the proportion of medium files. Medium files are those with a size greater than or equal to 128 MB and less than or equal to 1 GB.\n*   smallFileRatio: the proportion of small files. Small files are those with a size greater than or equal to 10 MB and less than 128 MB.\n*   tinyFileRatio: the proportion of very small files. Very small files are those with a size greater than 0 MB and less than 10 MB.\n*   emptyFileRatio: the proportion of empty files. Empty files are those with a size of 0 MB.\n*   hotDataSize: the amount of hot data. Hot data refers to data that is accessed in previous seven days.\n*   WarmDataSize: the amount of warm data. Warm data refers to data that is not accessed for more than 7 days but is accessed in previous 30 days.\n*   coldDataSize: the amount of cold data. Cold data refers to data that is not accessed for more than 30 days but is accessed in previous 90 days.\n*   freezeDataSize: the amount of very cold data. Very cold data refers to data that is not accessed for more than 90 days.\n*   totalDataSize: the total amount of data.\n*   hotDataRatio: the proportion of hot data. Hot data refers to data that is accessed in previous seven days.\n*   WarmDataRatio: the proportion of warm data. Warm data refers to data that is not accessed for more than 7 days but is accessed in previous 30 days.\n*   coldDataRatio: the proportion of cold data. Cold data refers to data that is not accessed for more than 30 days but is accessed in previous 90 days.\n*   freezeDataRatio: the proportion of very cold data. Very cold data refers to data that is not accessed for more than 90 days.\n*   totalFileDayGrowthCount: the daily increment of the total number of files.\n*   largeFileDayGrowthCount: the daily increment of the number of large files. Large files are those with a size greater than 1 GB.\n*   mediumFileDayGrowthCount: the daily increment of the number of medium files. Medium files are those with a size greater than or equal to 128 MB and less than or equal to 1 GB.\n*   smallFileDayGrowthCount: the daily increment of the number of small files. Small files are those with a size greater than or equal to 10 MB and less than 128 MB.\n*   tinyFileDayGrowthCount: the daily increment of the number of very small files. Very small files are those with a size greater than 0 MB and less than 10 MB.\n*   emptyFileDayGrowthCount: the daily increment of the number of empty files. Empty files are those with a size of 0 MB.\n*   hotDataDayGrowthSize: the daily increment of the amount of hot data. Hot data refers to data that is accessed in previous seven days.\n*   warmDataDayGrowthSize: the daily increment of the amount of warm data. Warm data refers to data that is not accessed for more than 7 days but is accessed in previous 30 days.\n*   coldDataDayGrowthSize: the daily increment of the amount of cold data. Cold data refers to data that is not accessed for more than 30 days but is accessed in previous 90 days.\n*   freezeDataDayGrowthSize: the daily increment of the amount of very cold data. Very cold data refers to data that is not accessed for more than 90 days.\n*   totalDataDayGrowthSize: the daily increment of the amount of total data.\n*   totalFileCountDayGrowthRatio: the day-to-day growth rate of the total number of files.\n*   largeFileCountDayGrowthRatio: the day-to-day growth rate of the number of large files. Large files are those with a size greater than 1 GB.\n*   mediumFileCountDayGrowthRatio: the day-to-day growth rate of the number of medium files. Medium files are those with a size greater than or equal to 128 MB and less than or equal to 1 GB.\n*   smallFileCountDayGrowthRatio: the day-to-day growth rate of the number of small files. Small files are those with a size greater than or equal to 10 MB and less than 128 MB.\n*   tinyFileCountDayGrowthRatio: the day-to-day growth rate of the number of very small files. Very small files are those with a size greater than 0 MB and less than 10 MB.\n*   emptyFileCountDayGrowthRatio: the day-to-day growth rate of the number of empty files. Empty files are those with a size of 0 MB.\n*   hotDataSizeDayGrowthRatio: the day-to-day growth rate of the amount of hot data. Hot data refers to data that is accessed in previous seven days.\n*   warmDataSizeDayGrowthRatio: the day-to-day growth rate of the amount of warm data. Warm data refers to data that is not accessed for more than 7 days but is accessed in previous 30 days.\n*   coldDataSizeDayGrowthRatio: the day-to-day growth rate of the amount of cold data. Cold data refers to data that is not accessed for more than 30 days but is accessed in previous 90 days.\n*   freezeDataSizeDayGrowthRatio: the day-to-day growth rate of the amount of very cold data. Very cold data refers to data that is not accessed for more than 90 days.\n*   totalDataSizeDayGrowthRatio: the day-to-day growth rate of the total amount of data.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "OrderType",
      "description": "The order in which you want to sort the query results. Valid value:\n\n*   ASC: in ascending order\n*   DESC: in descending order",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "TableNames",
      "description": "The table names, which are used to filter the query results.",
      "position": "Query",
      "type": "Array",
      "required": false
    }
  ]
}