{
  "name": "ConfigLayer4RulePolicy",
  "deprecated": false,
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Listeners",
      "description": "The port forwarding rule that you want to manage.\n\nThis parameter is a string that consists of JSON arrays. Each element in a JSON array indicates a port forwarding rule. You can perform this operation only on one port forwarding rule at a time.\n\n> You can call the [DescribeNetworkRules](~~157484~~) to query existing port forwarding rules.\n\nEach port forwarding rule contains the following fields:\n\n*   **InstanceId**: the ID of the instance. This field is required and must be of the STRING type.\n\n*   **Protocol**: the forwarding protocol. This field is required and must be of the STRING type. Valid values: **tcp** and **udp**.\n\n*   **FrontendPort**: the forwarding port. This field is required and must be of the INTEGER type.\n\n*   **BackendPort**: the port of the origin server. This field is required and must be of the INTEGER type.\n\n*   **PriRealServers**: the IP addresses of the primary origin server. This field is required and must be a JSON array. Each element in a JSON array indicates an IP address of the primary origin server. You can configure a maximum of 20 IP addresses.\n\n    Each element in the JSON array contains the following field:\n\n    *   **RealServer**: the IP address of the primary origin server. This field is required and must be of the STRING type.\n\n*   **SecRealServers**: the IP addresses of the secondary origin server. This field is required and must be a JSON array. Each element in a JSON array indicates an IP address of the secondary origin server. You can configure a maximum of 20 IP addresses.\n\n    Each element in the JSON array contains the following field:\n\n    *   **RealServer**: the IP address of the secondary origin server. This field is required and must be of the STRING type.\n\n*   **CurrentRsIndex**: the origin server that you want to use to receive service traffic. This field is required and must be of the INTEGER type. Valid values:\n\n    *   **1**: the primary origin server, which indicates that Anti-DDoS Pro or Anti-DDoS Premium forwards service traffic to the IP addresses of the primary origin server.\n    *   **2**: the secondary origin server, which indicates that Anti-DDoS Pro or Anti-DDoS Premium forwards service traffic to the IP addresses of the secondary origin server.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}