{
  "name": "ConfigL7RsPolicy",
  "deprecated": false,
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Domain",
      "description": "The domain name of the website.\n\n> A forwarding rule must be configured for the domain name. You can call the [DescribeDomains](~~91724~~) operation to query the domain names for which forwarding rules are configured.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Policy",
      "description": "The back-to-origin policy. The value is a string that consists of a JSON struct. The JSON struct contains the following fields:\n\n*   **ProxyMode**: The load balancing algorithm for back-to-origin traffic. This field is required and must be a string. Valid values:\n\n    *   **ip_hash**: the IP hash algorithm. This algorithm is used to redirect the requests from the same IP address to the same origin server.\n    *   **rr**: the round-robin algorithm. This algorithm is used to redirect requests to origin servers in turn. If you use this algorithm, you can specify a weight for each server based on server performance.\n    *   **least_time**: the least response time algorithm. This algorithm is used to minimize the latency when requests are forwarded from Anti-DDoS Pro or Anti-DDoS Premium instances to origin servers based on the intelligent DNS resolution feature.\n\n*   **Attributes**: the parameters for back-to-origin. This field is optional and must be a JSON array. Each element in the array contains the following fields:\n\n    *   **RealServer**: the address of the origin server. This field is optional and must be a string.\n\n    *   **Attribute**: the parameter for back-to-origin. This field is optional and must be a JSON object. The value contains the following field:\n\n        *   **Weight**: the weight of the server. This field is optional and must be an integer. This field takes effect only when **ProxyMode** is set to **rr**. Valid values: **1** to **100**. Default value: **100**. An origin server with a higher weight receives more requests.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ResourceGroupId",
      "description": "The ID of the resource group to which the instance belongs in Resource Management. This parameter is empty by default, which indicates that the instance belongs to the default resource group.\n\nFor more information about resource groups, see [Create a resource group](~~94485~~).",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}