{
  "name": "ConfigWebCCRuleV2",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Domain",
      "description": "",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Expires",
      "description": "",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "RuleList",
      "description": "The frequency control rule. This parameter is a JSON string that contains the following fields:\n\n*   **action**: the action that is performed if the rule is matched. This field is required and must be of the string type. Valid values:\n\n    *   **block**: The requests that match the rule are blocked.\n    *   **challenge**: Completely Automated Public Turing test to tell Computers and Humans Apart (CAPTCHA) verification for the requests that match the rule is implemented.\n    *   **watch**: The requests that match the rule are recorded in logs and allowed.\n\n*   **name**: the name of the rule. This field is required and must be of the string type.\n\n*   **condition**: the match conditions. This field is required and must be of the map type. This field contains the following parameters:\n\n    **\n\n    **Note** The AND logical operator is used to evaluate multiple match conditions.\n\n    *   **field**: the match field. This field is required and must be of the string type.\n\n    *   **match_method**: the logical relation. This field is required and must be of the string type.\n\n        **\n\n        **Note** For information about the mappings between the **field** and **match_method** parameters, see the \"Mappings between the field and match_method parameters\" section of this topic.\n\n    *   **header_name**: the name of the custom HTTP header. This field is optional and must be of the string type.\n\n        **\n\n        **Note** This field is required only when **field** is set to **header**.\n\n    *   **content**: the match content. This field is required and must be of the string type.\n\n*   **ratelimit**: the frequency control field. This field is optional and must be of the string type. The frequency can be measured based on IP addresses or custom headers. This field contains the following parameters:\n\n    *   **interval**: the statistical duration. Unit: seconds. This field is required and must be of the integer type.\n    *   **ttl**: the period during which the specified action is performed. Unit: seconds. This field is required and must be of the integer type.\n    *   **threshold**: the threshold. This field is required and must be of the integer type.\n    *   **subkey**: the name of the field. This field is optional and must be of the string type. This field is required only when target is set to header.\n    *   **target**: the statistical source. This field is required and must be of the string type. Valid values: ip and header.\n\n*   **status_code**: the frequency control field. This field is optional and must be of the string type. Frequency control can be performed based on the quantity or percentage of status codes. This field contains the following parameters:\n\n    *   **enabled**: specifies whether to enable status code statistics. This field is required and must be of the Boolean type.\n    *   **code**: the status code. This field is required and must be of the integer type. Valid values: **100** to **599**.\n    *   **use_ratio**: specifies whether to use a ratio. This field is required and must be of the Boolean type. To use a ratio, set this field to true.\n    *   **ratio_threshold**: the ratio of the status code. This field is optional and must be of the integer type. If a ratio is used, the action specified in the rule is performed only when the ratio of the status code reaches **ratio_threshold**. Valid values: **1** to **100**.\n    *   **count_threshold**: the quantity of the status code. This field is optional and must be of the integer type. If a ratio is not used, the action specified in the rule is performed only when the quantity of the status code reaches **count_threshold**. Valid values: **2** to **50000**.\n\n*   **statistics**: specifies whether deduplication is used for statistics. This field is optional and must be of the string type. By default, deduplication is not used for statistics. This field contains the following parameters:\n\n    *   **mode**: specifies whether deduplication is used for status code statistics. This field is required and must be of the string type. Valid values:\n\n        *   **count**: Deduplication is not used for statistics.\n        *   **distinct**: Deduplication is used for statistics.\n\n    *   **field**: the statistical source. This field is required and must be of the string type. Valid values: ip, header, and uri.\n\n    *   **header_name**: the name of the header. This field is optional and must be of the string type. This field is required only when field is set to header.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}