{
  "name": "DescribePortFlowList",
  "deprecated": false,
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "EndTime",
      "description": "The end of the time range to query. The value is a UNIX timestamp. Unit: seconds.\n\n**\n\n**This UNIX timestamp must indicate a point in time that is accurate to the minute.",
      "position": "Query",
      "type": "Long",
      "required": true
    },
    {
      "name": "InstanceIds",
      "description": "An array that consists of the IDs of instances.",
      "position": "Query",
      "type": "RepeatList",
      "required": true
    },
    {
      "name": "Interval",
      "description": "The interval for returning data. Unit: seconds. The interval that you can specify varies based on the time range to query. The time range to query is determined by the values of **StartTime** and **EndTime**.\n\n*   If the time range to query is no greater than 1 hour, we recommend that you specify the interval from 60 seconds to the time range to query.\n*   If the time range to query is greater than 1 hour but no greater than 6 hours, we recommend that you specify the interval from 600 seconds to the time range to query.\n*   If the time range to query is greater than 6 hours but no greater than 24 hours, we recommend that you specify the interval from 1,800 seconds to the time range to query.\n*   If the time range to query is greater than 24 hours but no greater than 7 days, we recommend that you specify the interval from 3,600 seconds to the time range to query.\n*   If the time range to query is greater than 7 days but no greater than 15 days, we recommend that you specify the interval from 14,400 seconds to the time range to query.\n*   If the time range to query is greater than 15 days, we recommend that you specify the interval from 43,200 seconds to the time range to query.",
      "position": "Query",
      "type": "Integer",
      "required": true
    },
    {
      "name": "ResourceGroupId",
      "description": "The ID of the resource group to which the instance belongs in Resource Management. This parameter is empty by default, which indicates that the instance belongs to the default resource group.\n\nFor more information about resource groups, see [Create a resource group](~~94485~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "StartTime",
      "description": "The beginning of the time range to query. The value is a UNIX timestamp. Unit: seconds.\n\n**\n\n**This UNIX timestamp must indicate a point in time that is accurate to the minute.",
      "position": "Query",
      "type": "Long",
      "required": true
    }
  ]
}