{
  "name": "ModifyWebRule",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Domain",
      "description": "The domain name of the website.\n\n>  A forwarding rule must be configured for the domain name. You can call the [DescribeDomains](~~91724~~) operation to query the domain names for which forwarding rules are configured.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "HttpsExt",
      "description": "The advanced HTTPS settings. This parameter takes effect only when the value of **ProxyType** includes **https**. The value is a string that consists of a JSON struct. The JSON struct contains the following fields:\n\n*   **Http2https**: specifies whether to turn on Enforce HTTPS Routing. This field is optional and must be an integer. Valid values: **0** and **1**. The value 0 indicates that Enforce HTTPS Routing is turned off. The value 1 indicates that Enforce HTTPS Routing is turned on. The default value is 0.\n\n    If your website supports both HTTP and HTTPS, this feature suits your needs. If you turn on the switch, all HTTP requests are redirected to HTTPS requests on port 443 by default.\n\n*   **Https2http**: specifies whether to turn on Enable HTTP. This field is optional and must be an integer. Valid values: **0** and **1**. The value 0 indicates that Enable HTTP is turned off. The value 1 indicates that Enable HTTP is turned on. The default value is 0.\n\n    If your website does not support HTTPS, this feature suits your needs. If you turn on the switch, all HTTPS requests are redirected to HTTP requests and forwarded to origin servers. The feature can also redirect WebSockets requests to WebSocket requests. All requests are redirected over port 80.\n\n*   **Http2**: specifies whether to turn on Enable HTTP/2. This field is optional and must be an integer. Valid values: **0** and **1**. The value 0 indicates that Enable HTTP/2 is turned off. The value 1 indicates that Enable HTTP/2 is turned on. The default value is 0.\n\n    After you turn on the switch, the protocol type is HTTP/2.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "InstanceIds",
      "description": "",
      "position": "Query",
      "type": "RepeatList",
      "required": false
    },
    {
      "name": "ProxyTypes",
      "description": "The protocol of the forwarding rule. The value is a string that consists of JSON arrays. Each element in a JSON array is a JSON struct that contains the following fields:\n\n*   **ProxyType**: the protocol type. This field is required and must be a string. Valid values: **http**, **https**, **websocket**, and **websockets**.\n*   **ProxyPort**: the port number. This field is required and must be an array.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "RealServers",
      "description": "",
      "position": "Query",
      "type": "RepeatList",
      "required": true
    },
    {
      "name": "ResourceGroupId",
      "description": "The ID of the resource group to which the instance belongs in Resource Management. This parameter is empty by default, which indicates that the instance belongs to the default resource group.\n\nFor more information about resource groups, see [Create a resource group](~~94485~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RsType",
      "description": "The address type of the origin server. Valid values:\n\n*   **0**: IP address.\n*   **1**: domain name. Use the domain name of the origin server if you deploy proxies, such as Web Application Firewall (WAF), between the origin server and the Anti-DDoS Pro or Anti-DDoS Premium instance. If you use the domain name, you must enter the address of the proxy, such as the CNAME of WAF.",
      "position": "Query",
      "type": "Integer",
      "required": true
    }
  ]
}