{
  "name": "ModifySchedulerRule",
  "deprecated": false,
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Param",
      "description": "The details of the CDN interaction rule. This parameter is a JSON string. The string contains the following fields:\n\n*   **ParamType**: the type of the scheduling rule. This field is required and must be of the string type. Set the value to **cdn**. This indicates that you want to modify a CDN interaction rule.\n\n*   **ParamData**: the values of parameters that you want to modify for the CDN interaction rule. This field is required and must be of the map type. The ParamData parameter contains the following parameters:\n\n    *   **Domain**: the accelerated domain in CDN. This parameter is required and must be of the string type.\n    *   **Cname**: the CNAME that is assigned to the accelerated domain. This parameter is required and must be of the string type.\n    *   **AccessQps**: the queries per second (QPS) threshold that is used to switch service traffic to Anti-DDoS Pro or Anti-DDoS Premium. This parameter is required and must be of the integer type.\n    *   **UpstreamQps**: the QPS threshold that is used to switch service traffic to CDN. This parameter is optional and must be of the integer type.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ResourceGroupId",
      "description": "The ID of the resource group to which the instance belongs in Resource Management. This parameter is empty by default, which indicates that the instance belongs to the default resource group.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RuleName",
      "description": "The name of the rule that you want to modify.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "RuleType",
      "description": "The type of the rule. Valid values:\n\n*   **2**: tiered protection\n*   **3**: network acceleration\n*   **5**: Alibaba Cloud CDN (CDN) interaction\n*   **6**: cloud service interaction",
      "position": "Query",
      "type": "Integer",
      "required": true
    },
    {
      "name": "Rules",
      "description": "The details of the scheduling rule. This parameter is a JSON string. The string contains the following fields:\n\n*   **Type**: the address type of the interaction resource that you want to use in the scheduling rule. This field is required and must be of the string type. Valid values:\n\n    *   **A**: IP address\n    *   **CNAME**: domain name\n\n*   **Value**: the address of the interaction resource that you want to use in the scheduling rule. This field is required and must be of the string type.\n\n*   **Priority**: the priority of the scheduling rule. This field is required and must be of the integer type. Valid values: **0** to **100**. A larger value indicates a higher priority.\n\n*   **ValueType**: the type of the interaction resource that you want to use in the scheduling rule. This field is required and must be of the integer type. Valid values:\n\n    *   **1**: the IP address of the Anti-DDoS Pro or Anti-DDoS Premium instance\n    *   **2**: the IP address of the interaction resource in the tiered protection scenario\n    *   **3**: the IP address that is used to accelerate access in the network acceleration scenario\n    *   **5**: the domain name that is configured in Alibaba Cloud CDN (CDN) in the CDN interaction scenario\n    *   **6** the IP address of the interaction resource in the cloud service interaction scenario\n\n*   **RegionId**: the region where the interaction resource is deployed. This parameter must be specified when **ValueType** is set to **2**. The value must be of the string type.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}