{
  "name": "ModifyWebPreciseAccessRule",
  "deprecated": false,
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Domain",
      "description": "The domain name of the website.\n\n> A forwarding rule must be configured for the domain name. You can call the [DescribeDomains](~~91724~~) operation to query all domain names.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Expires",
      "description": "The validity period of the rule. Unit: seconds. This parameter takes effect only when **action** of a rule is **block**. Access requests that match the rule are blocked within the specified validity period of the rule. If you do not specify this parameter, this rule takes effect all the time.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "ResourceGroupId",
      "description": "The ID of the resource group to which the instance belongs in Resource Management. This parameter is empty by default, which indicates that the instance belongs to the default resource group.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Rules",
      "description": "The settings of the accurate access control rule. This parameter is a JSON string. The following list describes the fields in the value of the parameter:\n\n*   **action**: the action that is performed if the rule is matched. This field is required and must be of the string type. Valid values:\n\n    *   **accept**: allows the requests that match the rule.\n    *   **block**: blocks the requests that match the rule.\n    *   **challenge**: implements a CAPTCHA for the requests that match the rule.\n\n*   **name**: the name of the rule. This field is required and must be of the string type.\n\n*   **condition**: the match conditions. This field is required and must be of the map type. A match condition contains the following parameters.\n\n    **\n\n    **Note**The AND logical operator is used to define the relationship among multiple match conditions.\n\n    *   **field**: the match field. This parameter is required and must be of the string type.\n\n    *   **match_method**: the logical relation. This parameter is required and must be of the string type.\n\n        **\n\n        **Note**For information about the mappings between the **field** and **match_method** parameters, see the Mappings between the field and match_method parameters table in this topic.\n\n    *   **content**: the match content. This parameter is required and must be of the string type.\n\n*   **header_name**: the HTTP header. This parameter is optional and must be of the string type. This parameter takes effect only when **field** is **header**.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}