{
  "name": "CreateNodeBatch",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AccountName",
      "description": "The username of the account. The username must meet the following requirements:\n- The username starts with a lowercase letter. \n- The username contains lowercase letters, digits, and underscores (_). \n- The username is 4 to 16 characters in length. \n\n> - Keywords cannot be used as account usernames. \n> - The permissions of this account are fixed at read-only. \n> - The username and password are required to be set only when you apply for an endpoint for the shard node for the first time.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "AccountPassword",
      "description": "The password of the account. The password must meet the following requirements:\n- The password contains at least three of the following character types: uppercase letters, lowercase letters, digits, and specific special characters. \n- These special characters include ! @ # $ % ^ & * ( ) _ + - = \n- The password is 8 to 32 characters in length. \n> The account password of the shard node cannot be reset.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "AutoPay",
      "description": "Specifies whether to enable automatic payment. Default value: true. Valid values:\n- **true**: enables automatic payment. Make sure that you have sufficient balance within your account. \n- **false**: disables automatic payment. In this case, you must manually pay for the instance. You can perform the following operations to pay for the instance: Log on to the ApsaraDB for MongoDB console. In the upper-right corner of the page, choose **Expenses** > **Orders**. On the Orders page, find the order and complete the payment.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "BusinessInfo",
      "description": "The business information.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request. You can use the client to generate the value, but you must ensure that it is unique among different requests. The token can only contain ASCII characters and cannot exceed 64 characters in length.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "CouponNo",
      "description": "Specifies whether to use coupons. Default value: null. Valid values:\n\n*   **default** or **null**: uses coupons.\n*   **youhuiquan_promotion_option_id_for_blank**: does not use coupons.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DBInstanceId",
      "description": "The ID of the instance for which you want to add nodes.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "FromApp",
      "description": "The source of the request. Valid values:\n- **OpenApi**: ApsaraDB for MongoDB API \n- **mongo_buy**: ApsaraDB for MongoDB console",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "NodesInfo",
      "description": "The specifications of the mongos or shard node that you want to add. For more information, see [Instance types](~~57141~~). \n\n> Up to 32 mongos or shard nodes are supported for each sharded cluster instance.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ShardDirect",
      "description": "Specifies whether to apply for an endpoint for the shard node. Default value: false. Valid values:\n- **true**: applies for an endpoint for the shard node. \n- **false**: does not apply for an endpoint for the shard node.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    }
  ]
}