{
  "name": "DescribeHistoryTasksStat",
  "deprecated": false,
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "FromExecTime",
      "description": "The minimum execution duration of the task. This parameter is used to filter tasks whose execution duration is longer than the minimum execution duration. Unit: seconds. The default value is 0, which indicates that no limit is imposed for the query.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "FromStartTime",
      "description": "The start time of the O\\&M task to perform. Specify the time in the ISO 8601 standard in the yyyy-MM-ddTHH:mm:ssZ format. The time must be in UTC. You can query data within the last 30 days.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "InstanceId",
      "description": "The instance ID. Separate multiple instance IDs with commas (,). You can specify up to 30 instance IDs. This parameter is empty by default, which indicates that the tasks of all instances are queried.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the pending event. You can call the [DescribeRegions](~~61933~~) operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Status",
      "description": "The task status. Valid values:\n\n*   Scheduled: The task is waiting to be executed.\n*   Running: The task is running.\n*   Succeed: The task is successful.\n*   Failed: The task failed.\n*   Cancelling: The task is being terminated.\n*   Canceled: The task has been terminated.\n*   Waiting: The task is waiting for scheduled time.\n\nSeparate multiple states with commas (,). This parameter is empty by default, which indicates that tasks in all states are queried.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TaskId",
      "description": "The task ID. Separate multiple task IDs with commas (,). You can specify up to 30 task IDs. This parameter is empty by default, which indicates that all tasks are queried.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TaskType",
      "description": "The task type. This parameter is left empty by default, which indicates that all types of tasks are queried. Valid values:\n\n*   CreateIns: Create an instance.\n*   DeleteIns: Delete an instance.\n*   ChangeVariable: Modify parameter settings for an instance.\n*   ModifyInsConfig: Change the configurations of an instance.\n*   RestartIns: Restart an instance.\n*   HaSwitch: Perform a primary/secondary switchover on an instance.\n*   CloneIns: Clone an instance.\n*   KernelVersionUpgrade: Update the minor version of an instance.\n*   ProxyVersionUpgrade: Upgrade the agent version of an instance.\n*   ModifyAccount: Change the account of an instance.\n*   ModifyInsSpec: Change the specifications of an instance or perform a data migration on the instance.\n*   CreateReadIns: Create a read-only instance.\n*   StartIns: Start an instance.\n*   StopIns: Stop an instance.\n*   ModifyNetwork: Modify the network type for an instance.\n*   LockIns: Lock an instance.\n*   UnlockIns: Unlock an instance.\n*   DiskOnlineExpansion: Scale out the disks of an instance online.\n*   StorageOnlineExpansion: Expend the storage capacity of an instance online.\n*   AddInsNode: Add a node to an instance.\n*   DeleteInsNode: Delete a node from an instance.\n*   ManualBackupIns: Manually back up an instance.\n*   ModifyInsStorageType: Modify the storage type for an instance.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ToExecTime",
      "description": "The maximum execution duration of the task. This parameter is used to filter tasks whose execution duration is shorter than or equal to the maximum execution duration. Unit: seconds. The default value is 0, which indicates that no limit is imposed for the query.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "ToStartTime",
      "description": "The end time of the O\\&M task to perform. Specify the time in the ISO 8601 standard in the yyyy-MM-ddTHH:mm:ssZ format. The time must be in UTC. You can query data within the last 30 days.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}