{
  "name": "SubscribeBillToOSS",
  "deprecated": false,
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "BeginBillingCycle",
      "description": "The initial billing cycle from which bills start to be pushed. After you subscribe to the bills, the system automatically pushes the data that is generated from the initial billing cycle to the current time. If the SubscribeType parameter is set to MonthBill, this parameter is invalid. Historical data is not pushed again. The data generated within the last year can be pushed.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "BucketOwnerId",
      "description": "The owner ID of the OSS bucket that stores the bills. This parameter is required if you are a bidder or reseller and want to push data to an OSS bucket of a member account. In this case, you must specify this account as the account used to call this operation and grant the AliyunConsumeDump2OSSRole permission to this account. If you are a regular user, you do not need to set this parameter. By default, your account is used to call this operation.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "BucketPath",
      "description": "The path of the OSS bucket.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "MultAccountRelSubscribe",
      "description": "The type of the account whose bills are to be pushed if multi-tier accounts are involved. Valid values:\n\n*   MA: the master account and a non-managed member account in Finance Cloud\n*   ACP1: a member account of a virtual network operator (VNO)\n\nDefault value: MA.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RowLimitPerFile",
      "description": "",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "SubscribeBucket",
      "description": "The OSS bucket that stores the bills to which you want to subscribe.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "SubscribeType",
      "description": "The type of the bill to which you want to subscribe. Valid values:\n\n*   BillingItemDetailForBillingPeriod: detailed bills of billable items\n*   InstanceDetailForBillingPeriod: detailed bills of instances\n*   BillingItemDetailMonthly: billable item-based bills summarized by billing cycle\n*   InstanceDetailMonthly: instance-based bills summarized by billing cycle\n*   SplitItemDetailDaily: split bills summarized by day\n*   MonthBill: monthly bills in the PDF format. You can subscribe to the monthly PDF bills only of the master account.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}