{
  "name": "CreateUserProvisioning",
  "deprecated": false,
  "protocol": "HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "DeletionStrategy",
      "description": "The deletion policy. The policy is used to manage synchronized users when you delete the RAM user provisioning. Valid values:\n\n*   Delete: When you delete the RAM user provisioning, the system deletes the synchronized users.\n*   Keep: When you delete the RAM user provisioning, the system retains the synchronized users.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Description",
      "description": "The description.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DirectoryId",
      "description": "The ID of the resource directory.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "DuplicationStrategy",
      "description": "The conflict handling policy. The policy is used when a RAM user has the same username as the CloudSSO user who is synchronized to RAM. Valid values:\n\n*   KeepBoth: When a CloudSSO user is synchronized to RAM, if a RAM user who has the same username as the CloudSSO user exists, the system creates a RAM user whose username is the username of the CloudSSO user plus the suffix `_sso`.\n*   TakeOver: When a CloudSSO user is synchronized to RAM, if a RAM user who has the same username as the CloudSSO user exists, the system replaces the RAM user with the CloudSSO user.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "PrincipalId",
      "description": "The identity ID of the RAM user provisioning. Valid values:\n\n*   If you set the `PrincipalType` parameter to `Group`, the value of this parameter is the ID of a CloudSSO user group (g-\\*\\*\\*\\*\\*\\*\\*\\*).\n*   If you set the `PrincipalType` parameter to `User`, the value of this parameter is the ID of a CloudSSO user (u-\\*\\*\\*\\*\\*\\*\\*\\*).",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "PrincipalType",
      "description": "The identity type of the RAM user provisioning. Valid values:\n\n*   User: The identity of the RAM user provisioning is a CloudSSO user.\n*   Group: The identity of the RAM user provisioning is a CloudSSO user group.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "TargetId",
      "description": "The ID of the object for which you create the RAM user provisioning. The value is fixed as the ID of the member in the resource directory.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "TargetType",
      "description": "The object for which you create the RAM user provisioning. The value is fixed as `RD-Account`.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}