{
  "name": "ListAccessConfigurations",
  "deprecated": false,
  "protocol": "HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "DirectoryId",
      "description": "The ID of the directory.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Filter",
      "description": "The filter condition.\n\nThe value is not case-sensitive. You must specify the value in the \\<Attribute> \\<Operator> \\<Value> format. You can set \\<Attribute> only to AccessConfigurationName and \\<Operator> only to eq or sw. The value eq indicates Equals. The value sw indicates Starts With.\n\nFor example, if you set Filter to AccessConfigurationName sw test, the operation queries all access configurations whose names start with test. If you set Filter to AccessConfigurationName eq TestAccessConfiguration, the operation queries the access configuration whose name is TestAccessConfiguration.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "MaxResults",
      "description": "The number of entries per page.\n\nValid values: 1 to 100.\n\nDefault value: 10.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "NextToken",
      "description": "The pagination token that is used in the next request to retrieve a new page of results. You do not need to specify this parameter for the first request. You must specify the token that is obtained from the previous query as the value of `NextToken`.\n\nWhen you call this operation for the first time, if the total number of entries to return is larger than the value of the `MaxResults` parameter, the entries are truncated. The system returns entries based on the value of the `MaxResults` parameter, and does not return the excess entries. In this case, the value of the response parameter `IsTruncated` is `true`, and the `NextToken` parameter is returned. In the next call, you can use the value of the `NextToken` parameter and maintain the settings of the other request parameters to query the excess entries. You can repeat the call until the value of `IsTruncated` becomes `false`. This way, all entries are returned.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "StatusNotifications",
      "description": "The status notification. The status notification can be used to filter access configurations.\n\nSet the value to ReprovisionRequired, which indicates that the operation queries all access configurations that need to be re-provisioned.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Tags",
      "description": "",
      "position": "Query",
      "type": "RepeatList",
      "required": false,
      "sub_parameters": [
        {
          "name": "Key",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "Value",
          "position": "Query",
          "type": "String",
          "required": false
        }
      ]
    }
  ]
}