{
  "name": "CreateAccount",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AccountDescription",
      "description": "The description of the database account.\n\n*   The description cannot start with `http://` or `https://`.\n*   The description can be up to 256 characters in length.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "AccountName",
      "description": "The name of the database account.\n\n*   The name must start with a lowercase letter and end with a lowercase letter or a digit.\n*   The name can contain lowercase letters, digits, and underscores (\\_).\n*   The name must be 2 to 16 characters in length.\n*   Reserved account names such as root, admin, and opsadmin cannot be used.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "AccountPassword",
      "description": "The password of the database account.\n\n*   The password must contain at least three of the following character types: uppercase letters, lowercase letters, digits, and special characters.\n*   Special characters include `! @ # $ % ^ & * ( ) _ + - =`\n*   The password must be 8 to 32 characters in length.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "AccountType",
      "description": "The type of the database account. Valid values:\n\n*   **Normal**: standard account. Up to 256 standard accounts can be created for a cluster.\n*   **Super** (default): privileged account. Only a single privileged account can be created for a cluster.\n\n>  If a cluster does not have accounts, you can specify this parameter to create a privileged account or standard account. If a cluster has a privileged account, you must set this parameter to Normal to create a standard account. Otherwise, the operation fails. After an account is created, the privileged account has permissions on all databases of the cluster. The standard account does not have permissions and must be granted permissions on specific databases by the privileged account. For more information, see GRANT.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DBClusterId",
      "description": "The ID of the AnalyticDB for MySQL Data Warehouse Edition (V3.0) cluster.\n\n> You can call the [DescribeDBClusters](~~129857~~) operation to view cluster IDs.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}