{
  "name": "DescribeDBClusterResourcePoolPerformance",
  "deprecated": false,
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "DBClusterId",
      "description": "The cluster ID.\n\n> You can call the [DescribeDBClusters](~~129857~~) operation to query the information about all AnalyticDB for MySQL clusters within a region, including cluster IDs.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "EndTime",
      "description": "The end of the time range to monitor the resource group. The end time must be later than the start time. Specify the time in the ISO 8601 standard in the *yyyy-MM-ddTHH:mmZ* format. The time must be in UTC.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Key",
      "description": "The metrics of the resource group. You can enter multiple metrics at the same time to query the monitoring information. Separate multiple metrics with commas (,). Valid values:\n\n*   **AnalyticDB_RP_CPU**: the average CPU utilization. Unit: %.\n*   **AnalyticDB_RP_RT**: the query response time (RT). Unit: milliseconds.\n*   **AnalyticDB_RP_QPS**: the queries per second (QPS). The value of this parameter must be a numeric value.\n*   **AnalyticDB_RP_WaitTime**: the query waiting time. Unit: milliseconds.\n*   **AnalyticDB_RP_OriginalNode**: the number of basic nodes in the resource group.\n*   **AnalyticDB_RP_ActualNode**: the number of scheduled nodes that are scaled out in the resource group.\n*   **AnalyticDB_RP_PlanNode**: the number of scheduled nodes to be scaled out in the resource group.\n*   **AnalyticDB_RP_TotalNode**: the total number of nodes in the resource group. Total number of nodes = Number of basic nodes + Number of scheduled nodes that are scaled out.\n\n> \n\n*   If you leave this parameter empty, the monitoring information about all metrics is returned.\n\n*   For more information about scaling plans, see [Create a resource scaling plan](~~189507~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ResourcePools",
      "description": "The names of the resource groups that you want to query. You can enter multiple names of resource groups. Separate multiple names with commas (,).\n\n> \n\n*   The value of this parameter is case-insensitive. For example, `USER_DEFAULT` and `user_default` specify the same resource group.\n\n*   If you leave this parameter empty, the monitoring information about the `USER_DEFAULT` resource group is returned.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "StartTime",
      "description": "The beginning of the time range to monitor the resource group. Specify the time in the ISO 8601 standard in the *yyyy-MM-ddTHH:mmZ* format. The time must be in UTC.\n\n> You can view only the monitoring information about the resource groups within the last two days.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}