{
  "name": "DescribeAuditLogRecords",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "DBClusterId",
      "description": "The ID of the AnalyticDB for MySQL Data Warehouse Edition (V3.0) cluster.\n\n> You can call the [DescribeDBClusters](~~129857~~) operation to query the IDs of all AnalyticDB for MySQL Data Warehouse Edition (V3.0) clusters within a region.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "DBName",
      "description": "The name of the database on which you want to execute the SQL statement.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EndTime",
      "description": "The end of the time range to query. Specify the time in the ISO 8601 standard in the yyyy-MM-ddTHH:mmZ format. The time must be in UTC.\n\n> - The end time must be later than the start time.\n> - The maximum time range that can be specified is 24 hours.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "HostAddress",
      "description": "The IP address and port number of the client that is used to execute the SQL statement.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Order",
      "description": "The order in which specified fields are sorted. Specify this parameter as an ordered JSON array that consists of the Field and Type fields.\n\n*   Field specifies the field that is used to sort the retrieved entries. Valid values:\n\n    *   HostAddress: the IP address of the client that is used to connect to the database.\n    *   Succeed: specifies whether the SQL statement is successfully executed.\n    *   TotalTime: the total amount of time that is consumed to execute the SQL statement.\n    *   DBName: the name of the database on which the SQL statement is executed.\n    *   SQLType: the type of the SQL statement.\n    *   User: the username that is used to execute the SQL statement.\n    *   ExecuteTime: the time to start executing the SQL statement.\n\n*   Type specifies the sorting order. Valid values:\n\n    *   Desc: descending order.\n    *   Asc: ascending order.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "OrderType",
      "description": "The sorting order of the retrieved entries. Valid values:\n\n*   **asc**: sorts the retrieved entries by time in ascending order.\n*   **desc**: sorts the retrieved entries by time in descending order.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "PageNumber",
      "description": "The number of the page to return. The value is an integer that is greater than 0. Default value: **1**.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "PageSize",
      "description": "The number of entries to return on each page. Valid values:\n\n*   **10**\n*   **30**\n*   **50**\n*   **100**\n\n> If you do not specify this parameter, the value 10 is used.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "QueryKeyword",
      "description": "The keywords that are included in the SQL statement to query.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the cluster.\n\n> You can call the [DescribeRegions](~~143074~~) operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "SqlType",
      "description": "The type of the SQL statement. Valid values:\n\n*   **DELETE**\n*   **SELECT**\n*   **UPDATE**\n*   **INSERT_INTO_SELECT**\n*   **ALTER**\n*   **DROP**\n*   **CREATE**\n\n> You can query only a single type of SQL statements at a time. If you leave this parameter empty, the **SELECT** statements are queried.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "StartTime",
      "description": "The beginning of the time range to query. Specify the time in the ISO 8601 standard in the yyyy-MM-ddTHH:mmZ format. The time must be in UTC.\n\n> SQL audit logs can be queried only when SQL audit is enabled. Only SQL audit logs within the last 30 days can be queried. If SQL audit was disabled and re-enabled, only SQL audit logs from the time when SQL audit was re-enabled can be queried.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Succeed",
      "description": "Specifies whether the execution of the SQL statement succeeds. Valid values:\n\n*   **true**\n*   **false**",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "User",
      "description": "The name of the user who executed the SQL statement.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}