{
  "name": "UpdateMeshCRAggregation",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "CPULimit",
      "description": "The maximum number of CPU cores that are available for the components installed in the ACK cluster on the data plane if you enable the Kubernetes API to access Istio resources in the ASM instance. You can specify the parameter value in the standard quantity representation used by Kubernetes.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "CPURequirement",
      "description": "The number of CPU cores that are requested by the components installed in the Container Service for Kubernetes (ACK) cluster on the data plane if you enable the Kubernetes API to access Istio resources in the ASM instance. You can specify the parameter value in the standard quantity representation used by Kubernetes.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "Enabled",
      "description": "Specifies whether to enable the Kubernetes API on the data plane to access Istio resources in the ASM instance. Valid values:\n\n*   `true`: enables the Kubernetes API to access Istio resources in the ASM instance.\n*   `false`: disables the Kubernetes API to access Istio resources in the ASM instance.",
      "position": "Body",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "MemoryLimit",
      "description": "The maximum size of the memory that is available for the components installed in the ACK cluster on the data plane if you enable the Kubernetes API to access Istio resources in the ASM instance. You can specify the parameter value in the standard quantity representation used by Kubernetes. 1 Mi equals 1,024 KB.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "MemoryRequirement",
      "description": "The size of the memory that is requested by the components installed in the ACK cluster on the data plane if you enable the Kubernetes API to access Istio resources in the ASM instance. You can specify the parameter value in the standard quantity representation used by Kubernetes. 1 Mi equals 1,024 KB.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "ServiceMeshId",
      "description": "The Service Mesh (ASM) instance ID.",
      "position": "Body",
      "type": "String",
      "required": true
    },
    {
      "name": "UsePublicApiServer",
      "description": "Specifies whether the Kubernetes API on the data plane uses the public endpoint of the API server to access Istio resources in the ASM instance. Valid values:\n\n*   `true`: The Kubernetes API on the data plane uses the public endpoint of the API server to access Istio resources in the ASM instance.\n*   `false`: The Kubernetes API on the data plane uses the private endpoint of the API server to access Istio resources in the ASM instance.\n\nDefault value: `false`.",
      "position": "Body",
      "type": "Boolean",
      "required": false
    }
  ]
}