{
  "name": "UpdateNamespaceScopeSidecarConfig",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Concurrency",
      "description": "The number of worker threads to run in Istio Proxy.",
      "position": "Body",
      "type": "Integer",
      "required": false
    },
    {
      "name": "EnableCoreDump",
      "description": "Specifies whether to enable the core dump feature for the sidecar proxy containers. Valid values:\n\n*   `true`\n*   `false`",
      "position": "Body",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "ExcludeIPRanges",
      "description": "The range of IP addresses that are allowed to access external services. (`global.proxy.excludelPRanges`)",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "ExcludeInboundPorts",
      "description": "The port that the inbound traffic of the sidecar proxy does not pass through.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "ExcludeOutboundPorts",
      "description": "The port that the outbound traffic of the sidecar proxy does not pass through.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "HoldApplicationUntilProxyStarts",
      "description": "Specifies whether applications can be started only after Istio Proxy starts. Valid values:\n\n*   `true`: Applications can be started only after Istio Proxy starts.\n*   `false`: Applications can be started before Istio Proxy starts.",
      "position": "Body",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "IncludeIPRanges",
      "description": "The range of IP addresses that are denied to access external services. (`global.proxy.includelPRanges`)",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "IncludeInboundPorts",
      "description": "The port that the inbound traffic of the sidecar proxy passes through.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "IncludeOutboundPorts",
      "description": "The port that the outbound traffic of the sidecar proxy passes through.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "InterceptionMode",
      "description": "The mode in which the sidecar proxy intercepts inbound traffic. Valid values:\n\n*   `REDIRECT`: The sidecar proxy intercepts inbound traffic in the REDIRECT mode.\n*   `TPROXY`: The sidecar proxy intercepts inbound traffic in the TPROXY mode.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "IstioDNSProxyEnabled",
      "description": "Specifies whether to enable the Domain Name System (DNS) proxy feature. Valid values:\n\n*   `true`: The DNS proxy feature is enabled.\n*   `false`: The DNS proxy feature is disabled.",
      "position": "Body",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "Lifecycle",
      "description": "The lifecycle of the sidecar proxy.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "LogLevel",
      "description": "The log level. Valid values: `info`, `debug`, `tracing`, and `error`.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "Namespace",
      "description": "The namespace for which you want to update the sidecar proxy configurations.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "PostStart",
      "description": "The post-start parameters of Istio Proxy.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "PreStop",
      "description": "The pre-close parameters of Istio Proxy.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "Privileged",
      "description": "Specifies whether to enable the privileged mode in the security context of the sidecar proxy containers. Valid values:\n\n*   `true`: enables the privileged mode. This means that the sidecar proxy containers run in privileged mode.\n*   `false`: does not enable the privileged mode.",
      "position": "Body",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "ProxyInitAckSloCPUResourceLimit",
      "description": "The maximum number of reclaimed CPU cores provided by Container Service for Kubernetes (ACK) that are available to the istio-init container. Reclaimed resources, including CPU cores and memory, are resources that can be dynamically overcommitted. This configuration item is used to set the maximum number of CPU cores that are available to the istio-init container in a pod labeled with `koordinator.sh/qosClass`. Unit: millicore.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "ProxyInitAckSloCPUResourceRequest",
      "description": "The minimum number of reclaimed CPU cores provided by ACK that the istio-init container requires at runtime. This configuration item is used to set the minimum number of reclaimed CPU cores for the istio-init container in a pod labeled with `koordinator.sh/qosClass`. Unit: millicore.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "ProxyInitAckSloMemoryResourceLimit",
      "description": "The maximum size of reclaimed memory resources provided by ACK that are available to the istio-init container. This configuration item is used to set the maximum size of memory that is available to the istio-init container in a pod labeled with `koordinator.sh/qosClass`.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "ProxyInitAckSloMemoryResourceRequest",
      "description": "The minimum size of reclaimed memory provided by ACK that the istio-init container requires at runtime. This configuration item is used to set the minimum size of reclaimed memory for the istio-init container in a pod labeled with `koordinator.sh/qosClass`.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "ProxyInitCPUResourceLimit",
      "description": "The maximum number of CPU cores that are available to the sidecar proxy init container.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "ProxyInitCPUResourceRequest",
      "description": "The minimum number of CPU cores that are requested by the sidecar proxy init container.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "ProxyInitMemoryResourceLimit",
      "description": "The maximum size of memory that is available to the sidecar proxy init container.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "ProxyInitMemoryResourceRequest",
      "description": "The minimum size of memory that is requested by the sidecar proxy init container.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "ProxyMetadata",
      "description": "The environment variables that are added to a sidecar proxy. The environment variables are represented as JSON objects. The keys and values in the JSON objects represent the keys and values added to the environment variables of the sidecar proxy.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "ProxyStatsMatcher",
      "description": "The monitoring metrics for data collected by Envoy proxies. The value is in the JSON format.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "ReadinessFailureThreshold",
      "description": "The number of readiness check failures required before marking a sidecar proxy container as not ready.",
      "position": "Body",
      "type": "Integer",
      "required": false
    },
    {
      "name": "ReadinessInitialDelaySeconds",
      "description": "The amount of time to wait before the first readiness check of a sidecar proxy container is performed. Unit: seconds.",
      "position": "Body",
      "type": "Integer",
      "required": false
    },
    {
      "name": "ReadinessPeriodSeconds",
      "description": "The interval between two readiness checks of a sidecar proxy container. Unit: seconds.",
      "position": "Body",
      "type": "Integer",
      "required": false
    },
    {
      "name": "RuntimeValues",
      "description": "Indicates the runtime parameters of Envoy proxy processes in the sidecar proxy container. This parameter is a serialized JSON string. The keys and values of a JSON object are the keys and the values of a Envoy Runtime Parameter respectively.\n\nValid values:\n\n*   global_downstream_max_connections: indicates that the limits on the number of connections from downstream to Envoy.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "SMCEnabled",
      "description": "Specifies whether to enable Shared Memory Communications over Remote Direct Memory Access (SMC-R) optimization. The SMC-R optimization feature uses Alibaba Cloud Linux 3 and elastic remote direct memory access (eRDMA) network devices, which optimizes cross-node communication.",
      "position": "Body",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "ScaledSidecarResource",
      "description": "",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "ServiceMeshId",
      "description": "The ID of the ASM instance.",
      "position": "Body",
      "type": "String",
      "required": true
    },
    {
      "name": "SidecarProxyAckSloCPUResourceLimit",
      "description": "The maximum number of reclaimed CPU cores provided by ACK that are available to the sidecar proxy container. This configuration item is used to set the maximum number of CPU cores that are available to the sidecar proxy container in a pod labeled with `koordinator.sh/qosClass`. Unit: millicore.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "SidecarProxyAckSloCPUResourceRequest",
      "description": "The minimum number of reclaimed CPU cores provided by ACK that the sidecar proxy container requires at runtime. This configuration item is used to set the minimum number of reclaimed CPU cores for the sidecar proxy container in a pod labeled with `koordinator.sh/qosClass`. Unit: millicore.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "SidecarProxyAckSloMemoryResourceLimit",
      "description": "The maximum size of reclaimed memory resources provided by ACK that are available to the sidecar proxy container. This configuration item is used to set the maximum size of memory that is available to the sidecar proxy container in a pod labeled with `koordinator.sh/qosClass`.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "SidecarProxyAckSloMemoryResourceRequest",
      "description": "The minimum size of reclaimed memory provided by ACK that the sidecar proxy container requires at runtime. This configuration item is used to set the minimum size of reclaimed memory for the sidecar proxy container in a pod labeled with `koordinator.sh/qosClass`.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "SidecarProxyCPUResourceLimit",
      "description": "The maximum number of CPU cores that are available to the sidecar proxy container.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "SidecarProxyCPUResourceRequest",
      "description": "The minimum number of CPU cores that are requested by the sidecar proxy container.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "SidecarProxyMemoryResourceLimit",
      "description": "The maximum size of memory that is available to the sidecar proxy container.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "SidecarProxyMemoryResourceRequest",
      "description": "The minimum size of memory that is requested by the sidecar proxy container.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "TerminationDrainDuration",
      "description": "The maximum period of time that the sidecar proxy waits for a request to end.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "Tracing",
      "description": "The custom configurations of Tracing Analysis. The configurations must be serialized into JSON strings. The configurations contain the following parameters:\n\n*   `sampling`: The sampling rate, which is of the DOUBLE type.\n\n*   `custom_tags`: The custom tags added to reported spans, which are of the MAP type. The key of a tag is of the string type. The value of a tag is in the JSON format. A custom tag can belong to one of the following types:\n\n    *   `literal`: The tag value is a fixed value in the JSON format. This tag must contain the `value` field that specifies a literal. Example: `{\"value\":\"test\"}`.\n    *   `header`: The tag value is a request header in the JSON format. This tag must contain the `name` field and `defaultValue` field.The name field indicates the name of the request header. The defaultValue field indicates the default value that is used when no request header is available. Example: `{\"name\":\"test\",\"defaultValue\":\"test\"}`.\n    *   `environment`: The tag value is an environment variable in the JSON format. This tag must contain the `name` field and `defaultValue` field. The name field indicates the name of the environment variable. The defaultValue field indicates the environment variable that is used when no environment variable is available. Example: `{\"name\":\"test\",\"defaultValue\":\"test\"}`.",
      "position": "Body",
      "type": "String",
      "required": false
    }
  ]
}