{
  "name": "CreateGatewayFileShare",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AccessBasedEnumeration",
      "description": "Specifies whether to enable Windows access-based enumeration (ABE) for the SMB share. This parameter takes effect only when the WindowsAcl parameter is set to true. Valid values:\n\n*   false (default)\n*   true\n\n>  This parameter is supported for gateway version 1.0.45 and later.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "BackendLimit",
      "description": "The upper limit on the upload speed of the share. Unit: MB/s. Valid values: 0 to 1280. The default value 0 specifies that the upload speed is not limited.\n\n>  If an upper limit is applied to the write speed, the upper limit on the upload speed must be greater than or equal to the upper speed on the write speed.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "BindIPAddr",
      "description": "The virtual IP address used to mount the share. This parameter applies only to a high-availability gateway.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Browsable",
      "description": "Specifies whether the share is browsable over the SMB protocol (that is, whether the share is discoverable in the network neighbor). This parameter takes effect only when the ShareProtocol parameter is set to SMB. Valid values:\n\n*   true (default)\n*   false",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "BucketInfos",
      "description": "",
      "position": "Query",
      "type": "Json",
      "required": false,
      "sub_parameters": [
        {
          "name": "Endpoint",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "Name",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "PathPrefix",
          "position": "Query",
          "type": "String",
          "required": false
        }
      ]
    },
    {
      "name": "BucketStub",
      "description": "",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "BypassCacheRead",
      "description": "Specifies whether to directly read data from OSS. Valid values:\n\n*   true\n*   false (default)",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "CacheMode",
      "description": "The data synchronization mode of the share. Valid values:\n\n*   Cache: the cache mode\n*   Sync: the replication mode",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ClientSideCmk",
      "description": "The KMS key used in client-side encryption for the share.\n\n>  The key must be in the same region as the gateway.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ClientSideEncryption",
      "description": "Specifies whether to enable client-side encryption for the share. Valid values:\n\n*   false (default)\n*   true\n\n>  The feature is available only to users on the whitelist. To enable the feature, contact the technical support. Only Enhanced and Performance Optimized gateways support the feature. Server-side encryption and client-side encryption cannot be configured at the same time.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "DirectIO",
      "description": "Specifies whether data is directly read from and written to the cache disk. Valid values:\n\n*   false (default)\n*   true",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "DownloadLimit",
      "description": "The upper limit on the download speed of the share. Unit: MB/s. Valid values: 0 to 1280. The default value 0 specifies that the download speed is not limited.\n\n> \n\n*   This parameter takes effect only when the replication mode and data download feature are enabled. This parameter takes effect only if the share allows reverse synchronization or is added to an express synchronization group. This parameter is supported for gateway version 1.3.0 and later.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "FastReclaim",
      "description": "Specifies whether to enable the upload optimization feature for the share. The feature is suitable for the scenarios where you synchronize backups to the cloud. Valid values:\n\n*   false (default)\n*   true\n\n>  This parameter is supported for gateway version 1.0.39 and later.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "FrontendLimit",
      "description": "The upper limit on the write speed of the share. Unit: MB/s. Valid values: 0 to 1280. The default value 0 specifies that the write speed is not limited.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "GatewayId",
      "description": "The gateway ID.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "IgnoreDelete",
      "description": "Specifies whether to enable the ignore deletions feature for the share. After you enable the feature, data stored in the OSS bucket is retained if you delete data from the gateway. Valid values:\n\n*   false (default)\n*   true\n\n>  This parameter is supported for gateway version 1.0.40 and later.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "InPlace",
      "description": "Specifies whether to enable the fragmentation optimization feature for the share. Valid values:\n\n*   false (default)\n*   true",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "KmsRotatePeriod",
      "description": "The key rotation cycle for client-side encryption. The parameter takes effect only when client-side encryption is enabled for the share. Unit: seconds. Valid values: -3600 to 360 × 86400. The default value 0 indicates that the key is not rotated.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "LagPeriod",
      "description": "The delay in uploading files from the gateway to the OSS bucket. Unit: seconds. Valid values: 5 to 120. Default value: 5.\n\n>  This parameter is supported for gateway version 1.0.40 and later.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "LocalFilePath",
      "description": "The internal device name of the cache disk for the share. You can call the DescribeGatewayCaches operation to query the internal device name of the cache disk.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Name",
      "description": "The name of the share. The name must be 1 to 255 characters in length and can contain lowercase letters, digits, periods (.), underscores (\\_), and hyphens (-). It must start with a lowercase letter.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "NfsV4Optimization",
      "description": "Specifies whether to enable fragment optimization based on the Network File System version 4 (NFSv4) protocol to improve the upload efficiency. Valid values:\n\n*   false (default)\n*   true\n\n>  After you enable the feature, you cannot mount the share on on-premises clients over NFSv3. This parameter is supported for gateway version 1.2.0 and later.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "OssBucketName",
      "description": "The name of the OSS bucket.\n\n>  An OSS bucket for which you configure back-to-origin routing is not supported.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "OssBucketRegionId",
      "description": "The region in which the OSS bucket associated with the share is located.\n\n>  If the gateway version is greater than or equal to 2.0.0 and this parameter is correctly specified, the gateway uses the OSS Signature V4 to access data in the bucket. If the gateway version is earlier than 2.0.0 or this parameter is not correctly specified, the gateway uses the OSS Signature V1 to access data in the OSS bucket.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "OssBucketSsl",
      "description": "Specifies whether to enable Secure Sockets Layer (SSL) connection to the OSS bucket. Valid values:\n\n*   true (default)\n*   false",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "OssEndpoint",
      "description": "The endpoint for the region in which the OSS bucket associated with the share is located.\n\n>  You can specify the internal or public endpoint for a region. If the OSS bucket and the gateway reside in the same region, we recommend that you specify the internal endpoint. Example: oss-cn-shanghai-internal.aliyuncs.com.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "PartialSyncPaths",
      "description": "The directories from which you want to synchronize data if the replication mode is enabled.\n\n>  The feature is available only to users on the whitelist. To enable the feature, contact the technical support.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "PathPrefix",
      "description": "The subdirectory of the OSS bucket. If you leave the parameter empty, the root directory of the OSS bucket is specified.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "PollingInterval",
      "description": "The time interval between two consecutive reverse synchronization tasks. Valid values: 15 to 36000\n\n>  In replication mode, if both reverse synchronization and data download are enabled, a valid value for this parameter ranges from 3600 to 36000.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "ReadOnlyClientList",
      "description": "The IP addresses or CIDR blocks allowed to only read the NFS share. Separate multiple IP addresses or CIDR blocks with commas (,).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ReadOnlyUserList",
      "description": "The list of users who have read-only access to the SMB share. Separate multiple users with commas (,). This parameter takes effect only when the ShareProtocol parameter is set to SMB.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ReadWriteClientList",
      "description": "The IP addresses or CIDR blocks allowed to read and write the NFS share. Separate multiple IP addresses or CIDR blocks with commas (,).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ReadWriteUserList",
      "description": "The list of users who have read and write access to the SMB share. Separate multiple users with commas (,). This parameter takes effect only when the ShareProtocol parameter is set to SMB.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RemoteSync",
      "description": "Specifies whether to enable reverse synchronization for the share. Valid values:\n\n*   false (default)\n*   true",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "RemoteSyncDownload",
      "description": "Specifies whether to download data if the replication mode is enabled. Valid values:\n\n*   false (default)\n*   true\n\n>  This parameter takes effect only if the share allows reverse synchronization or is added to an express synchronization group.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "ServerSideAlgorithm",
      "description": "The encryption algorithm. Valid values:\n\n*   AES256 (default)\n*   SM4",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ServerSideCmk",
      "description": "The Key Management Service (KMS) key used for server-side encryption.\n\n>  The key must be in the same region as the gateway.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ServerSideEncryption",
      "description": "Specifies whether to enable server-side encryption for the share. Valid values:\n\n*   false (default)\n*   true\n\n>  - The feature is available only to users on the whitelist. To enable the feature, contact the technical support. Server-side encryption and client-side encryption cannot be configured at the same time.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "ShareProtocol",
      "description": "The protocol of the share. Valid values:\n\n*   NFS\n*   SMB",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Squash",
      "description": "The user mapping for an NFS share. Valid values:\n\n*   none (default)\n*   root_squash\n*   all_squash\n*   all_anonymous",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SupportArchive",
      "description": "Specifies whether to allow archiving for the share. This parameter takes effect only when the ShareProtocol parameter is set to NFS.\n\n>  If you enable the feature and access an archived file, a request is initiated to restore the archived file. The request does not trigger error messages. However, the restoration process takes some time to complete. If you do not enable the feature, accessing an archived file throws an error.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "TransferAcceleration",
      "description": "Specifies whether to enable the transfer acceleration feature for the share. To enable transfer acceleration for the share, you must also enable transfer acceleration for the OSS bucket.\n\n>  This parameter is supported for gateway version 1.3.0 and later.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "WindowsAcl",
      "description": "Specifies whether to configure a Windows access control list (ACL) for the SMB share. Active Directory is required to configure this setting. Valid values:\n\n*   false (default)\n*   true\n\n>  This parameter is supported for gateway version 1.0.45 and later.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    }
  ]
}