{
  "name": "ApplyMetricRuleTemplate",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ApplyMode",
      "description": "The mode in which the alert template is applied. Valid values:\n\n*   GROUP_INSTANCE_FIRST: The metrics in the application group take precedence. If a metric specified in the alert template does not exist in the application group, the system does not generate an alert rule for the metric based on the alert template.\n*   ALARM_TEMPLATE_FIRST: The metrics specified in the alert template take precedence. If a metric specified in the alert template does not exist in the application group, the system still generates an alert rule for the metric based on the alert template.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EnableEndTime",
      "description": "The end of the time period during which the alert rule is effective. Valid values: 00 to 23. A value of 00 indicates 00:59 and a value of 23 indicates 23:59.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "EnableStartTime",
      "description": "The beginning of the time period during which the alert rule is effective. Valid values: 00 to 23. A value of 00 indicates 00:00 and a value of 23 indicates 23:00.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "GroupId",
      "description": "The ID of the application group to which the alert template is applied.\n\nFor more information about how to query the ID of an application group, see [DescribeMonitorGroups](~~115032~~).",
      "position": "Query",
      "type": "Long",
      "required": true
    },
    {
      "name": "NotifyLevel",
      "description": "The alert notification method. Valid values:\n\nSet the value to 4. A value of 4 indicates that alert notifications are sent by using TradeManager and DingTalk chatbots.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "SilenceTime",
      "description": "The mute period during which notifications are not repeatedly sent for an alert. Unit: seconds. Default value: 86400.\n\n>  Only one alert notification is sent during each mute period even if the metric value exceeds the alert threshold several times.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "TemplateIds",
      "description": "The ID of the alert template.\n\nFor more information about how to query the IDs of alert templates, see [DescribeMetricRuleTemplateList](~~114982~~).",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Webhook",
      "description": "The callback URL to which a POST request is sent when an alert is triggered based on the alert rule.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}