{
  "name": "CreateDynamicTagGroup",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ContactGroupList",
      "description": "The relationship between the conditional expressions for the tag values of the cloud resources. Valid values:\n\n*   and (default)\n*   or",
      "position": "Query",
      "type": "RepeatList",
      "required": true
    },
    {
      "name": "EnableInstallAgent",
      "description": "The ID of the region to which the tags belong.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "EnableSubscribeEvent",
      "description": "The keys of the tags that are used to create the application group. If a specified key is attached to multiple resources, the resources that have the same key-value pair are added to the same group.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "MatchExpress",
      "description": "Specifies whether the CloudMonitor agent is automatically installed for the application group. CloudMonitor determines whether to automatically install the CloudMonitor agent for the hosts in an application group based on the value of this parameter. Valid values:\n\n*   true: The CloudMonitor agent is automatically installed.\n*   false (default): The CloudMonitor agent is not automatically installed.",
      "position": "Query",
      "type": "RepeatList",
      "required": true,
      "sub_parameters": [
        {
          "name": "TagName",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "TagValue",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "TagValueMatchFunction",
          "position": "Query",
          "type": "String",
          "required": false
        }
      ]
    },
    {
      "name": "MatchExpressFilterRelation",
      "description": "Specifies whether the application group automatically subscribes to event notifications. If events whose severity level is critical or warning occur on resources in an application group, CloudMonitor sends alert notifications. Valid values:\n\n*   true: The application group automatically subscribes to event notifications.\n*   false (default): The application group does not automatically subscribe to event notifications.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TagKey",
      "description": "The alert contact groups. Valid values of N: 1 to 100. The alert notifications of the application group are sent to the alert contacts that belong to the specified alert contact groups.\n\nAn alert contact group can contain one or more alert contacts. For information about how to create alert contacts and alert contact groups, see [PutContact](~~114923~~) and [PutContactGroup](~~114929~~). For information about how to obtain alert contact groups, see [DescribeContactGroupList](~~114922~~).",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "TagRegionId",
      "description": "The tag keys of the cloud resources.\n\nFor more information about how to obtain tag keys, see [DescribeTagKeyList](~~145558~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TemplateIdList",
      "description": "The IDs of the alert templates.\n\nFor more information about how to query alert template IDs, see [DescribeMetricRuleTemplateList](~~114982~~).",
      "position": "Query",
      "type": "RepeatList",
      "required": false
    }
  ]
}