{
  "name": "UploadDocumentAsync",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ChunkOverlap",
      "description": "The size of data that is overlapped between consecutive chunks. The maximum value of this parameter cannot be greater than the value of the ChunkSize parameter.\n\n>  This parameter is used to prevent context missing that may occur due to data truncation. For example, when you upload a long text, you can retain specific overlapped text content between consecutive chunks to better understand the context.",
      "position": "Body",
      "type": "Integer",
      "required": false
    },
    {
      "name": "ChunkSize",
      "description": "Strategy for processing large data: the size of each chunk when the data is split into smaller parts. Maximum value is 2048.",
      "position": "Body",
      "type": "Integer",
      "required": false
    },
    {
      "name": "Collection",
      "description": "The name of the document library. \n> Created by the [CreateDocumentCollection](~~2618448~~) API. You can call the [ListDocumentCollections](~~2618452~~) API to view the document libraries that have already been created.",
      "position": "Body",
      "type": "String",
      "required": true
    },
    {
      "name": "DBInstanceId",
      "description": "Instance ID with vector engine optimization acceleration enabled. You can call the [DescribeDBInstances](~~86911~~) API to view details of all AnalyticDB PostgreSQL instances in the target region, including the instance ID.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "DocumentLoaderName",
      "description": "Specifies the document loader to use for processing the file. If this parameter is omitted, the system automatically selects a loader based on the file's extension.Valid Values:\\[List of valid loader names would go here] Valid values:\n\n*   UnstructuredHTMLLoader: .html\n*   UnstructuredMarkdownLoader: .md\n*   PyMuPDFLoader: .pdf\n*   PyPDFLoader: .pdf\n*   RapidOCRPDFLoader: .pdf\n*   PDFWithImageRefLoader: .pdf (with the text-image association feature)\n*   JSONLoader: .json\n*   CSVLoader: .csv\n*   RapidOCRLoader: .png, .jpg, .jpeg, and .bmp\n*   UnstructuredFileLoader: .eml, .msg, .rst, .txt, .docx, .epub, .odt, .pptx, and .tsv\n*   ADBPGLoader (free of charge for the first 3,000 pages): .pdf, .doc, .docx, .ppt, .pptx, .xls, .xlsx, .xlsm, .csv, .txt, .jpg, .jpeg, .png, .bmp, .gif, .md, .html, .epub, .mobi, and .rtf",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "DryRun",
      "description": "Specifies whether to perform only document understanding and chunking, but not vectorization and storage. Default value: false.\n\n>  You can set this parameter to true, check the chunking effect, and then perform optimization if needed.",
      "position": "Body",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "FileName",
      "description": "The name of the file being uploaded.\n\n> \n\n*   File name: .json, .md, and .pdf.\n\n*   Images: .bmp,. jpg,. jpeg,. png, and. tiff.\n\n*   Compressed packages. The package file name must contain an extension: .tar, .gz, and .zip.",
      "position": "Body",
      "type": "String",
      "required": true
    },
    {
      "name": "FileUrl",
      "description": "The URL of the publicly accessible document.\n>  > - It is recommended to call this interface using the SDK, which provides a method called UploadDocumentAsyncAdvance for directly uploading local files. > - If the URL points to an image archive, the number of images in the archive should not exceed 100.",
      "position": "Body",
      "type": "String",
      "required": true
    },
    {
      "name": "Metadata",
      "description": "The metadata. The value of this parameter must be the same as the Metadata parameter that is specified when you call the CreateDocumentCollection operation.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "Namespace",
      "description": "Namespace, default is public. You can create one through the CreateNamespace interface and view the list via the ListNamespaces interface.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "NamespacePassword",
      "description": "The password corresponding to the namespace.  > This value is specified by the CreateNamespace interface.",
      "position": "Body",
      "type": "String",
      "required": true
    },
    {
      "name": "RegionId",
      "description": "The region ID of the instance.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Separators",
      "description": "The separators that are used to split large amounts of data.\n\n> \n\n*   This is an important parameter that determines the chunking effect. This parameter is related to the splitter that is specified by the TextSplitterName parameter.\n\n*   In most cases, you do not need to specify this parameter. The server assigns separators based on the value of the TextSplitterName parameter.",
      "position": "Body",
      "type": "Json",
      "required": false
    },
    {
      "name": "SplitterModel",
      "description": "When DocumentLoaderName is set to ADBPGLoader and TextSplitterName is set to LLMSplitter, you can specify the splitting model. Default Value: qwen3-8b.\n\n>  Supported splitting models: qwq-plus, qwq-plus-latest, qwen-max, qwen-max-latest, qwen-plus, qwen-plus-latest, qwen-turbo, qwen-turbo-latest, qwen3-235b-a22b, qwen3-32b,qwen3-30b-a3b, qwen3-14b, qwen3-8b, qwen3-4b, qwen3-1.7b, qwen3-0.6b, qwq-32b qwen2.5-14b-instruct-1m, qwen2.5-7b-instruct-1m, qwen2.5-72b-Instruct, qwen2.5-32b-Instruct, qwen2.5-14b-Instruct, qwen2.5-7b-Instruct, qwen2.5-3b-instruct, qwen2.5-1.5b-instruct, qwen2.5-0.5b-instruct.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "TextSplitterName",
      "description": "The name of the separator. Valid values:\n\n*   **ChineseRecursiveTextSplitter**: Inherits from RecursiveCharacterTextSplitter and, by default, uses the delimiters` [\"\\n\\n\",\"\\n\", \"。 |! |?\", \"\\.\\s|\\! \\s|\\?\\s\", \";|;\\s\", \",|,\\s\"]  `, employing regular expressions to match text.\n*   **RecursiveCharacterTextSplitter**: Uses the delimiters `[\"\\n\\n\", \"\\n\", \" \", \"\"]` by default. The splitter supports splitting code in languages such as C++, Go, Java, JS, PHP, Proto, Python, RST, Ruby, Rust, Scala, Swift, Markdown, LaTeX, HTML, Sol, and C Sharp.\n*   **SpacyTextSplitter**: Uses the delimiters `\\n\\n` by default and leverages the spaCy en_core_web_sm model. The splitter can achieve better text splitting performance.\n*   **MarkdownHeaderTextSplitter**: Splits text in the \\[(\"#\", \"head1\"), (\"##\", \"head2\"), (\"###\", \"head3\"), (\"####\", \"head4\") format. This splitter works well with Markdown text.\n*   **LLMSplitter**: Use LLM to split text. The default model is qwen3-8b. Currently, this splitter works only when ADBPGLoader is selected.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "VlEnhance",
      "description": "Specifies whether to enable VL-enhanced content recognition for complex documents. Default value: false.\n\n> \n\n*   For complex documents with confusing typesetting and formatting, we recommend that you enable VL-enhanced content recognition.\n\n*   Document processing time is longer after VL-enhanced content recognition is enabled.\n\n*   After VL-enhanced content recognition is enabled, images in documents cannot be stored or recalled.",
      "position": "Body",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "ZhTitleEnhance",
      "description": "Specifies whether to enable title enhancement.\n\n>  You can determine the title text, mark the text in the metadata, and then combine the text with the upper-level title to implement text enhancement.",
      "position": "Body",
      "type": "Boolean",
      "required": false
    }
  ]
}