{
  "name": "UpdateLoadBalancerAddressTypeConfig",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AddressType",
      "description": "The new network type. Valid values:\n\n*   **Internet**: The nodes of an Internet-facing NLB instance have public IP addresses. The DNS name of an Internet-facing NLB instance is publicly resolvable to the public IP addresses of the nodes. Therefore, Internet-facing NLB instances can route requests from clients over the Internet.\n*   **Intranet**: The nodes of an internal-facing NLB instance have only private IP addresses. The DNS name of an internal-facing NLB instance is publicly resolvable to the private IP addresses of the nodes. Therefore, internal-facing NLB instances can route requests only from clients with access to the virtual private cloud (VPC) for the NLB instance.",
      "position": "Body",
      "type": "String",
      "required": true
    },
    {
      "name": "ClientToken",
      "description": "The client token used to ensure the idempotence of the request.\n\nYou can use the client to generate this value. Ensure that the value is unique among all requests. Only ASCII characters are allowed.\n\n>  If you do not specify this parameter, the value of **RequestId** is used.**** **RequestId** of each request is different.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "DryRun",
      "description": "Perform a dry run without actually making the request. Valid values are:\n\n*   **true**: Perform only a dry run. The system checks the request for potential issues, including missing parameter values, incorrect request syntax, and service limits. If the request fails the check, an error message specifying the issue is returned. If the request passes, the `DryRunOperation` error code is returned.\n*   **false** (default): Check the request and perform the operation. If the request passes the check, a 2xx HTTP status code is returned, and the operation is performed.",
      "position": "Body",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "LoadBalancerId",
      "description": "The ID of the NLB instance.",
      "position": "Body",
      "type": "String",
      "required": true
    },
    {
      "name": "RegionId",
      "description": "The region ID of the NLB instance.\n\nYou can call the [DescribeRegions](~~443657~~) operation to query the most recent region list.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "ZoneMappings",
      "description": "The mappings between zones and vSwitches. You can specify up to 10 zones.",
      "position": "Body",
      "type": "RepeatList",
      "required": false,
      "sub_parameters": [
        {
          "name": "AllocationId",
          "position": "FormData",
          "type": "String",
          "required": false
        },
        {
          "name": "EipType",
          "position": "FormData",
          "type": "String",
          "required": false
        },
        {
          "name": "VSwitchId",
          "position": "FormData",
          "type": "String",
          "required": false
        },
        {
          "name": "ZoneId",
          "position": "FormData",
          "type": "String",
          "required": false
        }
      ]
    }
  ]
}