{
  "name": "UpdateServerGroupAttribute",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ClientToken",
      "description": "The client token used to ensure the idempotence of the request.\n\nYou can use the client to generate the token. Ensure that the token is unique among different requests. Only ASCII characters are allowed.\n\n>  If you do not specify this parameter, the value of **RequestId** is used.**** The value of **RequestId** is different for each request.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "ConnectionDrainEnabled",
      "description": "Specifies whether to enable connection draining. Valid values:\n\n*   **true**\n*   **false**",
      "position": "Body",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "ConnectionDrainTimeout",
      "description": "Specify a timeout period for connection draining. Unit: seconds. Valid values: **0** to **900**.",
      "position": "Body",
      "type": "Integer",
      "required": false
    },
    {
      "name": "DryRun",
      "description": "Specifies whether to perform a dry run. Valid values:\n\n*   **true**: validates the request without performing the operation. The system checks the request for potential issues, including missing parameter values, incorrect request syntax, and service limits. If the request fails the validation, the corresponding error message is returned. If the request passes the validation, the `DryRunOperation` error code is returned.\n*   **false** (default): validates the request and performs the operation. If the request passes the validation, a 2xx HTTP status code is returned and the operation is performed.",
      "position": "Body",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "HealthCheckConfig",
      "description": "Health check configurations.",
      "position": "Body",
      "type": "Struct",
      "required": false
    },
    {
      "name": "IpVersionAffinityMode",
      "description": "",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "PreserveClientIpEnabled",
      "description": "Specifies whether to enable client IP preservation. Valid values:\n\n*   **true**\n*   **false**\n\n>  You cannot set this parameter to **true** if **PreserveClientIpEnabled** is set to **false** and the server group is associated with a listener that uses **SSL over TCP**.",
      "position": "Body",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The ID of the region where the NLB instance is deployed.\n\nYou can call the [DescribeRegions](~~443657~~) operation to query the most recent region list.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "Scheduler",
      "description": "The scheduling algorithm. Valid values:\n\n*   **Wrr**: weighted round-robin. Backend servers with higher weights receive more requests.\n*   **Wlc**: weighted least connections. Requests are distributed based on the weight and load of each backend server. The load refers to the number of connections on a backend server. If multiple backend servers have the same weight, requests are forwarded to the backend server with the least connections.\n*   **rr**: Requests are forwarded to backend servers in sequence.\n*   **sch**: source IP hash. Requests from the same source IP address are forwarded to the same backend server.\n*   **tch**: consistent hashing based on four factors: source IP address, destination IP address, source port, and destination port. Requests that contain the same four factors are forwarded to the same backend server.\n*   **qch**: QUIC ID hash. Requests that contain the same QUIC ID are forwarded to the same backend server.\n\n>  QUIC ID hash is supported only when the backend protocol is set to UDP.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "ServerGroupId",
      "description": "The server group ID.",
      "position": "Body",
      "type": "String",
      "required": true
    },
    {
      "name": "ServerGroupName",
      "description": "The new name of the server group.\n\nThe name must be 2 to 128 characters in length, can contain digits, periods (.), underscores (\\_), and hyphens (-), and must start with a letter.",
      "position": "Body",
      "type": "String",
      "required": false
    }
  ]
}