{
  "name": "AddCasterComponent",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "CaptionLayerContent",
      "description": "The information about the subtitle layer. This parameter contains the following fields:\n\n*   **SizeNormalized**: the normalized value of the font size of the subtitle. The value of this field equals the font size divided by the output height and is accurate to two decimal places. Valid values: `[0,1]`. The maximum font size of the subtitle is **1,024**, even if the font size calculated based on this field is greater than **1,024**.\n*   **BorderWidthNormalized**: the normalized value of the border width of the subtitle. The value of this field equals the border width divided by the font size and is accurate to two decimal places. Valid values: `[0,1]`. The default value is **0**. The maximum border width is **16**, even if the border width calculated based on this field is greater than **16**.\n*   **FontName**: the font name of the text. Default value: KaiTi. For more information about the valid values, see **Description of available fonts in a streaming panel**.\n*   **BorderColor**: the color of the subtitle border. Valid values: 0x000000 to 0xffffff. By default, this parameter is not set. In this case, the border color of the subtitle is transparent.\n*   **LocationId**: the slot ID of the video source.\n*   **SourceLan**: the source language of the audio in the video source. Valid values: en, cn, es, and ru, which indicate English, Chinese, Spanish, and Russian respectively. Default value: cn.\n*   **TargetLan**: the destination language of the audio in the video source. Valid values: en, cn, es, and ru, which indicate English, Chinese, Spanish, and Russian respectively. Default value: cn.\n*   **ShowSourceLan**: specifies whether to display the source language. Valid values: true: displays the source language. false: hides the source language. Default value: false.\n*   **Truncation**: specifies whether the subtitle can be truncated. Valid values: true: specifies that the subtitle can be truncated. false: specifies that the subtitle cannot be truncated. Default value: false.\n*   **SourceLanPerLineWordCount**: the number of words displayed in each line when the subtitle is in the source language. Default value: 20.\n*   **TargetLanPerLineWordCount**: the number of words displayed in each line when the subtitle is in the destination language. Default value: 20.\n*   **SourceLanReservePages**: the number of lines reserved when the subtitle is in the source language. This field takes effect only when the Truncation field is set to true. Default value: 2.\n*   **TargetLanReservePages**: the number of lines reserved when the subtitle is in the destination language. This field takes effect only when the Truncation field is set to true. Default value: 2.\n\nThe value is a JSON string. Use upper camel case for field names.\n\n>  This parameter is required when the ComponentType parameter is set to caption.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "CasterId",
      "description": "The ID of the production studio.\n\nIf you create a production studio through the [CreateCaster](~~69338#doc-api-live-CreateCaster~~ \"Creates a production studio.\") interface, check the value of the CasterId parameter in the response.\n\nIf you create a production studio through the ApsaraVideo Live Console, log in to the console, then check the ID of the production studio through the following path:\n\nProduction Studios > Production Studio Management\n\n>  The CasterId is reflected in the Name column on the Production Studio Management page.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ComponentLayer",
      "description": "The information about the component layer, such as the size and layout. This parameter contains the following fields:\n\n*   **HeightNormalized**: the normalized value of heights for the elements in the component layer.\n*   **WidthNormalized**: the normalized value of widths for the elements in the component layer.\n*   **PositionNormalized**: the normalized value of the coordinates of the component layer.\n*   **PositionRefer**: the reference coordinates of the component layer.\n\nThe value is a JSON string. Use upper camel case for field names.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ComponentName",
      "description": "The name of the component. By default, the name is the ID of the component.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ComponentType",
      "description": "The type of the component. Valid values:\n\n*   **text**: a text component.\n*   **image**: an image component.\n*   **caption**: a subtitle component.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Effect",
      "description": "The effect of the component. Valid values:\n\n*   **none**: sets no effect for the component. This is the default value.\n*   **animateH**: sets horizontal scrolling for the component.\n*   **animateV**: sets vertical scrolling for the component.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "HtmlLayerContent",
      "description": "The information about the HTML5 layer.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ImageLayerContent",
      "description": "The information about the image layer. This parameter contains the following field:\n\n*   MaterialId: the ID of the material from the media library.\n\nThe value is a JSON string. Use upper camel case for the field name.\n\n>  This parameter is required when the ComponentType parameter is set to image.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "LayerOrder",
      "description": "The stacking order of the component.\n\n*   cover\n*   background",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "LocationId",
      "description": "The location ID of the component. Each location ID can be assigned to only one component and must be in the RC\\[Number] format. The values specified by this parameter must be in ascending order, such as RC01 to RC99.\n\n>  If the ComponentType parameter is set to caption, the LocationId parameter specifies the location ID of the video source referenced by the component.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "TextLayerContent",
      "description": "The information about the text layer. This parameter contains the following fields:\n\n*   **SizeNormalized**: the normalized value of the font size of the subtitle. The value of this field equals the font size divided by the output height. Valid values: `[0,1]`. The maximum font size of the subtitle is 1,024, even if the font size calculated based on this field is greater than 1,024.\n*   **BorderWidthNormalized**: the normalized value of the border width of the subtitle. The value of this field equals the border width divided by the font size. Valid values: `[0,1]`. The default value is 0. The maximum border width is 16, even if the border width calculated based on this field is greater than 16.\n*   **FontName**: the font name of the text. Default value: KaiTi. For more information about the valid values, see **Description of available fonts in a streaming panel**.\n*   **BorderColor**: the color of the subtitle border. Valid values: 0x000000 to 0xffffff. By default, this parameter is not set. In this case, the border color of the subtitle is transparent.\n*   **Text**: the content of the text. By default, this parameter is not set. In this case, the text contains no content.\n*   **Color**: the color of the text. The default value is 0xff0000, which indicates that the text is in red.\n\nThe value is a JSON string. Use upper camel case for field names.\n\n>  This parameter takes effect and is required only when the ComponentType parameter is set to text.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}