{
  "name": "AddStudioLayout",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "BgImageConfig",
      "description": "The background image configurations. The value is a JSON string. For more information, see **BgImageConfig**.\n\n\n**Important** This parameter is required only if the LayoutType parameter is set to studio.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "CasterId",
      "description": "The ID of the production studio instance.\n\n\n**Important** You must create a production studio instance of the Virtual Studio type in advance. You can call the [CreateCaster](~~69338~~) operation to create a production studio instance. Alternatively, you can log on to the ApsaraVideo Live console to create a production studio instance of the Virtual Studio type.\n\n*   If you call the [CreateCaster](~~69338~~) operation to create a production studio instance, you can obtain the instance ID from the CasterId parameter in the response.\n*   If you create a production studio instance in the ApsaraVideo Live console, perform the following operations to obtain the instance ID: Log on to the **ApsaraVideo Live console** and click **Production Studios** in the left-side navigation pane. Then, view the instance ID on the **Production Studio Management** page.\n\n>  The value displayed in the Name column for an instance on the Production Studio Management page is the ID of the instance.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "CommonConfig",
      "description": "The common layout configurations. The value is a JSON string. For more information, see **CommonConfig**.\n\n\n**Important** This parameter is required only if the LayoutType parameter is set to common.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "LayerOrderConfigList",
      "description": "The layer sorting configurations. The value is a JSON string. For more information, see **layerOrderConfig**.\n\nYou can sort layers of background and multimedia materials. The image matting layer cannot be sorted. The layer that is in the front of the code is placed behind the other layer in the layout.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "LayoutName",
      "description": "The name of the layout.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "LayoutType",
      "description": "The type of the layout. Valid values:\n\n*   **common**: If you set this parameter to common, you must specify CommonConfig.\n*   **studio**: If you set this parameter to studio, you must specify BgImageConfig and ScreenInputConfigList. The MediaInputConfigList parameter is optional.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "MediaInputConfigList",
      "description": "The multimedia input configurations. The value is a JSON string. For more information, see **MediaInputConfig**.\n\n\n**Important** This parameter is optional and is valid only if the LayoutType parameter is set to studio.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ScreenInputConfigList",
      "description": "The input configurations for image matting. The value is a JSON string. For more information, see **ScreenInputConfig**.\n\n\n**Important** This parameter is required only if the LayoutType parameter is set to studio.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}