{
  "name": "DescribeLiveRealtimeDeliveryAcc",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "DomainName",
      "description": "The streaming domain.\n\n*   You can query one or more domain names. If you specify multiple domain names, separate them with commas (,).\n*   If you leave this parameter empty, the data of all domain names within your Alibaba Cloud account is returned.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EndTime",
      "description": "The end of the time range to query. Specify the time in the ISO 8601 standard in the *yyyy-MM-dd*T*HH:mm:ss*Z format. The time must be in UTC.\n\nThe end time must be later than the start time. The maximum time range that can be specified is one year.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Interval",
      "description": "The time granularity of the query. Unit: seconds. Valid values:\n\n*   **300**\n*   **3600**\n*   **86400**\n\nIf you specify an invalid value or do not specify this parameter, the default value is used. If the specified time range is no more than three days, the default value is 300. If the specified time range is more than three days and no more than 30 days, the default value is 3600. If the specified time range is more than 30 days, the default value is 86400.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "LogStore",
      "description": "The name of the Logstore to which log entries are delivered. If you leave this parameter empty, the data of all Logstores is returned.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Project",
      "description": "The name of the Log Service project that is used for real-time log delivery. If you leave this parameter empty, the data of all Log Service projects is returned.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "StartTime",
      "description": "The beginning of the time range to query. Specify the time in the ISO 8601 standard in the *yyyy-MM-dd*T*HH:mm:ss*Z format. The time must be in UTC.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}