{
  "name": "DescribeLiveStreamPushMetricDetailData",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AppName",
      "description": "The name of the application to which the live stream belongs. The stream-level data of this application is returned.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DomainName",
      "description": "*   The accelerated domain name. You can specify only one domain name. If you specify multiple domain names, an error occurs.\n*   If you do not specify the AppName and StreamName parameters, data of all streams under the specified domain name is returned. The data is not aggregated.\n*   If you specify the DomainName parameter and set both the AppName and StreamName parameters to all, data of all streams in all applications under the specified domain name is aggregated and returned.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "EndTime",
      "description": "The end of the time range to query. The end time must be later than the start time, and the maximum time range that can be specified is one day. Specify the time in the ISO 8601 standard\n\nin the yyyy-MM-ddTHH:mm:ssZ format. The time must be in UTC.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "NextPageToken",
      "description": "A pagination token. When you call this operation, up to 5,000 rows of data can be returned per query. If the number of rows exceeds 5,000, the response includes a pagination token that is used in the next request to retrieve a new page of results.\n\nWhen you specify the token in the next query, data continues to be obtained from the end of the previous query.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "StartTime",
      "description": "The beginning of the time range to query. Specify the time in the ISO 8601 standard in the YYYY-MM-DDThh:mm:ssZ format. The time must be in UTC.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "StreamName",
      "description": "The name of the live stream. The data of the stream in the specified application is returned. If the StreamName parameter is specified, the AppName parameter must also be specified.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}