{
  "name": "DescribeLiveStreamMetricDetailData",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AppName",
      "description": "The name of the application for which you want to query the monitoring data of streams.\n\n>  If you specify the StreamName parameter, you must also specify the AppName parameter.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DomainName",
      "description": "The accelerated domain name. You can specify only one domain name. If you specify multiple domain names, errors occur.\n\nIf you do not specify the AppName and StreamName parameters, monitoring data of all streams for the domain name is returned.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EndTime",
      "description": "The end of the time range to query. The end time must be later than the start time, and the maximum time range is 1 day. Specify the time in the ISO 8601 standard in the YYYY-MM-DDThh:mm:ssZ format. The time must be in UTC.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "NextPageToken",
      "description": "The token used to query data by page. Up to 5,000 rows of data can be returned per query. If the number of rows exceeds 5,000, a token that determines the start point of the next query is provided in the response. If you specify this parameter, data continues to be obtained from the end of the previous query.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Protocol",
      "description": "The streaming protocol. Valid values: **flv**, **hls**, **rtmp**, **rts**, and **p2p**.\n\nYou can specify multiple protocols. Separate multiple protocols with commas (,). However, data over multiple protocols is not aggregated and is returned based on the stream.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "StartTime",
      "description": "The beginning of the time range to query. Specify the time in the ISO 8601 standard in the YYYY-MM-DDThh:mm:ssZ format. The time must be in UTC.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "StreamName",
      "description": "The name of the stream. The stream must belong to the application that is specified by the AppName parameter.\n\n>  If you specify the StreamName parameter, you must also specify the AppName parameter.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}