{
  "name": "DescribeLiveGrtnDuration",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AppId",
      "description": "The ID of the application. Separate multiple application IDs with commas (,). You can specify up to 30 application IDs. By default, the aggregated data of all applications is returned.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Area",
      "description": "The ID of the billable region. Valid values:\n\n*   CN: Chinese mainland\n*   OverSeas: countries and regions outside the Chinese mainland\n*   AP1: Asia Pacific 1, including Hong Kong (China), Macao (China), Taiwan (China), Japan, and other Southeast Asia countries and regions except Vietnam and Indonesia\n*   AP2: Asia Pacific 2, including Indonesia, South Korea, and Vietnam\n*   AP3: Asia Pacific 3, including Australia and New Zealand\n*   NA: North America, including US and Canada\n*   SA: South America, specifically meaning Brazil\n*   EU: Europe, including Ukraine, UK, France, Netherlands, Spain, Italy, Sweden, and Germany\n*   MEAA: Middle East and Africa, including South Africa, Oman, UAE, and Kuwait\n\nIf you do not specify this parameter, data of all regions is aggregated and returned by default.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EndTime",
      "description": "The end of the time range to query. Specify the time in the ISO 8601 standard in the yyyy-MM-ddTHH:mm:ssZ format. The time must be in UTC. The end time must be later than the start time. The time range that can be specified is greater than or equal to 5 minutes and less than or equal to 31 days.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Interval",
      "description": "The time granularity of the query. Unit: seconds. Valid values:\n\n*   300\n*   3600\n*   86400\n\nIf you specify an invalid value or do not specify this parameter, the default value 3600 is used.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "StartTime",
      "description": "The beginning of the time range to query. Specify the time in the ISO 8601 standard in the yyyy-MM-ddTHH:mm:ssZ format. The time must be in UTC.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}