{
  "name": "DescribeLiveDomainBpsDataByLayer",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "DomainName",
      "description": "The streaming domain. You can specify multiple domain names by separating them with commas (,). If you leave this parameter empty, the data of all domain names within your Alibaba Cloud account is returned.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EndTime",
      "description": "The end of the time range to query. The end time must be later than the start time. Specify the time in the ISO 8601 standard in the *yyyy-MM-ddTHH:mm:ssZ* format. The time must be displayed in UTC.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Interval",
      "description": "The time granularity of the query. Unit: seconds. Valid values:\n\n*   **300**\n*   **3600**\n*   **86400**\n\n> \n\n*   If the time range specified by the StartTime and EndTime parameters is smaller than or equal to 3 days, the supported time granularities include 300, 3,600, and 86,400 seconds.\n\n*   If the time range is larger than 3 days but smaller than or equal to 31 days, the supported time granularities include 3,600 and 86,400 seconds.\n\n*   If the time range is larger than 31 days, the supported time granularity is 86,400 seconds.\n\n*   If you specify an invalid value or do not specify this parameter, the default time granularity of 300 seconds is used.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "IspNameEn",
      "description": "The name of the Internet service provider (ISP). If you do not specify this parameter, the data of all ISPs is returned.\n\n>  You can call the [DescribeLiveRegionAndIsp](~~91077~~) operation to query available regions and ISPs.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Layer",
      "description": "The layer at which you want to query the data. Valid values:\n\n*   IPv4 and IPv6 (network layer)\n*   http, https, and quic (application layer)\n*   all (default)",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "LocationNameEn",
      "description": "The name of the region. If you do not specify this parameter, the data of all regions is returned.\n\n>  You can call the [DescribeLiveRegionAndIsp](~~91077~~) operation to query available regions and ISPs.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "StartTime",
      "description": "The beginning of the time range to query. Specify the time in the ISO 8601 standard in the *yyyy-MM-ddTHH:mm:ssZ* format. The time must be displayed in UTC.\n\n>  If you do not specify this parameter, the data of the last 24 hours is returned by default. The minimum time granularity is 5 minutes.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}