{
  "name": "DescribeLiveProducerUsageData",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "DomainName",
      "description": "The streaming domain of the production studio. Separate multiple streaming domains with commas (,).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EndTime",
      "description": "The end of the time range to query. Specify the time in the ISO 8601 standard in the yyyy-MM-ddTHH:mm:ssZ format. The time must be in UTC.\n\n>  The end time must be later than the start time.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Instance",
      "description": "The production studio instance that you want to query. You can specify one or more production studio instances. Separate multiple instances with commas (,).\n\n>  If you do not set this parameter, the usage data of all production studio instances is returned.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Interval",
      "description": "The time granularity for a query. Valid values: 3600 and 86400. Unit: seconds.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Region",
      "description": "The ID of the region where the domain name resides.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SplitBy",
      "description": "The key that is used to group data. You can specify one or more keys. Separate multiple keys with commas (,). Valid values: domain, region, instance, and type. The data for a key that you specify by using the SplitBy parameter is returned by group.\n\n>  If you do not set this parameter, the aggregated data is returned.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "StartTime",
      "description": "The beginning of the time range to query. Specify the time in the ISO 8601 standard in the yyyy-MM-ddTHH:mm:ssZ format. The time must be in UTC.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Type",
      "description": "The type of the production studio. You can specify one or more production studio types. Separate multiple types with commas (,). Valid values:\n\n*   **slidelive**: playlist-mode studio.\n*   **universal**: general studio.\n\n>  If you do not set this parameter, the usage data of all types of production studios is returned.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "app",
      "description": "The name of the application to which the live stream belongs.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}