{
  "name": "DescribeLivePushProxyUsageData",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "DomainName",
      "description": "The main streaming domain to query.\n\n*   You can query one or more domain names. If you specify multiple domain names, separate them with commas (,).\n*   If you leave this parameter empty, the data of all domain names within your Alibaba Cloud account is returned.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EndTime",
      "description": "The end of the time range to query. Specify the time in the ISO 8601 standard in the yyyy-MM-ddTHH:mm:ssZ format. The time must be in UTC. The end time must be later than the start time.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Region",
      "description": "The ID of the region. Separate multiple region IDs with commas (,). Valid values:\n\n*   cn-beijing: China (Beijing)\n*   cn-shanghai: China (Shanghai)\n*   cn-shenzhen: China (Shenzhen)\n*   cn-qingdao: China (Qingdao)\n*   ap-southeast-1: Singapore\n*   eu-central-1: Germany (Frankfurt)\n*   ap-northeast-1: Japan (Tokyo)\n*   ap-southeast-5: Indonesia (Jakarta)\n\nIf you do not specify this parameter, data of all regions is aggregated and returned by default.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SplitBy",
      "description": "The key that is used to group data. If you do not specify this parameter, the default value region is used. Data is aggregated and returned. Separate multiple keys with commas (,). Valid values:\n\n*   domain: The value of DomainName in the response takes effect only if SplitBy is set to domain.\n*   region: This is the default value. The value of Region in the response takes effect only if SplitBy is set to region.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "StartTime",
      "description": "The beginning of the time range to query. Specify the time in the ISO 8601 standard in the yyyy-MM-ddTHH:mm:ssZ format. The time must be in UTC. By default, data in the last seven days is returned.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}