{
  "name": "ModifyShowList",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "CasterId",
      "description": "The ID of the production studio.\n\n*   If the production studio was created by calling the [CreateCaster](~~2848009~~) operation, check the value of the response parameter CasterId to obtain the ID.\n*   If the production studio was created by using the ApsaraVideo Live console, obtain the ID on the **Production Studio Management** page. To go to the page, log on to the **ApsaraVideo Live console** and click **Production Studios** in the left-side navigation pane.\n\n>  You can find the ID of the production studio in the Instance ID/Name column.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "HighPriorityShowId",
      "description": "The episode of the highest priority.\n\n>  You can configure this parameter only before the playback of the episode list starts.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "HighPriorityShowStartTime",
      "description": "The time at which the episode of the highest priority is played. Format: yyyy-MM-dd'T'HH:mm:ss.\n\n>  You can configure this parameter only before the episode list starts playing.\\\nAfter you configure this parameter, when the specified point in time is reached, any episode that is playing stops and the episode of the highest priority in the episode list starts to play.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RepeatTimes",
      "description": "The number of additional times the episode list is played.\n\n> \n\n*   The RepeatTimes parameter specifies the number of repetitions. For example, if you set the value to **0**, the episode list is played **once**. If you set the value to **1**, the episode list is played **twice**.********\n\n*   If you set the value to -1, the episode list is repeated indefinitely.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "ShowId",
      "description": "The ID of the episode for which you want to change the position in the playlist.\n\n>  You can call the [AddShowIntoShowList](~~2848051~~) or [DescribeShowList](~~2848054~~) operation and check the value of the response parameter ShowId to obtain the ID.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Spot",
      "description": "The position of the episode in the episode list. If you want to change the position of an episode in a playlist, place the ID of the episode in **Spot**.\n\n>  The value must be greater than or equal to 0 and less than or equal to the total number of episodes in the playlist.",
      "position": "Query",
      "type": "Integer",
      "required": false
    }
  ]
}