{
  "name": "ModifyCasterComponent",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "CaptionLayerContent",
      "description": "The information about the caption layer, in the JSON format. This parameter contains the following fields:\n\n*   **SizeNormalized**: the normalized value of the font size. The value of this field equals the font size divided by the output height. Valid values: `0 to 1`. The maximum font size of the caption is 1,024, even if the font size calculated based on this field is greater than 1,024.\n*   **BorderWidthNormalized**: the normalized value of the border width. The value of this field equals the border width divided by the font size. Valid values: `0 to 1`. Default value: 0. The maximum border width is 16, even if the border width calculated based on this field is greater than 16.\n*   **FontName**: the name of the font. Default value: KaiTi. For more information about the valid values, see **Description of available fonts in a production studio**.\n*   **BorderColor**: the color of the text border. Valid values: 0x000000 to 0xffffff. By default, this parameter is not set. In this case, the color of the text border is transparent.\n*   **LocationId**: the channel ID of the video source.\n*   **SourceLan**: the source audio language in the video source. Valid values: en, cn, es, and ru, which indicate English, Chinese, Spanish, and Russian respectively. Default value: cn.\n*   **TargetLan**: the target audio language in the video source. Valid values: en, cn, es, and ru, which indicate English, Chinese, Spanish, and Russian respectively. Default value: cn.\n*   **ShowSourceLan**: specifies whether to display the source language. true: displays the source language. false: hides the source language. Default value: false.\n*   **Truncation**: specifies whether the caption can be truncated. true: specifies that the caption can be truncated. false: specifies that the caption cannot be truncated. Default value: false.\n*   **SourceLanPerLineWordCount**: the number of words displayed in each line of the source language. This field takes effect only when the Truncation field is set to true. Default value: 20.\n*   **TargetLanPerLineWordCount**: the number of words displayed in each line of the target language. This field takes effect only when the Truncation field is set to true. Default value: 20.\n\n>  This parameter is required when the ComponentType parameter is set to caption.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "CasterId",
      "description": "The ID of the production studio.\n\nIf you create a production studio through the [CreateCaster](~~69338#doc-api-live-CreateCaster~~ \"Creates a production studio.\") interface, check the value of the CasterId parameter in the response.\n\nIf you create a production studio through the ApsaraVideo Live Console, log in to the console, then check the ID of the production studio through the following path:\n\nProduction Studios > Production Studio Management\n\n>  The CasterId is reflected in the Name column on the Production Studio Management page.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ComponentId",
      "description": "The ID of the component. It is included in the response when you call the [AddCasterComponent](~~63160#doc-api-live-AddCasterComponent~~ \"Adds a component to a production studio.\") operation.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ComponentLayer",
      "description": "The information about the component layer, such as the size and layout, in the JSON format. This parameter contains the following fields:\n\n*   **HeightNormalized**: the normalized value of heights for the elements in the component layer.\n*   **WidthNormalized**: the normalized value of widths for the elements in the component layer.\n*   **PositionNormalized**: the normalized value of the coordinates of the component layer.\n*   **PositionRefer**: the reference coordinates of the component layer.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ComponentName",
      "description": "The name of the component. By default, the name is the ID of the component.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ComponentType",
      "description": "The type of the component. Valid values:\n\n*   **text**: text component.\n*   **image**: image component.\n*   **caption**: caption component.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Effect",
      "description": "The effect for the component. Valid values:\n\n*   **none**: specifies no effects for the component. This is the default value.\n*   **animateH**: specifies horizontal scrolling for the component.\n*   **animateV**: specifies vertical scrolling for the component.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ImageLayerContent",
      "description": "The information about the image layer, in the JSON format. This parameter contains the following fields:\n\nMaterialId: the ID of the asset from the media asset library.\n\n>  This parameter is required when the ComponentType parameter is set to image.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TextLayerContent",
      "description": "The information about the text layer, in the JSON format. This parameter contains the following fields:\n\n*   **SizeNormalized**: the normalized value of the font size. The value of this field equals the font size divided by the output height. Valid values: `0 to 1`. The maximum font size of the text is 1,024, even if the font size calculated based on this field is greater than 1,024.\n*   **BorderWidthNormalized**: the normalized value of the border width. The value of this field equals the border width divided by the font size. Valid values: `0 to 1`. Default value: 0. The maximum border width is 16, even if the border width calculated based on this field is greater than 16.\n*   **FontName**: the name of the font. Default value: KaiTi. For more information about the valid values, see **Description of available fonts in a production studio**.\n*   **BorderColor**: the color of the text border. Valid values: 0x000000 to 0xffffff. By default, this parameter is not set. In this case, the color of the text border is transparent.\n*   **Text**: the content of the text. By default, this parameter is not set. In this case, the text contains no content.\n*   **Color**: the color of the text. The default value is 0xff0000, which indicates that the text is in red.\n\n>  This parameter is required when the ComponentType parameter is set to text.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}