{
  "name": "ModifyCasterComponent",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "CaptionLayerContent",
      "description": "The information about the subtitle component. The value must be a JSON string. This parameter contains the following fields:\n\n>  This parameter is required if you set ComponentType to caption.\n\n*   **SizeNormalized**: the normalized value of the font size. The value of this field equals the font size divided by the output height. Valid values: `0 to 1`. The maximum font size is 1,024, even if the font size calculated based on this field is greater than 1,024.\n*   **BorderWidthNormalized**: the normalized value of the border width. The value of this field equals the border width divided by the font size. Valid values: `0 to 1`. Default value: 0. The maximum border width is 16, even if the border width calculated based on this field is greater than 16.\n*   **FontName**: the font name. Default value: KaiTi. For more information about the valid values, see **Fonts used in a production studio**.\n*   **BorderColor**: the color of the text border. Valid values: 0x000000 to 0xffffff. By default, this parameter is left empty. In this case, the color of the text border is transparent.\n*   **LocationId**: the channel ID of the source subtitles.\n*   **SourceLan**: the source language of the subtitles in the video. Valid values: en (English), cn (Chinese), es (Spanish), and ru (Russian). Default value: cn.\n*   **TargetLan**: the target language of the subtitles in the video. If you do not specify this field, speech recognition is used. If you specify this field, translation is used. Valid values: en (English), cn (Chinese), es (Spanish), and ru (Russian).\n*   **ShowSourceLan**: specifies whether to display the source language. A value of true specifies that the source language is displayed. A value of false specifies that the source language is not displayed. Default value: false.\n*   **Truncation**: specifies whether to allow subtitle truncation. A value of true specifies that the subtitles can be truncated. A value of false specifies that the subtitles cannot be truncated. Default value: false.\n*   **SourceLanPerLineWordCount**: the number of words displayed in each line of the source language. This field takes effect only if you set Truncation to true. Default value: 20.\n*   **TargetLanPerLineWordCount**: the number of words displayed in each line of the target language. This field takes effect only if you set Truncation to true. Default value: 20.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "CasterId",
      "description": "The ID of the production studio.\n\n*   If the production studio was created by calling the [CreateCaster](~~2848009~~) operation, check the value of the response parameter CasterId to obtain the ID.\n*   If the production studio was created by using the ApsaraVideo Live console, obtain the ID on the **Production Studio Management** page. To go to the page, log on to the **ApsaraVideo Live console** and click **Production Studios** in the left-side navigation pane.\n\n>  You can find the ID of the production studio in the Instance ID/Name column.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ComponentId",
      "description": "The ID of the component. If the component was added by calling the [AddCasterComponent](~~2848030~~) operation, check the value of the response parameter ComponentId to obtain the ID.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ComponentLayer",
      "description": "The information about the component layer, such as the size and layout, The value must be a JSON string. This parameter contains the following fields:\n\n*   **HeightNormalized**: the normalized value of the height of the component layer.\n*   **WidthNormalized**: the normalized value of the width of the component layer.\n*   **PositionNormalized**: the normalized value of the position of the component layer.\n*   **PositionRefer**: the reference coordinates of the component layer.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ComponentName",
      "description": "The name of the component. By default, the name is the ID of the component.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ComponentType",
      "description": "The type of the component. Valid values:\n\n*   **text**: text component. The TextLayerContent parameter is required if you set ComponentType to text.\n*   **image**: image component. The ImageLayerContent parameter is required if you set ComponentType to image.\n*   **caption**: subtitle component. The CaptionLayerContent parameter is required if you set ComponentType to caption.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Effect",
      "description": "The display effect for the component. Valid values:\n\n*   **none** (default)\n*   **animateH**: horizontal scrolling\n*   **animateV**: vertical scrolling",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ImageLayerContent",
      "description": "The information about the image component. The value must be a JSON string.\n\n>  This parameter is required if you set ComponentType to image.\n\nThe MaterialId field specifies the ID of the material from the media asset library.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TextLayerContent",
      "description": "The information about the text component. The value must be a JSON string. This parameter contains the following fields:\n\n>  This parameter is required if you set ComponentType to text.\n\n*   **SizeNormalized**: the normalized value of the font size. The value of this field equals the font size divided by the output height. Valid values: `0 to 1`. The maximum font size is 1,024, even if the font size calculated based on this field is greater than 1,024.\n*   **BorderWidthNormalized**: the normalized value of the border width. The value of this field equals the border width divided by the font size. Valid values: `0 to 1`. Default value: 0. The maximum border width is 16, even if the border width calculated based on this field is greater than 16.\n*   **FontName**: the font name. Default value: KaiTi. For more information about the valid values, see **Fonts used in a production studio**.\n*   **BorderColor**: the color of the text border. Valid values: 0x000000 to 0xffffff. By default, this parameter is left empty. In this case, the color of the text border is transparent.\n*   **Text**: the content of the text. By default, this parameter is left empty. In this case, the text contains no content.\n*   **Color**: the color of the text. The default value is 0xff0000, which indicates that the text is in red.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}