{
  "name": "SendLiveMessageUser",
  "deprecated": false,
  "protocol": "HTTPS",
  "method": "POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AppId",
      "description": "The ID of the interactive messaging application in which the message is sent.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Body",
      "description": "The message body. It can be up to 15 KB in length.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DataCenter",
      "description": "The data center. It must be the same as the data center that was specified when you called the [CreateLiveMessageApp](~~2848162~~) operation to create the interactive messaging application. Valid values: cn-shanghai and ap-southeast-1 (Singapore).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "HighReliability",
      "description": "Specifies whether to set the message as a highly reliable message. A highly reliable message ensures that success is returned only after the receiver has received the message and responded. If the receiver does not respond within 3 seconds, failure is returned.\n\n*   true: sets the message as a highly reliable message.\n*   false (default): does not set the message as a highly reliable message.\n\n>  This parameter is supported only by the client SDK V1.5.1 and later. When you send a message to a client with an earlier SDK version, the message can be successfully sent without waiting for an acknowledgement (ACK) response.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "MsgTid",
      "description": "The ID of the message, which is a unique identifier that can be used to delete the message. The ID can be up to 64 bytes in length and can contain letters and digits.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "MsgType",
      "description": "The message type.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "ReceiverId",
      "description": "The ID of the user who receives the message. The ID can be up to 64 bytes in length and can contain letters and digits.\n\n>  Make sure that the user who receives the message is online. You can call the CheckLiveMessageUsersOnline operation to query whether the user is online.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "SenderId",
      "description": "The ID of the user who sends the message. The ID can be up to 64 bytes in length and can contain letters and digits.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "SenderInfo",
      "description": "The additional information about the user who sends the message. It can be up to 512 bytes in length.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Storage",
      "description": "Specifies whether to store the message.\n\n*   true: stores the message.\n*   false (default): does not store the message.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    }
  ]
}