{
  "name": "SetCasterConfig",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AutoSwitchUrgentConfig",
      "description": "",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "AutoSwitchUrgentOn",
      "description": "",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "CallbackUrl",
      "description": "The callback URL. Enter a valid HTTP address for receiving callback notifications. If you do not specify this parameter, the production studio does not send callback notifications.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "CasterId",
      "description": "The ID of the production studio.\n\n*   If the production studio was created by calling the [CreateCaster](~~69338~~) operation, check the value of the response parameter CasterId to obtain the ID of the production studio.\n*   If the production studio was created by using the ApsaraVideo Live console, obtain the ID on the **Production Studio Management** page. To go to the page, log on to the **ApsaraVideo Live console** and click **Production Studios** in the left-side navigation pane.\n\n> You can find the ID of the production studio in the Instance Name column.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "CasterName",
      "description": "The name of the production studio.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ChannelEnable",
      "description": "Specifies whether to enable the channel. Valid values:\n\n*   **0** (default): disables the channel.\n*   **1**: enables the channel.\n\n> You cannot disable the channel after you enable it. If you set this parameter to 0, the production studio references video resources in a layout without using the channel. If you enable the channel for the first time, make sure that the production studio is in the idle state. After you enable the channel, a new layout that references video resources by using the channel is generated to replace the original one. Therefore, you must specify video resources for the channel. You can use the channel to change the playback progress or status. If the video resource, preview, and program modules of the production studio use the same video source, the three modules display the same content.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "Delay",
      "description": "Specifies whether to enable stream delay. Unit: seconds. Valid values:\n\n*   **0** (default): disables stream delay.\n*   A value greater than 0****: enables stream delay.\n*   **Empty**: clears the stream delay configuration.",
      "position": "Query",
      "type": "Float",
      "required": false
    },
    {
      "name": "DomainName",
      "description": "The main streaming domain.\n\nComplete the configuration of the domain name before the production studio is started. If you do not specify this parameter, the domain configuration for the production studio is cleared.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ProgramEffect",
      "description": "Specifies whether to enable the carousel playback feature. Valid values:\n\n*   **0**: disables carousel playback.\n*   **1**: enables carousel playback.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "ProgramName",
      "description": "The name of the playlist for carousel playback. You can specify this parameter if you enable the carousel playback feature.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RecordConfig",
      "description": "The recording configuration. The value is a JSON string. You can configure the following fields:\n\n*   **endpoint**: the API server address of an Alibaba Cloud service.\n*   **ossBucket**: the name of the Object Storage Service (OSS) bucket.\n*   **videoFormat**: the format in which the video file can be exported. Example: `[\"flv\",\"m3u8\" ]`.\n*   **interval**: the interval between recordings. Unit: milliseconds.\n\n> If you do not specify this parameter, the recording feature is disabled and the recording configuration for the production studio is cleared.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SideOutputUrl",
      "description": "The custom stream redirect URL. If you do not specify this parameter, the production studio uses the redirect URL generated by the system.\n\n> Redirect URLs support only the Real-Time Messaging Protocol (RTMP) protocol.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SideOutputUrlList",
      "description": "The stream relay URLs. A relay URL can be an Alibaba Cloud URL or a URL from a third-party CDN provider. You can specify up to 20 relay URLs over the RTMP protocol.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SyncGroupsConfig",
      "description": "The multi-view synchronization configuration. You can specify this parameter to synchronize multiple video sources. There are two modes of multi-view synchronization.\n\n*   A value of 0 for the mode attribute specifies the streamer mode. In this mode, multiple video sources are synchronized based on the settings by the streamer.\n*   A value of 1 for the mode attribute specifies the conference mode. In this mode, all video sources are synchronized.\n\nIn the streamer mode, the hostResourceId attribute specifies the video source on the streamer side.\n\nIn the conference mode, the hostResourceId attribute is not available. Only resource IDs that are required are provided.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TranscodeConfig",
      "description": "The transcoding configuration.\n\nThe value is a JSON string. Use upper camel case for fields of the string. If you do not specify this parameter, the transcoding configuration is cleared. If no transcoding template is available, an error occurs when the production studio is started.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "UrgentImageId",
      "description": "备播媒资库图片素材ID。",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "UrgentImageUrl",
      "description": "备播图片素材URL。",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "UrgentLiveStreamUrl",
      "description": "The URL of the standby live stream.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "UrgentMaterialId",
      "description": "The ID of the material that is used as the standby video from the media library. If you do not specify this parameter, the standby video configuration for the production studio is cleared.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}