{
  "name": "SetCasterConfig",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AutoSwitchUrgentConfig",
      "description": "The configuration for automatic switchover to the standby resource.\n\nThe `eofThres` field specifies the duration after which the production studio automatically switches to the standby resource if a stream interruption occurs. Unit: seconds.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "AutoSwitchUrgentOn",
      "description": "Specifies whether the production studio automatically switches to the standby resource in case of a stream interruption.\n\n*   **true**\n*   **false**",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "CallbackUrl",
      "description": "The callback URL. Enter a valid HTTP address for receiving callback notifications. If you do not specify this parameter, the production studio does not send callback notifications.\n\n>  For more information about production studio callbacks, see [Production studio callbacks](~~213633~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "CasterId",
      "description": "The ID of the production studio.\n\n*   If the production studio was created by calling the [CreateCaster](~~2848009~~) operation, check the value of the response parameter CasterId to obtain the ID.\n*   If the production studio was created by using the ApsaraVideo Live console, obtain the ID on the **Production Studio Management** page. To go to the page, log on to the **ApsaraVideo Live console** and click **Production Studios** in the left-side navigation pane.\n\n>  You can find the ID of the production studio in the Instance ID/Name column.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "CasterName",
      "description": "The name of the production studio.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ChannelEnable",
      "description": "Specifies whether to enable channels. Valid values:\n\n*   **0** (default): disables channels.\n*   **1**: enables channels.\n\n> You cannot disable channels after you enable them. If you set this parameter to 0, the production studio references video resources in a layout without using channels. If you enable channels for the first time, make sure that the production studio is in the idle state. After you enable channels, a new layout that references video resources by using channels is generated to replace the original one. Therefore, you must specify video resources for channels. You can use the channels to change the playback progress or status. If the video resource, preview, and program modules of the production studio use the same video source, the three modules display the same content.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "Delay",
      "description": "Specifies whether to enable stream delay. Unit: seconds. Valid values:\n\n*   **0** (default): disables stream delay.\n\n*   **A value greater than 0**: enables stream delay.\n\n*   **Empty**: clears the stream delay configuration.\n\n    **\n\n    **Note **The maximum value can be 300 seconds.",
      "position": "Query",
      "type": "Float",
      "required": false
    },
    {
      "name": "DomainName",
      "description": "The main streaming domain.\n\nComplete the configuration of the domain name before the production studio is started. If you do not specify this parameter, the domain configuration for the production studio is cleared.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ProgramEffect",
      "description": "Specifies whether to enable the carousel playback feature. Valid values:\n\n*   **0**: disables carousel playback.\n*   **1**: enables carousel playback.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "ProgramName",
      "description": "The name of the playlist for carousel playback. You can specify this parameter if you enable the carousel playback feature.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RecordConfig",
      "description": "The recording configuration. The value is a JSON string. You can configure the following fields:\n\n*   **endpoint**: the API server address of an Alibaba Cloud service.\n*   **ossBucket**: the name of the Object Storage Service (OSS) bucket.\n*   **videoFormat**: the format in which the video file can be exported. Example: `[{\\\"OssObjectPrefix\\\":\\\"record/{AppName}/{StreamName}/{StartTime}_{EndTime}\\\",\\\"Format\\\":\\\"m3u8\\\",\\\"CycleDuration\\\":21600,\\\"SliceOssObjectPrefix\\\":\\\"record/{AppName}/{StreamName}/{UnixTimestamp}\\\"},{\\\"OssObjectPrefix\\\":\\\"record/{AppName}/{StreamName}/{StartTime}_{EndTime}\\\",\\\"Format\\\":\\\"flv\\\",\\\"CycleDuration\\\":21600}]`.\n*   **interval**: the interval between recordings. Unit: milliseconds.\n\n> If you do not specify this parameter, the recording feature is disabled and the recording configuration for the production studio is cleared.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SideOutputUrl",
      "description": "The custom stream redirect URL.\n\nIf you do not specify this parameter, the production studio uses the redirect URL generated by the system.\n\n> Redirect URLs support only the Real-Time Messaging Protocol (RTMP) protocol.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SideOutputUrlList",
      "description": "The stream relay URLs. A relay URL can be an Alibaba Cloud URL or a URL from a third-party CDN provider. You can specify up to 20 relay URLs over the RTMP protocol.\n\n> Use the following format to specify multiple relay URLs: \"rtmp://domain/app1/stream1\",\"rtmp://domain/app2/stream2\".",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SyncGroupsConfig",
      "description": "The multi-view synchronization configuration. You can specify this parameter to synchronize multiple video sources.\n\nThere are two modes of multi-view synchronization.\n\n*   A value of 0 for the mode field specifies the streamer mode. In this mode, multiple video sources are synchronized based on the settings by the streamer.\n*   A value of 1 for the mode field specifies the conference mode. In this mode, all video sources are synchronized.\n\nIn the streamer mode, the hostResourceId field specifies the video source on the streamer side.\n\nIn the conference mode, the hostResourceId field is not available. You need to provide only resource IDs that are required.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TranscodeConfig",
      "description": "The transcoding configuration.\n\nThe value is a JSON string. Use upper camel case for fields of the string. If you do not specify this parameter, the transcoding configuration is cleared. If no transcoding template is available, an error occurs when the production studio is started.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "UrgentImageId",
      "description": "The ID of the standby image from the media library.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "UrgentImageUrl",
      "description": "The URL of the standby image.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "UrgentLiveStreamUrl",
      "description": "The URL of the standby live stream.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "UrgentMaterialId",
      "description": "The ID of the standby video from the media library. If you do not specify this parameter, the standby video configuration for the production studio is cleared.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}