{
  "name": "UpdateLivePullToPush",
  "deprecated": false,
  "protocol": "HTTPS",
  "method": "GET",
  "pathPattern": "",
  "parameters": [
    {
      "name": "CallbackUrl",
      "description": "The callback URL. By default, this parameter is left empty.\n\n> \n\n*   The URL is used to receive callbacks related to the task.\n\n*   The URL can be up to 2,000 characters in length.\n\n*   If you do not specify this parameter, no callbacks are returned for events related to the task.\n\n*   The update takes effect for subsequent events that occur.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EndTime",
      "description": "The end time of the task.\n\n> \n\n*   Specify the time in the ISO 8601 standard in the *yyyy-MM-dd*T*HH:mm:ss*Z format. The time must be in UTC.\n\n*   The time range specified by the StartTime and EndTime parameters cannot exceed seven days.\n\n*   The end time must be later than the start time.\n\n*   The end time must be later than the current time.\n\n*   If the task has ended, the update does not take effect.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "FileIndex",
      "description": "The file index. Default value: 0.\n\n>  You can modify this parameter only if the task is stopped. The update takes effect after you restart the task.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "Offset",
      "description": "The offset of the position where the system starts to read the video resource. Unit: seconds. Valid values: positive numbers.\n\n> \n\n*   This parameter indicates an offset from the first frame.\n\n*   This parameter is applicable to only video resources from ApsaraVideo VOD or a third party.\n\n*   The update takes effect only for the first video in a video list.\n\n*   You can modify this parameter only if the task is stopped. The update takes effect immediately.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "Region",
      "description": "The region where the task is started. Valid values:\n\n*   ap-southeast-1: Singapore\n*   ap-southeast-5: Indonesia (Jakarta)\n*   cn-beijing: China (Beijing)\n*   cn-shanghai: China (Shanghai)",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "RegionId",
      "description": "",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RepeatNumber",
      "description": "The number of playbacks after the first playback is complete. Valid values:\n\n*   0 (default): specifies that the video list is played only once.\n*   \\-1: specifies that the video list is played in loop mode.\n*   Positive integer: specifies the number of times the video list repeats after the first playback is complete.\n\n> \n\n*   This parameter is applicable to only video resources from ApsaraVideo VOD or a third party.\n\n*   The update can take effect immediately.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "SourceUrls",
      "description": "The source URLs.\n\n> \n\n*   If SourceType is set to live, you can specify only one streaming URL.\n\n*   If SourceType is set to vod or url, you can specify up to 30 IDs or URLs.\n\n*   If SourceType is set to live, the supported protocols for URLs are Real-Time Messaging Protocol (RTMP), Real-Time Streaming Protocol (RTSP), Secure Reliable Transport Protocol (SRT), and HTTP-FLV.\n\n*   If SourceType is set to vod, specify the IDs of media assets from ApsaraVideo VOD.\n\n*   If SourceType is set to url, the supported protocols for URLs are MP4 and HTTP-FLV.\n\n*   If the source is a live stream, the update takes effect immediately. If the source is a list of video resources from ApsaraVideo VOD or a third party, the update does not take effect until the playback of the current video ends. After the update takes effect, the video list starts to play from the beginning.\n\n*   You can modify this parameter only if the task is stopped. The update takes effect immediately.",
      "position": "Query",
      "type": "Json",
      "required": false
    },
    {
      "name": "StartTime",
      "description": "The start time of the task.\n\n> \n\n*   Specify the time in the ISO 8601 standard in the *yyyy-MM-dd*T*HH:mm:ss*Z format. The time must be in UTC.\n\n*   The time range specified by the StartTime and EndTime parameters cannot exceed seven days.\n\n*   If the task has already started, the update does not take effect.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TaskId",
      "description": "The task ID.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}