{
  "name": "StartSyncExecution",
  "deprecated": false,
  "protocol": "HTTPS",
  "method": "POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ExecutionName",
      "description": "The name of the execution that you want to start. Set this parameter based on the following rules:\n\n*   The name can contain letters, digits, underscores (\\_), and hyphens (-).\n*   The name must start with a letter or an underscore (\\_).\n*   The name is case-sensitive.\n*   The name must be 1 to 128 characters in length.\n\nThe StartSyncExecution operation is different from the StartExecution operation. If you call the StartSyncExecution operation to synchronously start an execution in a flow, the execution name does not need to be unique in the flow. If you specify a name for the execution, the system appends a UUID to the execution name in the {ExecutionName}:{UUID} format. If you do not specify a name for the execution, the system automatically generates a name for the execution.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "FlowName",
      "description": "The name of the flow in which you want to start the execution. The name is unique within the same region and cannot be modified after the flow is created. Set this parameter based on the following rules:\n\n*   The name can contain letters, digits, underscores (\\_), and hyphens (-).\n*   The name must start with a letter or an underscore (\\_).\n*   The name is case-sensitive.\n*   The name must be 1 to 128 characters in length.",
      "position": "Body",
      "type": "String",
      "required": true
    },
    {
      "name": "Input",
      "description": "The input of the execution, which is in the JSON format.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "RequestId",
      "description": "The request ID. If you set this parameter, the system uses the parameter value as the request ID. If you do not set this parameter, the system generates a random value.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}