{
  "name": "CreateUploadAttachedMedia",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AppId",
      "description": "The ID of the application. Default value: **app-1000000**. If you have activated the multi-application service, specify the ID of the application to add the watermark template in the specified application. For more information, see [Overview](~~113600~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "BusinessType",
      "description": "The type of the auxiliary media asset. Valid values:\n\n*   **watermark**\n*   **subtitle**\n*   **material**",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "CateIds",
      "description": "The ID of the category. Separate multiple IDs with commas (,). You can specify up to five IDs. You can use one of the following methods to obtain the ID:\n\n*   Log on to the [ApsaraVideo VOD console](https://vod.console.aliyun.com). In the left-side navigation pane, choose **Configuration Management** > **Media Management** > **Categories** to view the category ID of the media file.\n*   Obtain the category ID from the response to the [AddCategory](~~AddCategory~~) operation that you call to create a category.\n*   Obtain the category ID from the response to the [GetCategories](~~GetCategories~~) operation that you call to query categories.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Description",
      "description": "The description of the auxiliary media asset. Take note of the following items:\n\n*   The description can be up to 1,024 bytes in length.\n*   The value must be encoded in UTF-8.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "FileName",
      "description": "The source file URL of the auxiliary media asset.\n\n>  The file name extension is optional. If the file name extension that you specified for this parameter is different from the value of MediaExt, the value of MediaExt takes effect.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "FileSize",
      "description": "The size of the auxiliary media asset. Unit: byte.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "MediaExt",
      "description": "The file name extension of the auxiliary media asset.\n\n*   Valid values for watermarks: **png, gif, apng, and mov**\n*   Valid values for subtitles: **srt, ass, stl, ttml, and vtt**\n*   Valid values for materials: **jpg, gif, png, mp4, mat, zip, and apk**",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "StorageLocation",
      "description": "The storage address. Perform the following operations to obtain the storage address:\n\nLog on to the [ApsaraVideo VOD console](https://vod.console.aliyun.com). In the left-side navigation pane, choose **Configuration Management** > **Media Management** > **Storage**. On the Storage page, view the storage address.\n\n>  If you leave this parameter empty, the auxiliary media asset is uploaded to the default storage address. If you specify this parameter, the auxiliary media asset is uploaded to the specified storage address.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Tags",
      "description": "The one or more tags of the auxiliary media asset. Take note of the following items:\n\n*   You can specify a maximum of 16 tags.\n*   If you need to specify multiple tags, separate the tags with commas (,).\n*   Each tag can be up to 32 characters in length.\n*   The value must be encoded in UTF-8.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Title",
      "description": "The title of the auxiliary media asset. The following rules apply:\n\n*   The title cannot exceed 128 bytes.\n*   The title must be encoded in UTF-8.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "UserData",
      "description": "The custom configurations. For example, you can specify callback configurations and upload acceleration configurations. The value must be a JSON string. For more information, see [Request parameters](~~86952#section-6fg-qll-v3w~~).\n\n> *   The callback configurations take effect only after you specify the HTTP callback URL and select the specific callback events in the ApsaraVideo VOD console. For more information about how to configure HTTP callback settings in the ApsaraVideo VOD console, see [Configure callback settings](~~86071~~).\n> *   If you want to enable the upload acceleration feature, submit a ticket. For more information, see [Overview](~~55396~~). For more information about how to submit a ticket, see [Contact us](~~464625~~).",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}