{
  "name": "GetAttachedMediaInfo",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AuthTimeout",
      "description": "The validity period of the URL. Unit: seconds.\n\n*   If you set the OutputType parameter to **cdn**:\n\n    *   The URL of the auxiliary media asset has a validity period only if URL signing is enabled. Otherwise, the URL of the auxiliary media asset is permanently valid.\n    *   Minimum value: **1**.\n    *   Maximum value: unlimited.\n    *   Default value: If you do not set this parameter, the default validity period that is specified in URL signing is used.\n\n*   If you set the OutputType parameter to **oss**:\n\n    *   The URL of the auxiliary media asset has a validity period only if the permissions on the Object Storage Service (OSS) bucket are private. Otherwise, the URL of the auxiliary media asset is permanently valid.\n    *   Minimum value: **1**.\n    *   The maximum value for a media asset stored in the VOD bucket is **2592000** (30 days) and the maximum value for a media asset stored in an OSS bucket is **129600** (36 hours). The maximum value is limited to reduce security risks of the origin.\n    *   Default value: If you do not set this parameter, the default value **3600** is used.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "MediaIds",
      "description": "The ID of the auxiliary media asset.\n\n*   Separate multiple IDs with commas (,). You can specify up to 20 IDs.\n*   You can obtain the ID from the response to the [CreateUploadAttachedMedia](~~CreateUploadAttachedMedia~~) operation that you call to obtain the upload URL and credential.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "OutputType",
      "description": "The type of the media asset URL. Valid values:\n\n*   **oss**\n*   **cdn** (default)",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}