{
  "name": "GetImageInfos",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AuthTimeout",
      "description": "The time when the image URL expires. Unit: seconds.\n\n*   If the OutputType parameter is set to cdn:\n\n    *   This parameter takes effect only if URL authentication is enabled. Otherwise, the image URL does not expire.\n    *   Minimum value: 1.\n    *   Maximum value: unlimited.\n    *   Default value: The default validity period that is specified in URL authentication is used.\n\n*   If the OutputType parameter is set to oss:\n\n    *   This parameter takes effect only when the ACL of the Object Storage Service (OSS) bucket is private. Otherwise, the image URL does not expire.\n    *   Minimum value: 1.\n    *   If you store the image in the VOD bucket, the maximum value of this parameter is **2592000** (30 days). If you store the image in an OSS bucket, the maximum value of this parameter is **129600** (36 hours). The maximum value is limited to reduce security risks of the origin.\n    *   Default value: 3600.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "ImageIds",
      "description": "The image IDs. Separate multiple IDs with commas (,). You can specify up to 20 image IDs. You can use one of the following methods to obtain the ID:\n\n*   Log on to the [ApsaraVideo VOD console](https://vod.console.aliyun.com/) and choose **Media Files > Images** in the left-side navigation pane.\n*   Obtain the value of ImageId from the response to the CreateUploadImage operation that you call to obtain the upload URL and credential.\n*   Obtain the value of ImageId from the response to the [SearchMedia](~~SearchMedia~~) operation after you upload images.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "OutputType",
      "description": "The type of the output image URL. Valid values:\n\n*   oss: OSS URL\n*   cdn: CDN URL",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}