{
  "name": "GetPlayInfo",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AdditionType",
      "description": "The URL of the masked live comment data. Set the value to **danmu**.\n\n> This parameter takes effect only when the outputType parameter is set to **cdn**.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "AuthTimeout",
      "description": "The validity period of the playback URL. Unit: seconds.\n\n*   If you set OutputType to **cdn**:\n\n    *   The playback URL has a validity period only if URL signing is enabled. Otherwise, the playback URL is permanently valid. For more information about how to enable and configure URL signing, see [URL signing](~~86090~~).\n    *   Minimum value: **1**.\n    *   Maximum value: unlimited.\n    *   Default value: The default validity period that is specified in URL signing is used.\n\n*   If you set OutputType to **oss**:\n\n    *   This parameter takes effect only when the ACL of the Object Storage Service (OSS) bucket is private. Otherwise, the playback URL does not expire.\n    *   Minimum value: **1**.\n    *   Maximum value: If the media file is stored in the VOD bucket, the maximum validity period is **2592000** (30 days). If the media file is stored in an OSS bucket, the maximum validity period is **129600** (36 hours). This limit is imposed to reduce security risks of the origin server. If you require a longer validity period, set OutputType to **cdn** and configure URL signing to specify a longer validity period.\n    *   Default value: **3600**.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "Definition",
      "description": "The quality of the video stream. Separate multiple qualities with commas (,). Valid values:\n\n*   **FD**: low definition\n*   **LD**: standard definition\n*   **SD**: high definition\n*   **HD**: ultra-high definition\n*   **OD**: original definition\n*   **2K**: 2K\n*   **4K**: 4K\n*   **SQ**: standard sound quality\n*   **HQ**: high sound quality\n*   **AUTO**: adaptive bitrate\n\n> By default, ApsaraVideo VOD returns video streams in all preceding qualities. However, video streams for adaptive bitrate streaming are returned only if the PackageSetting parameter is specified in the transcoding template. For more information, see the [PackageSetting parameter in the TranscodeTemplate](~~52839~~) table.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DigitalWatermarkType",
      "description": "The type of the digital watermark. Valid values:\n\n*   TraceMark: tracing watermark\n*   CopyrightMark: copyright watermark",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Formats",
      "description": "The format of the media stream. Separate multiple formats with commas (,). Valid values:\n\n*   **mp4**\n*   **m3u8**\n*   **mp3**\n*   **mpd**\n\n> By default, ApsaraVideo VOD returns video streams in all the preceding formats. However, video streams in the MPD format are returned only if the MPD container format is specified in the transcoding template. For more information, see the [Container parameter in the TranscodeTemplate](~~52839~~) table.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "OutputType",
      "description": "The type of the output URL. Default value: oss. Valid values:\n\n*   **oss**\n*   **cdn**",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "PlayConfig",
      "description": "The custom playback configuration. The value is a JSON string. For more information, see [PlayConfig](~~86952~~).\n\n>-   If you do not specify PlayConfig or `PlayDomain` in PlayConfig, the default domain name configured in ApsaraVideo VOD is used in this operation. If no default domain name is configured, the domain names are queried in reverse chronological order based on the time when the domain names were modified. The domain name that was last modified is used as the streaming domain name. To prevent domain name issues, we recommend that you specify the default streaming domain name. You can log on to the [ApsaraVideo VOD console](https://vod.console.aliyun.com) and choose **Configuration Management** > **Media Management** > **Storage** > **Manage** > **Origin Domain Name** to set the default streaming domain name.\n>-   If the `EncryptType` parameter in PlayConfig is set to `AliyunVoDEncryption`, the playback URL of the stream encrypted by using proprietary cryptography is not returned to ensure video security. If you want to return such URL, you must set the `ResultType` parameter to `Multiple`.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ReAuthInfo",
      "description": "The CDN reauthentication configuration. The value is a JSON string. If CDN reauthentication is enabled, you can use this parameter to specify the UID and rand fields for URL authentication. For more information, see [URL authentication](~~57007~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ResultType",
      "description": "The type of the data to return. Default value: Single. Valid values:\n\n*   **Single**: Only one latest transcoded stream is returned for each quality and format.\n*   **Multiple**: All transcoded streams are returned for each quality and format.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "StreamType",
      "description": "The type of the media stream. Separate multiple types with commas (,). Valid values:\n\n*   **video**\n*   **audio**\n\nBy default, video and audio streams are returned.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Trace",
      "description": "The custom digital watermark.\n\n*   If you set `DigitalWatermarkType` to `TraceMark`, specify this parameter to configure the video tracing watermark and return the video stream that contains the watermark. The value can be up to 1,024 characters in length and can contain letters and digits.\n*   If you set `DigitalWatermarkType` to `CopyrightMark`, specify the **watermark text** that you created for the watermark template for this parameter.`` You can specify this parameter to query and return the video stream that contains the specified watermark text.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "VideoId",
      "description": "The ID of the media file. You can specify only one ID. You can use one of the following methods to obtain the media ID:\n\n*   Log on to the [ApsaraVideo VOD](https://vod.console.aliyun.com) console. In the left-side navigation pane, choose **Media Files** > **Audio/Video**. On the Video and Audio page, you can view the ID of the audio or video file. This method is applicable to files that are uploaded by using the ApsaraVideo VOD console.\n*   Obtain the value of the VideoId parameter from the response to the [CreateUploadVideo](~~55407~~) operation.\n*   Obtain the value of the VideoId parameter from the response to the [SearchMedia](~~86044~~) operation. This method is applicable to files that have been uploaded.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}