{
  "name": "GetPlayInfo",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AdditionType",
      "description": "The URL of the masked live comment data. Value: **danmu**.\n\n>  This parameter takes effect only when the `outputType` parameter is set to `cdn`.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "AuthTimeout",
      "description": "The validity period of the playback URL. Unit: seconds.\n\n*   If you set OutputType to **cdn**:\n\n    *   The playback URL has a validity period only if URL signing is enabled. Otherwise, the playback URL is permanently valid. For more information about how to enable and configure URL signing, see [URL signing](~~86090~~).\n    *   Minimum value: **1**.\n    *   Maximum value: unlimited.\n    *   Default value: The default validity period that is specified in URL signing is used.\n\n*   If you set OutputType to **oss**:\n\n    *   This parameter takes effect only when the ACL of the Object Storage Service (OSS) bucket is private. Otherwise, the playback URL does not expire.\n    *   Minimum value: **1**.\n    *   Maximum value: If the media file is stored in the VOD bucket, the maximum validity period is **2592000** (30 days). If the media file is stored in an OSS bucket, the maximum validity period is **129600** (36 hours). This limit is imposed to reduce security risks of the origin server. If you require a longer validity period, set OutputType to **cdn** and configure URL signing to specify a longer validity period.\n    *   Default value: **3600**.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "Definition",
      "description": "The quality of the video stream. Separate multiple qualities with commas (,). Valid values:\n\n*   **FD**: low definition\n*   **LD**: standard definition\n*   **SD**: high definition\n*   **HD**: ultra-high definition\n*   **OD**: original definition\n*   **2K**\n*   **4K**\n*   **SQ**: standard sound quality\n*   **HQ**: high sound quality\n*   **AUTO**: adaptive bitrate\n\n> *   By default, ApsaraVideo VOD returns video streams in all the preceding qualities.\n> *   However, video streams for adaptive bitrate streaming are returned only if the PackageSetting parameter is specified in the transcoding template. For more information, see the [PackageSetting parameter in the TranscodeTemplate table](~~52839#title-4fk-cg8-gzx~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DigitalWatermarkType",
      "description": "The type of the digital watermark. Valid values:\n\n*   TraceMark: tracing watermark\n*   CopyrightMark: copyright watermark",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Formats",
      "description": "The format of the media stream. Separate multiple formats with commas (,). Valid values:\n\n*   **mp4**\n*   **m3u8**\n*   **mp3**\n*   **flv**\n*   **mpd**\n\n> *   By default, ApsaraVideo VOD returns video streams in all the preceding formats.\n>*   However, video streams in the MPD format are returned only if the `dash` container format is specified in the transcoding template. For more information, see the [Container parameter in the TranscodeTemplate table](~~52839#title-7rr-3hj-gy5~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "OutputType",
      "description": "The type of the output URL. Default value: oss. Valid values:\n\n*   **oss**\n*   **cdn**",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "PlayConfig",
      "description": "The custom playback configuration. The value must be a JSON string. You can specify a domain name for playback. For more information, see [PlayConfig](~~86952#section-9g7-s9b-v7z~~).\n\n> *   If you do not set the PlayConfig parameter or the `PlayDomain` parameter that is nested under the PlayConfig parameter, the default domain name specified in ApsaraVideo VOD is used in this operation. If no default domain name is specified, the domain names are queried in reverse chronological order based on the time when the domain names were last modified. To prevent domain name issues, we recommend that you perform the following steps to specify the default playback domain name: Log on to the [ApsaraVideo VOD console](https://vod.console.aliyun.com). In the left-side navigation pane, choose **Configuration Management** > **Media Management** > **Storage**. Find the domain name that you want to configure and click **Manage** in the Actions column. On the page that appears, set the default playback domain name in the **Origin Domain Name** section.\n> *   If you set the `EncryptType` parameter nested under the PlayConfig parameter to `AliyunVoDEncryption`, the playback URLs of videos encrypted by using Alibaba Cloud proprietary cryptography are not automatically returned to ensure video security. To return playback URLs of videos encrypted by using Alibaba Cloud proprietary cryptography, you must set the `ResultType` parameter to `Multiple`.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ReAuthInfo",
      "description": "The CDN reauthentication configuration. The value must be a JSON string. If CDN reauthentication is enabled, you can use this parameter to specify the `UID` and `rand` fields for URL authentication. For more information, see [URL authentication](~~2249352~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ReferenceId",
      "description": "",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ResultType",
      "description": "The type of the data to return. Default value: Single. Valid values:\n\n*   **Single**: Only one latest transcoded stream is returned for each quality and format.\n*   **Multiple**: All transcoded streams are returned for each quality and format.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "StreamType",
      "description": "The type of the media stream. Separate multiple types with commas (,). Valid values:\n\n*   **video**\n*   **audio**\n\nBy default, video and audio streams are returned.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Trace",
      "description": "The custom digital watermark.\n\n*   If you set `DigitalWatermarkType` to `TraceMark`, specify this parameter to configure the video tracing watermark and return the video stream that contains the watermark. The value can be up to 1,024 characters in length and can contain letters and digits.\n*   If you set `DigitalWatermarkType` to `CopyrightMark`, specify the **watermark text** that you created for the watermark template for this parameter.`` You can specify this parameter to query and return the video stream that contains the specified watermark text.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "VideoId",
      "description": "The ID of the media file. You can specify only one ID. You can use one of the following methods to obtain the ID:\n\n*   Log on to the [ApsaraVideo VOD console](https://vod.console.aliyun.com). In the left-side navigation pane, choose **Media Files** > **Audio/Video**. On the page that appears, view the media ID.\n*   Obtain the value of the VideoId parameter in the response to the [CreateUploadVideo](~~55407~~) operation that you called to upload the audio or video file.\n*   Obtain the value of VideoId by calling the [SearchMedia](~~86044~~) operation. This method is applicable to files that have been uploaded.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}