{
  "name": "RefreshMediaPlayUrls",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Definitions",
      "description": "Specifies the resolutions of the media streams you want to refresh or prefetch. You can specify multiple resolutions. Separate multiple resolutions with commas (,). If you leave this parameter empty, media streams in all resolutions are refreshed or prefetched by default.\n\n>  The value must be supported in the **Definition** section in [Parameters for media assets](~~124671~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Formats",
      "description": "The formats of the media streams you want to refresh or prefetch. You can specify multiple formats. Separate multiple formats with commas (,). If you leave this parameter empty, media streams in all formats are refreshed or prefetched by default. Valid values:\n\n*   **mp4**\n*   **m3u8**\n*   **mp3**\n*   **flv**\n*   **webm**\n*   **ts**",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "MediaIds",
      "description": "The IDs of the media files that you want to refresh or prefetch. You can specify a maximum of 20 IDs. Separate multiple IDs with commas (,). You can use one of the following methods to obtain the ID:\n\n*   Log on to the [ApsaraVideo VOD](https://vod.console.aliyun.com) console. In the left-side navigation pane, choose **Media Files** > **Audio/Video**. On the Video and Audio page, view the ID of the audio or video file. This method is applicable to files that are uploaded by using the ApsaraVideo VOD console.\n*   Obtain the value of VideoId from the response to the [CreateUploadVideo](~~55407~~) operation that you call to upload media files.\n*   Obtain the value of VideoId from the response to the [SearchMedia](~~86044~~) operation that you call to query the media ID after the media file is uploaded.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ResultType",
      "description": "Specifies the type of the refresh or prefetch operation. Default value: Single. Valid values:\n\n*   **Single**: Only one latest transcoded stream is refreshed or prefetched for each resolution and format.\n*   **Multiple**: All transcoded streams are refreshed or prefetched for each resolution and format.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SliceCount",
      "description": "Specifies the number of the playback URLs of the TS files for the M3U8 media stream you want to refresh or prefetch. After you set this parameter, only the playback URLs of the first N TS files will be refreshed or prefetched. Valid values: 1 to 20. Default value: 5.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "SliceFlag",
      "description": "Specifies whether to refresh or prefetch the playback URLs of the TS files of the M3U8 media stream. Default value: false. Valid values:\n\n*   **false**\n*   **true**",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "StreamType",
      "description": "Specifies the types of media streams you want to refresh or prefetch. You can specify multiple types. Separate multiple types with commas (,). If you leave this parameter empty, media streams in all types are refreshed or prefetched by default. Valid values:\n\n*   **video**\n*   **audio**",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TaskType",
      "description": "The type of the task that you want to create. Valid values:\n\n*   **Refresh**\n*   **Preload**",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "UserData",
      "description": "The custom configurations such as callback configurations and upload acceleration configurations. The value is a JSON string. For more information, see [Request parameter](~~86952~~).\n> \n- The callback configurations take effect only after you specify the HTTP callback URL and select specific callback events in the ApsaraVideo VOD console. For more information about how to configure HTTP callback settings in the ApsaraVideo VOD console, see [Configure callback settings](~~86071~~).\n- You must submit a ticket to enable the upload acceleration feature. For more information, see [Overview](~~55396~~).",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}