{
  "name": "RestoreMedia",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "MediaIds",
      "description": "The ID of the media asset (VideoId). Separate multiple IDs with commas (,). You can specify a maximum of 20 IDs. You can use one of the following methods to obtain the ID of the media asset:\n\n*   Log on to the ApsaraVideo VOD console. In the left-side navigation pane, choose Media Files > Audio/Video. On the Video and Audio page, view the ID of the media asset. This method is applicable to files that are uploaded by using the ApsaraVideo VOD console.\n*   Obtain the value of VideoId from the response to the CreateUploadVideo operation that you call to upload media assets.\n*   Obtain the value of VideoId from the response to the SearchMedia operation that you call to query the media ID after the media asset is uploaded.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "RestoreDays",
      "description": "The number of days during which media assets remain in the restored state. Default value: 1. The maximum validity period of a restored Archive media asset is 7 days and the maximum validity period of a restored Cold Archive media asset is 365 days.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RestoreTier",
      "description": "The restoration priority. This parameter is required only when you restore a Cold Archive media file. Valid values:\n\n*   **Expedited**: The file is restored within 1 hour.\n*   **Standard**: The file is restored within 2 to 5 hours.\n*   **Bulk**: The file is restored within 5 to 12 hours.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Scope",
      "description": "The modification range. Valid values:\n\n*   **All**: restores all resources, including the source files and transcoded streams.\n*   **SourceFile**: restores only the source files.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}