{
  "name": "SubmitTranscodeJobs",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "EncryptConfig",
      "description": "The encryption configurations. The value must be a JSON string. This parameter is required only when you use HLS encryption.\n\n> \n\n*   You must set **CipherText** in [EncrptConfig](~~86952~~) to the AES\\_128 cipher text that is obtained from the response to the [GenerateKMSDataKey](~~455051~~) operation. Otherwise, the HLS encryption fails. For more information about how to use HLS encryption, see [HLS encryption](~~68612~~).\n\n*   You must select HLS encryption for the template specified by **TemplateGroupId** no matter you use HLS encryption or Alibaba Cloud proprietary cryptography. Otherwise, the transcoded file is not encrypted.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "OverrideParams",
      "description": "The override parameter. The value must be a JSON string. You can use this parameter to override the image watermark, text watermark, or subtitle file specified in the transcoding template, or override the encoding format of the subtitle file. For more information about the data structure, see [OverrideParams](~~98618~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "PipelineId",
      "description": "The ID of the queue that you want to use to run the job.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Priority",
      "description": "The priority of the transcoding job in all queued jobs.\n\n*   Valid values: **1** to **10**.\n*   A value of **10** indicates the highest priority.\n*   Default value: **6**.\n\n>  This parameter takes effect only on the queued transcoding jobs. The priorities of the in-progress transcoding jobs are not affected.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ReferenceId",
      "description": "",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SessionId",
      "description": "The custom identifier for deduplication. If you send a request, an error is returned if a request with the same identifier was sent in the last 7 days. A custom identifier can be up to 50 characters in length and can contain letters, digits, hyphens (-), and underscores (\\_). If you do not specify this parameter or leave this parameter empty, duplicate requests are not filtered.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TemplateGroupId",
      "description": "The ID of the transcoding template group that you want to use. To view the template group ID, perform the following operations: Log on to the [ApsaraVideo VOD console](https://vod.console.aliyun.com). In the left-side navigation pane, choose **Configuration Management** > **Media Processing** > **Transcoding Template Groups**.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "UserData",
      "description": "The custom settings. The value must be a JSON string. You can configure settings such as message callbacks. For more information, see [UserData](~~86952~~).\n\n>  To use the callback configurations specified by this parameter, you must configure an HTTP callback URL and specify the types of the callback events in the ApsaraVideo VOD console. Otherwise, the callback configurations do not take effect.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "VideoId",
      "description": "The ID of the video file. You can use one of the following methods to obtain the video ID:\n\n*   Log on to the [ApsaraVideo VOD](https://vod.console.aliyun.com) console. In the left-side navigation pane, choose **Media Files** > **Audio/Video**. On the Video and Audio page, view the ID of the video file. This method is applicable to files that are uploaded by using the ApsaraVideo VOD console.\n*   Obtain the value of VideoId from the response to the [CreateUploadVideo](~~55407~~) operation that you call to upload the video.\n*   Obtain the value of VideoId from the response to the [SearchMedia](~~86044~~) operation after you upload the video.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}