{
  "name": "UploadStreamByURL",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Definition",
      "description": "The quality of the video stream.\n\nFor more information about valid values of this parameter, see [Parameters for media assets](~~124671~~).",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "FileExtension",
      "description": "The file name extension of the transcoded stream.\n\nFor more information, see the Supported media file formats section in [Overview](~~55396~~).\n\nIf you set a value for this parameter, the file name extension specified in StreamURL is overwritten.\n\n>  This parameter is required if you do not specify a file name extension in StreamURL.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "HDRType",
      "description": "The HDR type of the transcoded stream. Valid values:\n\n*   HDR\n*   HDR10\n*   HLG\n*   DolbyVision\n*   HDRVivid\n*   SDR+\n\n> \n\n*   The HDR type of the transcoded stream is not case-sensitive.\n\n*   You can leave this parameter empty for non-HDR streams.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "MediaId",
      "description": "The media ID in ApsaraVideo VOD.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "StreamURL",
      "description": "The URL of the transcoded stream.\n\nIf URL authentication is required, you must pass authentication information in this parameter and make sure that the URL can be accessed over the Internet.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "UploadMetadata",
      "description": "Metadata information for uploading media files, in JSON string format.\n\nFor more information, please refer to the table below for UploadMetadata.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "UserData",
      "description": "The user-defined parameter. For more information, see the \"UserData: specifies the custom configurations for media upload\" section of the [Request parameters](~~86952~~) topic.\n\n>  The callback configurations you specify for this parameter take effect only after you specify the HTTP callback URL and select specific callback events in the ApsaraVideo VOD console. For more information about how to configure HTTP callback settings in the ApsaraVideo VOD console, see [Configure callback settings](~~86071~~).",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}