{
  "name": "ModifyDtsJob",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request. You can use the client to generate the value, but you must ensure that it is unique among different requests. The **ClientToken** parameter can contain only ASCII characters and cannot exceed 64 characters in length.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DataInitialization",
      "description": "",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "DataSynchronization",
      "description": "",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "DbList",
      "description": "The objects of the data synchronization task after modification. The value is a JSON string. For more information, see [Objects of DTS tasks](~~209545~~).\n\n>  Before you call the ModifyDtsJob operation, we recommend that you call the [DescribeDtsJobDetail](~~208925~~) to query the current objects of the data synchronization task. Then, you can specify the new objects based on your business requirements. For example, if the current objects are Table A and Table B and you need to add Table C, you must specify Table A, Table B, and Table C for this parameter.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "DtsInstanceId",
      "description": "The ID of the data synchronization instance.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "DtsJobId",
      "description": "",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EtlOperatorColumnReference",
      "description": "The operator that is related to the extract, transform, and load (ETL) feature and dedicated to T+1 business.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "FileOssUrl",
      "description": "The endpoint of the Object Storage Service (OSS) bucket in which the files to be synchronized are stored.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "FilterTableName",
      "description": "The name of the table to be filtered.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "ModifyTypeEnum",
      "description": "The method that is used to modify the data synchronization task. If you do not specify the parameter, the objects of the data synchronization task are modified by default. If you specify UPDATE_RESERVED for the parameter, the reserved parameters are modified.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The ID of the region in which the data synchronization instance resides. For more information, see [List of supported regions](~~141033~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Reserved",
      "description": "The reserved parameters of the data synchronization task. You can add reserved parameters instead of overwriting the existing reserved parameters. The value of the parameter is a MAP JSON string. You can specify this parameter to meet special requirements, such as specifying whether to automatically start the precheck of the data synchronization task. For more information, see [MigrationReserved](~~176470~~).",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "StructureInitialization",
      "description": "",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "SynchronizationDirection",
      "description": "The synchronization direction. Valid values:\n\n*   **Forward**: Data is synchronized from the source database to the destination database.\n*   **Reverse**: Data is synchronized from the destination database to the source database.\n\n> \n*   Default value: **Forward**.\n*   This parameter is required only if the topology of the data synchronization instance is two-way synchronization.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}