{
  "name": "SetSecurityPreference",
  "protocol": "HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AllowUserToChangePassword",
      "description": "Specifies whether RAM users can change their passwords. Valid values:\n\n*   true: RAM users can change their passwords. This is the default value.\n*   false: RAM users cannot change their passwords.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "AllowUserToManageAccessKeys",
      "description": "Specifies whether RAM users can manage their AccessKey pairs. Valid values:\n\n*   true: RAM users can manage their AccessKey pairs.\n*   false: RAM users cannot manage their AccessKey pairs. This is the default value.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "AllowUserToManageMFADevices",
      "description": "Specifies whether RAM users can manage their MFA devices. Valid values:\n\n*   true: RAM users can manage their MFA devices. This is the default value.\n*   false: RAM users cannot manage their MFA devices.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "AllowUserToManagePublicKeys",
      "description": "Specifies whether RAM users can manage their public keys. Valid values:\n\n*   true: RAM users can manage their public keys.\n*   false: RAM users cannot manage their public keys. This is the default value.\n\n>  This parameter is valid only for the Japan site.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "EnableSaveMFATicket",
      "description": "Specifies whether to remember the multi-factor authentication (MFA) devices of Resource Access Management (RAM) users for seven days. Valid values:\n\n*   true: remembers the MFA devices of RAM users for seven days.\n*   false: does not remember the MFA devices of RAM users for seven days.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "LoginNetworkMasks",
      "description": "The subnet mask that specifies the IP addresses from which you can log on to the Alibaba Cloud Management Console. This parameter takes effect on password-based logon and single sign-on (SSO). However, this parameter does not take effect on API calls that are authenticated by using AccessKey pairs.\n\n*   If you specify a subnet mask, RAM users can use only the IP addresses in the subnet mask to log on to the Alibaba Cloud Management Console.\n*   If you do not specify a subnet mask, RAM users can use all IP addresses to log on to the Alibaba Cloud Management Console.\n\nIf you need to specify multiple subnet masks, separate the subnet masks with semicolons (;). Example: 192.168.0.0/16;10.0.0.0/8.\n\nYou can specify up to 25 subnet masks. The total length of the subnet masks can be a maximum of 512 characters.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "LoginSessionDuration",
      "description": "The validity period of the logon session of RAM users.\n\nValid values: 1 to 24. Default value: 6. Unit: hours.",
      "position": "Query",
      "type": "Integer",
      "required": false
    }
  ]
}