{
  "name": "CreateStorageAnalysisTask",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "DbName",
      "description": "The database name. If you specify a database, the operation analyzes the storage usage of the specified database.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "InstanceId",
      "description": "The instance ID.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "NodeId",
      "description": "The node ID. For ApsaraDB for MongoDB instances, you can use this parameter to specify a node for storage analysis. You can call the [DescribeRoleZoneInfo](~~123802~~) operation to query the information about nodes of an ApsaraDB for MongoDB instance.\n\n*   If you set this parameter to a value in the **InsName** format, such as `d-bp1872fa24d5****`, you can call this operation to analyze the hidden node that corresponds to the node ID.\n*   If you set this parameter to a value in the `InsName#RoleId` format, such as `d-bp1872fa24d5****#299****5`, you can call this operation to analyze the specified node.\n\n>  If you run a storage analysis task on an ApsaraDB for MongoDB replica set instance and you do not specify this parameter, only the hidden node of the instance is analyzed by default. If you run a storage analysis task on an ApsaraDB for MongoDB sharded cluster instance, we recommend that you set this parameter to specify a node.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TableName",
      "description": "The table name. If you specify a table in the specified database, the operation analyzes the storage usage of the specified table. If you specify a table, you must also specify the database to which the table belongs by using **DbName**.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}