{
  "name": "SetDomainServerCertificate",
  "deprecated": true,
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "CertName",
      "description": "The name of the SSL certificate. You can specify only one name.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "CertType",
      "description": "The type of the certificate. Valid values:\n\n*   **upload**: a user-uploaded SSL certificate.\n*   **cas**: a certificate that is purchased from Alibaba Cloud SSL Certificates Service.\n\n> If this parameter is set to **cas**, the **PrivateKey** parameter is optional.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DomainName",
      "description": "The accelerated domain name for which you want to configure the SSL certificate. The type of request supported by the domain name must be HTTPS.\n\nYou can specify one domain name in each call.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ForceSet",
      "description": "Specifies whether to check the certificate name for duplicates. If you set the value to 1, the system does not perform the check and overwrites the information about the existing certificate that uses the same name.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "PrivateKey",
      "description": "The private key. Specify the private key only if you want to enable the SSL certificate.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SecurityToken",
      "description": "",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ServerCertificate",
      "description": "The content of the SSL certificate. Specify the content of the SSL certificate only if you want to enable the SSL certificate. You can use one of the following methods to obtain the content of the SSL certificate:\n\n*   Method 1: Call the [DescribeDomainCertificateInfo](~~91182~~) API operation to query the information about the SSL certificate corresponding to the accelerated domain name and obtain the public key of the ServerCertificate certificate from the returned data.\n*   Method 2: Call the [DescribeCdnCertificateList](~~91181~~) API operation to query the SSL certificate list corresponding to the accelerated domain name, and obtain the value of CertName from the returned data. Then, Call the [DescribeCdnCertificateDetail](~~131905~~) API operation with CertName as a parameter to obtain the details about the certificate, and obtain the public key of the Cert certificate from the returned data.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ServerCertificateStatus",
      "description": "Specifies whether to enable the SSL certificate. Default value: off. Valid values:\n\n*   **on** : enables the SSL certificate.\n*   **off**: disables the SSL certificate.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}