{
  "name": "UpdateVpcEndpointZoneConnectionResourceAttribute",
  "deprecated": false,
  "protocol": "HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request.\n\nYou can use the client to generate the token, but you must make sure that the token is unique among different requests. The token can contain only ASCII characters.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DryRun",
      "description": "Specifies whether to perform only a dry run, without performing the actual request. Valid values:\n\n*   **true**: performs only a dry run. The system checks the request for potential issues, including missing parameter values, incorrect request syntax, and service limits. If the request fails the dry run, an error message is returned. If the request passes the dry run, the `DryRunOperation` error code is returned.\n*   **false** (default): performs a dry run and performs the actual request. If the request passes the dry run, a 2xx HTTP status code is returned and the operation is performed.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "EndpointId",
      "description": "The endpoint ID.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "RegionId",
      "description": "The region ID of the endpoint connection whose bandwidth you want to modify.\n\nYou can call the [DescribeRegions](~~120468~~) operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ResourceAllocateMode",
      "description": "The resource allocation mode. You can change the resource allocation mode only if the endpoint connection is in the **Disconnected** state. Valid values:\n\n*   **Auto**: automatically and randomly allocates the service resource. In this mode, the service resource is deleted.\n*   **Mannual**: manually allocates the service resource. If you set the value to Mannual, you must also specify the **ResourceId** and **ResourceType** parameters.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ResourceId",
      "description": "The ID of the service resource that you want to manually allocate or migrate in the zone where the endpoint connection is deployed.\n\n> If **ResourceAllocateMode** is set to **Mannual**, or **ResourceReplaceMode** is set, this parameter is required.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ResourceReplaceMode",
      "description": "The migration mode of the service resource. Valid values:\n\n*   **Graceful**: smoothly migrates the service resource in the zone.\n*   **Force**: forcefully migrates the service resource in the zone.\n\n> If you want to migrate the service resource, you need to set this parameter. This parameter is available only if the endpoint connection is in the **Connected** state. If you set this parameter, you must also specify the **ResourceId** and **ResourceType** parameters.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ResourceType",
      "description": "The type of the service resource. Valid values:\n\n*   **slb**: a CLB instance that supports PrivateLink. In addition, the CLB instance is deployed in a VPC.\n*   **alb**: an Application Load Balancer (ALB) instance that supports PrivateLink. In addition, the ALB instance is deployed in a VPC.\n\n> If **ResourceAllocateMode** is set to **Mannual**, or **ResourceReplaceMode** is set, this parameter is required.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ServiceId",
      "description": "The endpoint service ID.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ZoneId",
      "description": "The zone ID.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}