{
  "name": "CreateInstanceOpsTask",
  "deprecated": false,
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ContainerGroupId",
      "description": "The ID of the container group.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "OpsType",
      "description": "The type of the O&M task. Valid values:\n\n*   coredump\n*   tcpdump",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "OpsValue",
      "description": "The value of the O\\&M task. You can set this parameter based on the value of OpsType.\n\n*   If OpsType is set to coredump, the valid values of OpsValue are:\n\n    *   enable: enables coredump.\n    *   disable: disables coredump.\n\n*   If OpsType is set to tcpdump, the value of OpsValue is a JSON-formatted parameter string. Example: `{\"Enable\":true, \"IfDeviceName\":\"eth0\"}`. The value may contain the following parameters:\n\n    *   Enable: specifies whether to enable tcpdump. You must specify this parameter. Valid values: true and false.\n    *   Protocol: the network protocol. Valid values: tcp, udp, and icmpv4.\n    *   SourceIp: the source IP address.\n    *   SourceCidr: the source CIDR block. If you specify both an IP address and a CIDR block, the IP address is ignored if the CIDR block is valid.\n    *   SourcePort: the source port. Valid values: 1 to 65535.\n    *   DestIp: the destination IP address.\n    *   DestCidr: the destination CIDR block. If you specify both an IP address and a CIDR block, the IP address is ignored if the CIDR block is valid.\n    *   DestPort: the destination port. Valid values: 1 to 65535.\n    *   IfDeviceName: the destination network interface controller. Default value: eth0.\n    *   Snaplen: the length to be captured. Default value: 65535. Unit: bytes.\n    *   Duration: the captured period. Unit: seconds.\n    *   PacketNum: the number of packets to be captured.\n    *   FileSize: the size of the destination files on packets. Unit: bytes. Maximum value: 1073741824. 1073741824 bytes is equal to 1 GB.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "RegionId",
      "description": "The region ID of the O&M task.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}