{
  "name": "CreateImageCache",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AcrRegistryInfo",
      "description": "Information about the Container Registry Enterprise Edition instance. For more information, see [Pull images from a Container Registry Enterprise Edition instance without using secrets](~~194250~~).",
      "position": "Query",
      "type": "RepeatList",
      "required": false,
      "sub_parameters": [
        {
          "name": "ArnService",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "ArnUser",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "Domain",
          "position": "Query",
          "type": "RepeatList",
          "required": false
        },
        {
          "name": "InstanceId",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "InstanceName",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "RegionId",
          "position": "Query",
          "type": "String",
          "required": false
        }
      ]
    },
    {
      "name": "Annotations",
      "description": "Comments.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "AutoMatchImageCache",
      "description": "Specifies whether to enable reuse of image cache layers. If you enable this feature, and the image cache that you want to create and an existing image cache contain duplicate image layers, the system reuses the duplicate image layers to create the new image cache. This accelerates the creation of the image cache. Valid values:\n\n*   true: enables reuse of image cache layers.\n*   false: disables reuse of image cache layers.\n\nDefault value: false.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request. You can use the client to generate the value, but you must make sure that the value is unique among different requests. The token can only contain ASCII characters and cannot exceed 64 characters in length. For more information, see [How to ensure the idempotence of a request](~~25693~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EipInstanceId",
      "description": "The ID of the elastic IP address (EIP). If you want to pull images over the Internet, make sure that the elastic container instance can access the Internet. You can configure an EIP or a NAT gateway for the elastic container instance to access the Internet.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EliminationStrategy",
      "description": "The elimination policy of the image cache. This parameter is empty by default, which indicates that the image cache is always retained.\n\nYou can set this parameter to LRU, which indicates that the image cache can be automatically deleted. When the number of image caches reaches the quota, the system automatically deletes the image caches whose EliminationStrategy parameter is set to LRU and that are least commonly used.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Flash",
      "description": "Specifies whether to enable the instant image cache feature. The feature can accelerate the creation of image caches. Valid values:\n\n*   true\n*   false\n\nDefault value: false.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "FlashCopyCount",
      "description": "The number of temporary local snapshots. By default, the system creates one snapshot for each image cache. If an image cache is used to create multiple elastic container instances at a time, we recommend that you set this parameter to create multiple snapshots for the image cache. We recommend that you create one snapshot for creation of every 1,000 elastic container instances.\n\n>  If you set the Flash parameter to true, instant image cache is enabled. During the creation of the image cache, the system first creates a temporary local snapshot for you to instantly use the snapshot. After the temporary local snapshot is created, the system begins to create a regular snapshot. After the regular snapshot is created, the temporary local snapshot is automatically deleted.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "Image",
      "description": "Container image N that is used to create the image cache.",
      "position": "Query",
      "type": "RepeatList",
      "required": true
    },
    {
      "name": "ImageCacheName",
      "description": "The name of the image cache.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ImageCacheSize",
      "description": "The size of the image cache. Unit: GiB. Default value: 20.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "ImageRegistryCredential",
      "description": "The image repository.",
      "position": "Query",
      "type": "RepeatList",
      "required": false,
      "sub_parameters": [
        {
          "name": "Password",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "Server",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "UserName",
          "position": "Query",
          "type": "String",
          "required": false
        }
      ]
    },
    {
      "name": "InsecureRegistry",
      "description": "The address of the self-managed image repository.\n\nWhen you create an image cache by using an image in a self-managed image repository that uses a self-signed certificate, you must specify this parameter to skip the certificate authentication. This can prevent the image from failing to pull due to certificate authentication failures.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "OsType",
      "description": "The operating system of the image. Default value: Linux. Valid values:\n\n- Linux\n- Windows\n\n> Windows instances are in invitational preview. To use the operating system, submit a ticket.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "PlainHttpRegistry",
      "description": "The address of the self-managed image repository. When you create an image cache by using an image in a self-managed image repository that uses the HTTP protocol, you must specify this parameter. This way, Elastic Container Instance uses the HTTP protocol instead of the default HTTPS protocol to pull the image. This can prevent the image from failing to pull due to different protocols.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the image cache.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ResourceGroupId",
      "description": "The ID of the resource group.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RetentionDays",
      "description": "The retention period of the image cache. Unit: days. When the retention period ends, the image cache expires and is deleted. By default, image caches never expire.\n\n>  The image caches that fail to be created are only retained for one day.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "SecurityGroupId",
      "description": "The ID of the security group.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "StandardCopyCount",
      "description": "The number of regular snapshots. By default, the system creates one snapshot for each image cache. If an image cache is used to create multiple elastic container instances at a time, we recommend that you set this parameter to create multiple snapshots for the image cache. We recommend that you create one snapshot for creation of every 1,000 elastic container instances.\n\n>  If you set the Flash parameter to false, instant image cache is disabled. In this case, only regular snapshots are generated during the creation of the image cache.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "Tag",
      "description": "The tag of the image cache.",
      "position": "Query",
      "type": "RepeatList",
      "required": false,
      "sub_parameters": [
        {
          "name": "Key",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "Value",
          "position": "Query",
          "type": "String",
          "required": false
        }
      ]
    },
    {
      "name": "VSwitchId",
      "description": "The ID of the vSwitch. You can specify up to 10 vSwitch IDs. Separate multiple vSwitch IDs with commas (,). Example: `vsw-***,vsw-***`.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ZoneId",
      "description": "The zone ID of the image cache.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}