{
  "name": "DescribeContainerGroupPrice",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ComputeCategory",
      "description": "算力类别。取值为economy时，表示查询经济型规格的价格。",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Cpu",
      "description": "The number of vCPUs. For information about the vCPU and memory specifications that are supported by Elastic Container Instance, see [vCPU and memory specifications](~~114662~~).",
      "position": "Query",
      "type": "Float",
      "required": false
    },
    {
      "name": "EphemeralStorage",
      "description": "The storage size of the temporary storage space. Unit: GiB.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "InstanceType",
      "description": "The instance type of the Elastic Compute Service (ECS) instance that is used to create the elastic container instance. For information about the ECS instance types that are supported by Elastic Container Instance, see [ECS instance types that are supported by Elastic Container Instance](~~114664~~).\n\n> If you specify this parameter, the specified specifications of vCPUs and memory are ignored. Only the price of the ECS instance type is returned.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Memory",
      "description": "The size of the memory. Unit: GiB. For information about the vCPU and memory specifications that are supported by Elastic Container Instance, see [vCPU and memory specifications](~~114662~~).",
      "position": "Query",
      "type": "Float",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the instance. You can call the [DescribeRegions](~~146965~~) operation to query the most recent region and zone list.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "SpotDuration",
      "description": "The protection period of the preemptible instance. Unit: hours. Default value: 1. The value of 0 indicates no protection period.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "SpotPriceLimit",
      "description": "The maximum hourly price of the preemptible elastic container instance. The value can contain up to three decimal places. If you set SpotStrategy to SpotWithPriceLimit, you must specify SpotPriceLimit.",
      "position": "Query",
      "type": "Float",
      "required": false
    },
    {
      "name": "SpotStrategy",
      "description": "The bidding policy for the elastic container instance. Valid values:\n\n*   NoSpot: The instance is a regular pay-as-you-go instance.\n*   SpotWithPriceLimit: The instance is a preemptible instance with a user-defined maximum hourly price.\n*   SpotAsPriceGo: The instance is a preemptible instance for which the market price at the time of purchase is automatically used as the bid price.\n\nDefault value: NoSpot.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ZoneId",
      "description": "The zone ID of the instance. You can call the [DescribeRegions](~~146965~~) operation to query the most recent region and zone list.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}