{
  "version": "2022-10-19",
  "style": "restful",
  "apis": {
    "ChangeResourceGroup": {
      "title": "ChangeResourceGroup",
      "summary": "This interface is used to modify the resource group of a Serverless StarRocks instance.",
      "deprecated": false
    },
    "CreateInstanceV1": {
      "title": "CreateInstanceV1",
      "summary": "",
      "deprecated": false
    },
    "CreateServiceLinkedRole": {
      "title": "CreateServiceLinkedRole",
      "summary": "This interface is used to create the AliyunServiceRoleForEMRStarRocks role for users.",
      "deprecated": false
    },
    "DescribeInstances": {
      "title": "DescribeInstances",
      "summary": "This operation is used to query Serverless StarRocks instances, supporting filtering based on instance name or tags and other information.",
      "deprecated": false
    },
    "DescribeNodeGroups": {
      "title": null,
      "summary": null,
      "deprecated": false
    },
    "ModifyCu": {
      "title": "ModifyCu",
      "summary": "Modifies the number of CUs for a warehouse of an E-MapReduce (EMR) Serverless StarRocks instance.",
      "deprecated": false
    },
    "ModifyCuPreCheck": {
      "title": "ModifyCuPreCheck",
      "summary": "Performs a precheck before you modify the number of CUs for a warehouse.",
      "deprecated": false
    },
    "ModifyDiskNumber": {
      "title": "ModifyDiskNumber",
      "summary": "Increases the number of disks for a warehouse of an E-MapReduce (EMR) Serverless StarRocks instance.",
      "deprecated": false
    },
    "ModifyDiskPerformanceLevel": {
      "title": "ModifyDiskPerformanceLevel",
      "summary": "Modifies the disk performance level for a warehouse of an E-MapReduce (EMR) Serverless StarRocks instance.",
      "deprecated": false
    },
    "ModifyDiskSize": {
      "title": "ModifyDiskSize",
      "summary": "Expands the disk size for a warehouse of an E-MapReduce (EMR) Serverless StarRocks instance.",
      "deprecated": false
    },
    "ModifyNodeNumber": {
      "title": "ModifyNodeNumber",
      "summary": "Modifies the number of nodes in a warehouse of an E-MapReduce (EMR) Serverless StarRocks instance.",
      "deprecated": false
    },
    "ModifyNodeNumberPreCheck": {
      "title": "ModifyNodeNumberPreCheck",
      "summary": "Performs a precheck before you modify the number of nodes in a warehouse of an E-MapReduce (EMR) Serverless StarRocks instance.",
      "deprecated": false
    },
    "QueryUpgradableVersions": {
      "title": "QueryUpgradableVersions",
      "summary": "Queries the versions of an E-MapReduce (EMR) Serverless StarRocks instance that the versions that you can upgrade to. The versions of a StarRocks instance include the major version and minor version. You can view the major version and minor version of a StarRocks instance in the Version Information section of the Instance Details tab in the EMR console. You can call this operation to query the minor versions or major versions that the versions that you can upgrade to.",
      "deprecated": false
    },
    "ReleaseInstance": {
      "title": "ReleaseInstance",
      "summary": "Releases a pay-as-you-go E-MapReduce (EMR) Serverless StarRocks instance. To unsubscribe from a subscription instance, go to the Unsubscribe page of the Expenses and Costs console.",
      "deprecated": false
    },
    "RestartInstance": {
      "title": "RestartInstance",
      "summary": "Restarts an E-MapReduce (EMR) Serverless StarRocks instance.",
      "deprecated": false
    },
    "TagResources": {
      "title": "TagResources",
      "summary": "Adds a tag to a resource.",
      "deprecated": false
    },
    "UnTagResources": {
      "title": "UnTagResources",
      "summary": "Removes tags from specified resources.",
      "deprecated": false
    },
    "UpdateInstanceName": {
      "title": "UpdateInstanceName",
      "summary": "Modifies the name of an E-MapReduce (EMR) Serverless StarRocks instance.",
      "deprecated": false
    },
    "UpgradeVersion": {
      "title": "UpgradeVersion",
      "summary": "Upgrades the version of an E-MapReduce (EMR) Serverless StarRocks instance. The versions of a StarRocks instance include the major version and minor version. You can view the major version and minor version of a StarRocks instance in the Version Information section of the Instance Details tab in the EMR console. This operation can be used to upgrade the minor version or major version of a StarRocks instance. You can call the QueryUpgradableVersions operation to query the versions that you can upgrade to.",
      "deprecated": false
    }
  }
}