{
  "name": "DescribeDiskReplicaGroups",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "GroupIds",
      "description": "The IDs of the replication pair-consistent groups. You can specify the IDs of one or more replication pair-consistent groups. Separate the IDs with commas (,).\n\nThis parameter is empty by default, which indicates that all replication pair-consistent groups in the specified region are queried. You can specify up to the IDs of 100 replication pair-consistent groups.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "MaxResults",
      "description": "The maximum number of entries per page. You can use this parameter together with NextToken.\n\nValid values: 1 to 500.\n\nDefault value: 10.",
      "position": "Query",
      "type": "Long",
      "required": false
    },
    {
      "name": "Name",
      "description": "The name of the replication pair-consistent group. You can perform a fuzzy search.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "NextToken",
      "description": "The pagination token that is used in the next request to retrieve a new page of results. You do not need to specify this parameter for the first request. You must specify the token that is obtained from the previous query as the value of NextToken. If you specify NextToken, the PageSize and PageNumber request parameters do not take effect, and the TotalCount response parameter is invalid.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "PageNumber",
      "description": "The number of the page to return.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "PageSize",
      "description": "The number of entries to return on each page. Valid values: 1 to 100.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The ID of the region to which the replication pair-consistent group belongs.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ResourceGroupId",
      "description": "The ID of the resource group to which the replication pair-consistent group belongs.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Site",
      "description": "The type of the site from which the information of replication pair-consistent groups is retrieved. This parameter is used for scenarios where data is replicated across zones in replication pairs.\n\n*   If this parameter is not specified, information such as the status of replication pair-consistent groups at the primary site is queried and returned.\n\n*   Otherwise, information such as the state of replication pairs at the site specified by the Site parameter is queried and returned. Valid values:\n\n    *   production: primary site\n    *   backup: secondary site",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Tag",
      "description": "The tags to add to the replication pair-consistent group. You can specify up to 20 tags.",
      "position": "Query",
      "type": "RepeatList",
      "required": false,
      "sub_parameters": [
        {
          "name": "Key",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "Value",
          "position": "Query",
          "type": "String",
          "required": false
        }
      ]
    }
  ]
}