{
  "name": "DescribeLensMonitorDisks",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "DiskCategory",
      "description": "The type of the disk. Valid values:\n- cloud\n- cloud_efficiency\n- cloud_ssd\n- cloud_essd\n- cloud_auto\n- cloud_essd_entry",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DiskIdPattern",
      "description": "Regular matching fuzzy query to filter cloud disk IDs.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DiskIds",
      "description": "The list of disks.",
      "position": "Query",
      "type": "RepeatList",
      "required": false
    },
    {
      "name": "LensTags",
      "description": "Event tags of the disk, which are used to filter the disks on which the events associated with the specified tags occurred in the previous 24 hours. Valid values:\n\n*   NoSnapshot: specifies the event that is triggered because no snapshot is created for the disk to protect data on the disk.\n*   BurstIOTriggered: specifies the event that is triggered when a burst I/O operation is performed on the disk.\n*   CostOptimizationNeeded: specifies the event that is triggered when cost optimization is required.\n*   DiskSpecNotMatchedWithInstance: specifies the event that is triggered if the disk specifications do not match the instance to which the disk is attached.\n*   DiskIONo4kAligned: specifies the event that is triggered if the physical and logical sectors involved in a read or write operation are not 4K aligned.\n*   DiskIOHang: specifies the event that is triggered when an I/O hang occurs on the disk.\n*   InstanceIOPSExceedInstanceMaxLimit: specifies the event that is triggered when the number of IOPS on the instance reaches the upper limit.\n*   InstanceBPSExceedInstanceMaxLimit: specifies the event that is triggered when the number of BPS on the instance reaches the upper limit.\n*   DiskIOPSExceedInstanceMaxLimit: specifies the event that is triggered when the number of IOPS on the disk reaches the upper limit of the instance.\n*   DiskBPSExceedInstanceMaxLimit: specifies the event that is triggered when the number of BPS on the disk reaches the upper limit of the instance.\n*   DiskIOPSExceedDiskMaxLimit: specifies the event that is triggered when the number of IOPS on the disk reaches the upper limit of the disk.\n*   DiskBPSExceedDiskMaxLimit: specifies the event that is triggered when the number of BPS on the disk reaches the upper limit of the disk.",
      "position": "Query",
      "type": "RepeatList",
      "required": false
    },
    {
      "name": "MaxResults",
      "description": "The number of entries to return on each page. Valid values: 1 to 100. Default value: 10.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "NextToken",
      "description": "The token used to start the next query to retrieve more results.\n\n>The pagination token that is used in the next request to retrieve a new page of results. You must specify the token that is obtained from the previous query as the value of NextToken.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}