{
  "name": "AttachInstances",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ClientToken",
      "description": "",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Entrusted",
      "description": "Specifies whether the scaling group manages the lifecycle of instances that are manually added to the scaling group. Valid values:\n\n*   true: The scaling group manages the lifecycle of instances that are manually added in a similar manner in which the scaling group manages the lifecycle of automatically created instances. When the instances are removed from the scaling group, the instances are automatically released. However, if you call the DetachInstances operation to remove the instances from the scaling group, the instances are not released.\n*   false: The scaling group does not manage the lifecycle of instances that are manually added. After the instances are removed from the scaling group, the instances are not released.\n\n>  This parameter is unavailable for subscription instances.\n\nDefault value: false.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "InstanceId",
      "description": "The ID of instance N that you want to add. Valid values of N: 1 to 20.\n\nExamples:\n\n*   The ID of the ECS instance that you want to add is `i-28wt4****`.\n*   The ID of the elastic container instance that you want to add is `eci-bp17gw49eu09yiwm****`.",
      "position": "Query",
      "type": "RepeatList",
      "required": false
    },
    {
      "name": "LifecycleHook",
      "description": "Specifies whether to trigger a lifecycle hook for the scaling group to which instances are being added. Valid values:\n\n*   true\n*   false\n\nDefault value: false.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "LoadBalancerWeight",
      "description": "The weight of instance N as a backend server of the Server Load Balancer (SLB) instance that is associated with the scaling group to which you want to add instance N. Valid values of N: 1 to 20. Valid values of this parameter: 1 to 100.\n\nDefault value: 50.",
      "position": "Query",
      "type": "RepeatList",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The ID of the region where the scaling group resides.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ScalingGroupId",
      "description": "The ID of the scaling group.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}