{
  "name": "CompleteLifecycleAction",
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request. You can use the client to generate the token, but you must make sure that the token is unique among different requests.\n\nThe token can contain only ASCII characters and cannot exceed 64 characters in length. For more information, see [How to ensure idempotence](~~25965~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "LifecycleActionResult",
      "description": "The action that you want Auto Scaling to perform after the lifecycle hook times out. Valid values:\n\n*   CONTINUE: Auto Scaling continues to respond to a scale-in or scale-out request.\n*   ABANDON: Auto Scaling releases Elastic Compute Service (ECS) instances that are created during scale-out activities or removes ECS instances from the scaling group during scale-in activities.\n*   ROLLBACK: For scale-in activities, Auto Scaling rejects the requests to release ECS instances but rolls back ECS instances. For scale-out activities, the ROLLBACK setting has the same effect as the ABANDON setting.\n\nIf you do not specify this parameter, Auto Scaling performs the action that is specified by the `DefaultResult` parameter after the lifecycle hook times out.\n\nIf multiple lifecycle hooks exist in a scaling group and the lifecycle hooks are triggered at the same time, the following rules apply:\n\n*   For scale-in activities, when lifecycle hooks whose LifecycleActionResult parameter is set to `ABANDON` or `ROLLBACK` time out, other lifecycle hooks time out ahead of schedule.\n*   For scale-in and scale-out activities, if you set the LifecycleActionResult parameter for all lifecycle hooks to `CONTINUE`, Auto Scaling performs the subsequent action only after the last lifecycle hook times out. The action that is performed by Auto Scaling varies based on the value that you specified for the LifecycleActionResult parameter of the last lifecycle hook that times out.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "LifecycleActionToken",
      "description": "The token of the lifecycle hook. You can obtain the token by using a Message Service (MNS) queue or an MNS topic that is specified for the lifecycle hook.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "LifecycleHookId",
      "description": "The ID of the lifecycle hook.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "RegionId",
      "description": "The region ID of the scaling group.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}