{
  "name": "CreateAlarm",
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AlarmAction",
      "description": "The list of unique identifiers of the scaling rules that are associated with the event-triggered task.",
      "position": "Query",
      "type": "RepeatList",
      "required": false
    },
    {
      "name": "ComparisonOperator",
      "description": "The operator that is used to compare the metric value and the metric threshold. Valid values:\n\n*   If the metric value is greater than or equal to the metric threshold, set the value to `>=`.\n*   If the metric value is less than or equal to the metric threshold, set the value to `<=`.\n*   If the metric value is greater than the metric threshold, set the value to `>`.\n*   If the metric value is less than the metric threshold, set the value to `<`.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Description",
      "description": "The description of the event-triggered task.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Dimension",
      "description": "The quota dimension.",
      "position": "Query",
      "type": "RepeatList",
      "required": false,
      "sub_parameters": [
        {
          "name": "DimensionKey",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "DimensionValue",
          "position": "Query",
          "type": "String",
          "required": false
        }
      ]
    },
    {
      "name": "Effective",
      "description": "The effective period of the event-triggered task.\n\nThe Effective value follows the cron expression format. The default format is `X X X X X ?`. In the format:\n\n*   X: a placeholder for a field, which represents seconds, minutes, hours, days, and months in sequence. X can be a definite value or a special character that has logical meaning. For information about the valid values of X, see [Cron expression](~~25907~~).\n*   ?: No value is specified.\n\n> By default, the value of this parameter is specified in **UTC+8**. You can specify the time zone in the `TZ=+yy` format before a cron expression. y indicates the time zone. For example, `TZ=+00 * * 1-2 * * ?` specifies that the event-triggered task is in effect between 01:00 and 02:59 (UTC+0) every day.\n\nExamples:\n\n*   ` * * * * * ?  `: The event-triggered task is in effect at all times.\n*   ` * * 17-18 * * ?  `: The event-triggered task is in effect between 17:00:00 and 18:59:00 (UTC+8) every day.\n*   `TZ=+00 * * 1-2 * * ?`: The event-triggered task is in effect between 01:00:00 and 02:59:00 (UTC+0) every day.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EvaluationCount",
      "description": "The number of times that the threshold must be reached before a scaling rule can be executed. For example, if you set this parameter to 3, the average CPU utilization must reach or exceed 80% three times in a row before a scaling rule is triggered.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "Expression",
      "description": "The expressions that are specified in the multi-metric alert rule.",
      "position": "Query",
      "type": "RepeatList",
      "required": false,
      "sub_parameters": [
        {
          "name": "ComparisonOperator",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "MetricName",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "Period",
          "position": "Query",
          "type": "Integer",
          "required": false
        },
        {
          "name": "Statistics",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "Threshold",
          "position": "Query",
          "type": "Float",
          "required": false
        }
      ]
    },
    {
      "name": "ExpressionsLogicOperator",
      "description": "The relationship between the trigger conditions in the multi-metric alert rule. Valid values:\n\n*   `&&`: An alert is triggered only if all metrics in the multi-metric alert rule meet the trigger conditions. In this case, an alert is triggered only if the results of all trigger conditions that are specified in the multi-metric alert rule are `true`.\n*   \\`\\`: An alert is triggered as long as one of the metrics in the multi-metric alert rule meets the trigger condition.\n\nDefault value: `&&`",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "GroupId",
      "description": "The ID of the application group to which the custom metric belongs. This parameter must be specified when MetricType is set to custom.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "MetricName",
      "description": "The name of the metric. Valid values of MetricName vary based on the value of MetricType.\n\n*   If you set MetricType to custom, the valid values of MetricName are your custom metrics.\n\n*   If you set MetricType to system, MetricName has the following valid values:\n\n    *   CpuUtilization: (ECS) the CPU utilization. Unit: %.\n    *   IntranetTx: the outbound traffic over the internal network from an ECS instance. Unit: KB/min.\n    *   IntranetRx: the inbound traffic over the internal network to an ECS instance. Unit: KB/min.\n    *   VpcInternetTx: the outbound traffic over the Internet from an ECS instance that resides in a virtual private cloud (VPC). Unit: KB/min.\n    *   VpcInternetRx: the inbound traffic over the Internet to an ECS instance that resides in a VPC. Unit: KB/min.\n    *   SystemDiskReadBps: the number of bytes read from the system disk that is used by an ECS instance per second.\n    *   SystemDiskWriteBps: the number of bytes written to the system disk that is used by an ECS instance per second.\n    *   SystemDiskReadOps: the number of read operations on the system disk that is used by an ECS instance per second.\n    *   SystemDiskWriteOps: the number of write operations on the system disk that is used by an ECS instance per second.\n    *   CpuUtilizationAgent: the CPU utilization of an agent. Unit: %.\n    *   GpuMemoryFreeUtilizationAgent: the percentage of idle GPU memory of an agent.\n    *   GpuMemoryUtilizationAgent: the GPU memory usage of an agent. Unit: %.\n    *   MemoryUtilization: the memory usage of an agent. Unit: %.\n    *   LoadAverage: the average system load of an agent.\n    *   TcpConnection: the total number of TCP connections of an agent.\n    *   TcpConnection: the number of established TCP connections of an agent.\n    *   PackagesNetOut: the number of packets that are sent by the internal network interface controller (NIC) used by an agent.\n    *   PackagesNetIn: the number of packets that are received by the internal NIC used by an agent.\n    *   EciPodCpuUtilization: the CPU utilization of an elastic container instance. Unit: %.\n    *   EciPodMemoryUtilization: the memory usage of an elastic container instance. Unit: %.\n\nFor more information, see [Event-triggered task for system monitoring](~~74854~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "MetricType",
      "description": "The type of the metric. Valid values:\n\n*   system: system metrics of CloudMonitor\n*   custom: custom metrics that are reported to CloudMonitor",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Name",
      "description": "The name of the event-triggered task.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Period",
      "description": "The period of time during which statistics about the metric is collected. Unit: seconds. Valid values:\n\n*   15\n*   60\n*   120\n*   300\n*   900\n\n> If your scaling group is of the ECS type and uses CloudMonitor metrics, you can set Period to 15. In other cases, you can set Period to 60, 120, 300, or 900. In most cases, the name of a CloudMonitor metric contains Agent.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the scaling group.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ScalingGroupId",
      "description": "The ID of the scaling group.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "Statistics",
      "description": "The method that is used to aggregate statistics for the metric. Valid values:\n\n*   Average\n*   Minimum\n*   Maximum",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Threshold",
      "description": "The threshold of a metric in the multi-metric alert rule. If the threshold is reached the specified number of times within the specified period, a scaling rule is executed.",
      "position": "Query",
      "type": "Float",
      "required": false
    }
  ]
}