{
  "name": "DescribeScalingInstances",
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "CreationType",
      "description": "Specifies how the ECS instance is created. Valid values:\n\n*   AutoCreated: The ECS instance is automatically created by Auto Scaling based on the instance configuration source of the scaling group.\n*   Attached: The ECS instance is manually added to the scaling group.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "CreationTypes",
      "description": "",
      "position": "Query",
      "type": "RepeatList",
      "required": false
    },
    {
      "name": "HealthStatus",
      "description": "The health status of the ECS instance in the scaling group. If ECS instances do not run as expected, Auto Scaling considers the ECS instances unhealthy. Valid values:\n\n*   Healthy\n*   Unhealthy\n\nAuto Scaling automatically removes unhealthy ECS instances from the scaling group and then releases automatically created instances among the unhealthy instances.\n\nUnhealthy ECS instances that are manually added to the scaling group are released based on the management mode of the instance lifecycles. If the lifecycles of the ECS instances are not managed by the scaling group, Auto Scaling removes the instances from the scaling group but does not release the instances. If the lifecycles of the ECS instances are managed by the scaling group, Auto Scaling removes the instances from the scaling group and releases the instances.\n\n>  Make sure that you have sufficient balance within your Alibaba Cloud account. If you have overdue payments within your Alibaba Cloud account, pay-as-you-go and preemptible instances are stopped or released. For information about how the states of ECS instances with overdue payments change, see [Overdue payments](~~170589~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "InstanceId",
      "description": "The ID of the instance.",
      "position": "Query",
      "type": "RepeatList",
      "required": false
    },
    {
      "name": "LifecycleState",
      "description": "The lifecycle state of the ECS instance in the scaling group. Valid values:\n\n*   InService: The ECS instance is added to the scaling group and provides services as expected.\n*   Pending: The ECS instance is being added to the scaling group. During this process, Auto Scaling adds the ECS instance to the backend server groups of the associated Classic Load Balancer (CLB) instance and adds the private IP address of the ECS instance to the IP address whitelist of the associated ApsaraDB RDS instance.\n*   Pending:Wait: The ECS instance is waiting to be added to the scaling group. If a lifecycle hook that applies to scale-out activities is created for the scaling group, the ECS instance enters the Pending:Wait state. The ECS instance is added to the scaling group only after the lifecycle hook times out.\n*   Protected: The ECS instance is being protected. The ECS instance can provide services as expected. However, Auto Scaling does not manage the lifecycle of the ECS instance. You must manually manage the lifecycle of the ECS instance.\n*   Standby: The ECS instance is on standby. The ECS instance is out of service and the weight of the ECS instance as a backend server is set to zero. Auto Scaling does not manage the lifecycle of the ECS instance. You must manually manage the lifecycle of the ECS instance.\n*   Stopped: The ECS instance is stopped. The ECS instance is stopped and cannot provide services.\n*   Removing: The ECS instance is being removed from the scaling group. During this process, Auto Scaling removes the ECS instance from the backend server groups of the associated CLB instance and removes the IP address of the ECS instance from the IP address whitelist of the associated ApsaraDB RDS instance.\n*   Removing:Wait: The ECS instance is waiting to be removed from the scaling group. If a lifecycle hook that applies to scale-in activities is created for the scaling group, the ECS instance enters the Removing:Wait state. The ECS instance is removed from the scaling group only after the lifecycle hook times out.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "LifecycleStates",
      "description": "",
      "position": "Query",
      "type": "RepeatList",
      "required": false
    },
    {
      "name": "PageNumber",
      "description": "The number of the page to return. Pages start from page 1.\n\nDefault value: 1.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "PageSize",
      "description": "The number of entries to return on each page. Maximum value: 100.\n\nDefault value: 10.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the scaling group.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ScalingActivityId",
      "description": "The ID of the scaling activity.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ScalingConfigurationId",
      "description": "The ID of the associated scaling configuration.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ScalingGroupId",
      "description": "The ID of the scaling group.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}