{
  "name": "DetachInstances",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ClientToken",
      "description": "",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DecreaseDesiredCapacity",
      "description": "Specifies whether to adjust the expected number of instances in the scaling group. Valid values:\n\n*   true: After a specific number of instances are removed from the scaling group, the expected number of instances in the scaling group decreases.\n*   false: After a specific number of instances are removed from the scaling group, the expected number of instances in the scaling group remains unchanged.\n\nDefault value: true.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "DetachOption",
      "description": "Specifies whether to remove the instances from the default server groups and vServer groups of the Server Load Balancer (SLB) instance that is associated with the scaling group, and whether to remove the IP addresses of the instances from the whitelist that manages access to the ApsaraDB RDS instance that is associated with the scaling group.\n\nIf you set this parameter to both, the instances are removed from the default sever groups and vServer groups of the associated SLB instance, and the IP addresses of the instances are removed from the whitelist that manages access to the associated ApsaraDB RDS instance.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "InstanceId",
      "description": "The ID of ECS instance N or elastic container instance N that you want to remove from the scaling group. Valid values of N: 1 to 20.\n\nExamples:\n\n*   The ID of the ECS instance that you want to remove is `i-bp109k5j3dum1ce6****`.\n*   The ID of the elastic container instance that you want to remove is `eci-bp17gw49eu09yiwm****`.",
      "position": "Query",
      "type": "RepeatList",
      "required": true
    },
    {
      "name": "LifecycleHook",
      "description": "Specifies whether to trigger the lifecycle hook for the scaling group when you remove instances from the scaling group. Valid values:\n\n*   true\n*   false\n\nDefault value: false.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "ScalingGroupId",
      "description": "The ID of the scaling group.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}