{
  "name": "ModifyScheduledTask",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Description",
      "description": "The description of the scheduled task. The description must be 2 to 200 characters in length.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DesiredCapacity",
      "description": "The expected number of instances in the scaling group if you specify the ScalingGroupId parameter.\n\n>  You must specify the `DesiredCapacity` parameter when you create the scaling group.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "LaunchExpirationTime",
      "description": "The time period during which the failed scheduled task can be retried. Unit: seconds. Valid values: 0 to 1800.\n\nDefault value: 600.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "LaunchTime",
      "description": "The point in time at which the scheduled task was triggered. Specify the time in the ISO 8601 standard in the YYYY-MM-DDThh:mmZ format. The time must be in UTC. You cannot enter a time point later than 90 days from the scheduled task modification.\n\n*   If you specify the `RecurrenceType` parameter, the task is repeatedly executed at the time point that is specified by the LaunchTime parameter.\n*   If you do not specify the `RecurrenceType` parameter, the task is executed only once at the time point that is specified by the LaunchTime parameter.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "MaxValue",
      "description": "The maximum number of instances in the scaling group if you specify the ScalingGroupId parameter.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "MinValue",
      "description": "The minimum number of instances in the scaling group if you specify the ScalingGroupId parameter.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "RecurrenceEndTime",
      "description": "The end time of the scheduled task. Specify the time in the ISO 8601 standard in the YYYY-MM-DDThh:mmZ format. The time must be in UTC. You cannot enter a time point later than 365 days from the scheduled task modification.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RecurrenceType",
      "description": "The interval at which the scheduled task is repeatedly executed. Valid values:\n\n*   Daily: The scheduled task is executed once every specified number of days.\n*   Weekly: The scheduled task is executed on each specified day of a week.\n*   Monthly: The scheduled task is executed on each specified day of a month.\n*   Cron: The scheduled task is executed based on the specified cron expression.\n\nAfter you modify the scheduled task, the values that you specify for the `RecurrenceType` and `RecurrenceValue` parameters must be valid at the same time.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RecurrenceValue",
      "description": "The number of recurrences of the scheduled task.\n\n*   If you set the `RecurrenceType` parameter to `Daily`, you can specify only one value. Valid values: 1 to 31.\n*   If you set the `RecurrenceType` parameter to `Weekly`, you can specify multiple values. Separate them with commas (,). For example, the values that correspond to Sunday, Monday, Tuesday, Wednesday, Thursday, Friday, and Saturday are 0, 1, 2, 3, 4, 5, and 6.``\n*   If you set the `RecurrenceType` parameter to `Monthly`, you can specify two values in the `A-B` format. Valid values of A and B: 1 to 31. B must be greater than or equal to A.\n*   If you set `RecurrenceType` to `Cron`, you can specify a cron expression. A cron expression is written in UTC time and consists of the following fields: minute, hour, day, month, and week. The expression can contain wildcard characters, including commas (,), question marks (?), hyphens (-), asterisks (\\*), number signs (#), forward slashes (/), and the letters L and W.\n\nAfter you modify the scheduled task, the values that you specify for the `RecurrenceType` and `RecurrenceValue` parameters must be valid at the same time.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the scaling group.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ScalingGroupId",
      "description": "The ID of the scaling group whose number of instances is changed when the scheduled task is triggered. If you specify the `ScalingGroupId` parameter, you must specify at least one of the `MinValue`, `MaxValue`, and `DesiredCapacity` parameters.\n\n>  You cannot specify the `ScheduledAction` and `ScalingGroupId` parameters at the same time.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ScheduledAction",
      "description": "The scaling rule that you want to execute when the scheduled task is triggered. Specify the unique identifier of the scaling rule. If you specify the `ScheduledAction` parameter, you must select an existing scaling rule.\n\n>  You cannot specify the `ScheduledAction` and `ScalingGroupId` parameters at the same time.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ScheduledTaskId",
      "description": "The ID of the scheduled task.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ScheduledTaskName",
      "description": "The name of the scheduled task. The name must be 2 to 64 characters in length and can contain letters, digits, underscores (\\_), hyphens (-), and periods (.). The name must start with a letter or a digit. The name of the scheduled task must be unique in the region and within the Alibaba Cloud account.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TaskEnabled",
      "description": "Specifies whether to enable the scheduled task. Valid values:\n\n*   true: enables the scheduled task.\n*   false: disables the scheduled task.\n\nDefault value: true.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    }
  ]
}