{
  "name": "RemoveInstances",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ClientToken",
      "description": "",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DecreaseDesiredCapacity",
      "description": "Specifies whether to adjust the expected number of ECS instances in the scaling group. Valid values:\n\n*   true: After ECS instances are removed from a scaling group, the expected number of ECS instances in the scaling group decreases.\n*   false: After ECS instances are removed from a scaling group, the expected number of ECS instances in the scaling group remains unchanged.\n\nDefault value: true.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "InstanceId",
      "description": "The ID of ECS instance N that you want to remove. Valid values of N: 1 to 20.",
      "position": "Query",
      "type": "RepeatList",
      "required": true
    },
    {
      "name": "RegionId",
      "description": "The ID of the region where the scaling group resides.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RemovePolicy",
      "description": "The action that is performed when ECS instances are removed. Valid values:\n\n*   recycle: The ECS instances enter the economical mode.\n\n    **\n\n    **Note** This setting takes effect only if you set ScalingPolicy to recycle.\n\n*   release: The ECS instances are released.\n\nThe ScalingPolicy parameter that you specify when you call the CreateScalingGroup operation specifies the reclaim mode of the scaling group. The RemovePolicy parameter that you specify when you call the RemoveInstances operation specifies the action to be performed on ECS instances when the ECS instances are removed. Examples:\n\n*   If you set ScalingPolicy and RemovePolicy to recycle, the ECS instances enter the economical mode when they are removed.\n*   If you set ScalingPolicy to recycle and RemovePolicy to release, the ECS instances are released when they are removed.\n*   If you set ScalingPolicy to release and RemovePolicy to recycle, the ECS instances are released when they are removed.\n*   If you set ScalingPolicy and RemovePolicy to release, the ECS instances are released when they are removed.\n\nDefault value: release.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ScalingGroupId",
      "description": "The ID of the scaling group.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}