{
  "version": "2019-12-12",
  "style": "rpc",
  "apis": {
    "CreateAccount": {
      "title": "CreateAccount",
      "summary": "Creates a pair of static username and password. If you access an ApsaraMQ for RabbitMQ broker from an open source RabbitMQ client, you must use a pair of username and password for authentication. You can access the ApsaraMQ for RabbitMQ broker only after the authentication is passed. ApsaraMQ for RabbitMQ allows you to generate usernames and passwords by using AccessKey pairs provided by Alibaba Cloud Resource Access Management (RAM).",
      "deprecated": false
    },
    "CreateBinding": {
      "title": "CreateBinding",
      "summary": "Creates a binding. In ApsaraMQ for RabbitMQ, after a producer sends a message to an exchange, the exchange routes the message to a queue or another exchange based on the binding relationship and the routing rule.",
      "deprecated": false
    },
    "CreateExchange": {
      "title": "CreateExchange",
      "summary": "Creates an exchange. In ApsaraMQ for RabbitMQ, an exchange is used to route a message that is received from a producer to one or more queues or to discard the message. An exchange routes a message to queues by using the routing key and binding keys.",
      "deprecated": false
    },
    "CreateInstance": {
      "title": "CreateInstance",
      "summary": "Creates an ApsaraMQ for RabbitMQ instance.",
      "deprecated": false
    },
    "CreateQueue": {
      "title": "CreateQueue",
      "summary": "Creates a queue. In ApsaraMQ for RabbitMQ, a queue is a message queue. All messages in ApsaraMQ for RabbitMQ are sent to a specific exchange and then routed to a bound queue by the exchange.",
      "deprecated": false
    },
    "CreateVirtualHost": {
      "title": "CreateVirtualHost",
      "summary": "Creates a vhost. A vhost is used to logically isolate resources. Each vhost manages its own exchanges, queues, and bindings. Applications can run on independent vhosts in a secure manner. This way, the business of an application is not affected by other applications. Before you connect producers and consumers to an ApsaraMQ for RabbitMQ instance, you must specify vhosts for the producers and consumers.",
      "deprecated": false
    },
    "DeleteAccount": {
      "title": "DeleteAccount",
      "summary": "Deletes a pair of username and password.",
      "deprecated": false
    },
    "DeleteBinding": {
      "title": "DeleteBinding",
      "summary": "Deletes a binding to unbind a queue or an exchange from a source exchange.",
      "deprecated": false
    },
    "DeleteExchange": {
      "title": "DeleteExchange",
      "summary": "Deletes an exchange.",
      "deprecated": false
    },
    "DeleteQueue": {
      "title": "DeleteQueue",
      "summary": "Deletes a queue.",
      "deprecated": false
    },
    "DeleteVirtualHost": {
      "title": "DeleteVirtualHost",
      "summary": "Deletes a virtual host (vhost).",
      "deprecated": false
    },
    "GetInstance": {
      "title": null,
      "summary": null,
      "deprecated": false
    },
    "GetMetadataAmount": {
      "title": "GetMetadataAmount",
      "summary": "Queries the maximum number of vhosts, exchanges, and queues that you can create and the number of created vhosts, exchanges, and queues on an ApsaraMQ for RabbitMQ instance.",
      "deprecated": false
    },
    "ListAccounts": {
      "title": "ListAccounts",
      "summary": "Queries the static username and password of an ApsaraMQ for RabbitMQ.",
      "deprecated": false
    },
    "ListBindings": {
      "title": "ListBindings",
      "summary": "Queries all bindings of a virtual host (vhost) on an ApsaraMQ for RabbitMQ instance.",
      "deprecated": false
    },
    "ListDownStreamBindings": {
      "title": "ListDownStreamBindings",
      "summary": "Queries all exchanges or queues to which an exchange is bound.",
      "deprecated": false
    },
    "ListExchangeUpStreamBindings": {
      "title": "ListExchangeUpStreamBindings",
      "summary": "Queries all queues or exchanges that are bound to an exchange.",
      "deprecated": false
    },
    "ListExchanges": {
      "title": "ListExchanges",
      "summary": "Queries all exchanges that are created in a virtual host (vhost).",
      "deprecated": false
    },
    "ListInstances": {
      "title": "ListInstances",
      "summary": "Queries all AparaMQ for RabbitMQ instances in a region. The returned data includes the basic information, endpoint, and specification limits of each instance.",
      "deprecated": false
    },
    "ListQueueConsumers": {
      "title": "ListQueueConsumers",
      "summary": "Queries the online consumers of a queue.",
      "deprecated": false
    },
    "ListQueueUpStreamBindings": {
      "title": "ListQueueUpStreamBindings",
      "summary": "Queries the exchanges that are bound to a queue.",
      "deprecated": false
    },
    "ListQueues": {
      "title": "ListQueues",
      "summary": "Queries all queues in a vhost of an ApsaraMQ for RabbitMQ instance.",
      "deprecated": false
    },
    "ListVirtualHosts": {
      "title": "ListVirtualHosts",
      "summary": "Queries all virtual hosts (vhosts) on an ApsaraMQ for RabbitMQ instance.",
      "deprecated": false
    },
    "UpdateInstance": {
      "title": "UpdateInstance",
      "summary": "Upgrades or downgrades the configurations of an ApsaraMQ for RabbitMQ instance.",
      "deprecated": false
    },
    "UpdateInstanceName": {
      "title": "UpdateInstanceName",
      "summary": "Updates the name of an ApsaraMQ for RabbitMQ instance. After an ApsaraMQ for RabbitMQ instance is created, the ID of the instance is used as its name by default. You can specify a custom name for an instance to facilitate instance identification.",
      "deprecated": false
    }
  }
}