{
  "name": "CreateRules",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ListenerPort",
      "description": "The frontend listener port that is used by the SLB instance.\n\nValid values: **1 to 65535**.",
      "position": "Query",
      "type": "Integer",
      "required": true
    },
    {
      "name": "ListenerProtocol",
      "description": "The frontend protocol that is used by the SLB instance.\n\n> This parameter is required if the same port is used by listeners that use different protocols.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "LoadBalancerId",
      "description": "The ID of the SLB instance.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "RegionId",
      "description": "The ID of the region where the Server Load Balancer (SLB) instance is deployed.\n\nYou can call the [DescribeRegions](~~27584~~) operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "RuleList",
      "description": "The forwarding rules that you want to create. You can create at most 10 forwarding rules in each call. Each forwarding rule contains the following parameters:\n\n*   **RuleName**: Required. The value must be of the STRING type. The name of the forwarding rule. The name must be 1 to 40 characters in length, and can contain letters, digits, hyphens (-), forward slashes (/), periods (.), and underscores (\\_). Forwarding rule names must be unique within the same listener.\n*   **Domain**: Optional. The value must be a string. The domain name that is associated with the forwarding rule. You must specify this parameter or the **URL** parameter.\n*   **Url**: Optional. The value must be 1 to 80 characters in length, and can contain letters, digits, hyphens (-), forward slashes (/), periods (.), percent signs (%), question marks (?), number signs (#), and ampersands (&). The value must be a string. The URL cannot be only a forward slash (/). However, it must start with a forward slash (/). You must specify this parameter or the **Domain** parameter.\n*   **VServerGroupId**: Required. The value must be a string. The ID of the vServer group to be specified in the forwarding rule.\n\n>  You must specify at least one between the `Domain` and `URL` parameters. You can also specify both. The combination of `Domain` and `Url` must be unique within the same listener.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}