{
  "name": "CreateRules",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "ListenerPort",
      "description": "The frontend listener port that is used by the SLB instance.\n\nValid values: **1 to 65535**.",
      "position": "Query",
      "type": "Integer",
      "required": true
    },
    {
      "name": "ListenerProtocol",
      "description": "The frontend protocol that is used by the SLB instance.\n\n> This parameter is required if the same port is used by listeners that use different protocols.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "LoadBalancerId",
      "description": "The ID of the SLB instance.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "RegionId",
      "description": "The ID of the region where the Server Load Balancer (SLB) instance is deployed.\n\nYou can call the [DescribeRegions](~~27584~~) operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "RuleList",
      "description": "The forwarding rules that you want to create. You can create up to 10 forwarding rules in each request. Each forwarding rule contains the following parameters:\n\n*   **RuleName**: Required. The value must be of the STRING type. The name of the forwarding rule. The name must be 1 to 40 characters in length, and can contain letters, digits, hyphens (-), forward slashes (/), periods (.), and underscores (\\_). Forwarding rule names must be unique within the same listener.\n*   **Domain**: Optional. The value must be of the STRING type. The domain name that is associated with the forwarding rule. You must specify at least one of this parameter and **Url**.\n*   **Url**: Optional. The value must be of the STRING type. The URL must be 1 to 80 characters in length and can contain only letters, digits, hyphens (-), forward slashes (/), periods (.), percent signs (%), question marks (?), number signs (#), and ampersands (&). The URL cannot be a forward slash (/). However, the URL must start with a forward slash (/). You must specify at least one of this parameter and **Domain**.\n*   **VServerGroupId**: Required. The value must be of the STRING type. The ID of the vServer group that is associated with the forwarding rule.\n\n> You must specify at least one of `Domain` and `Url`. The combination of `Domain` and `Url` must be unique within the same listener.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}