{
  "name": "CreateTenantUser",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "Description",
      "description": "The description of the database.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "EncryptionType",
      "description": "加密方式。",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "GlobalPermissions",
      "description": "",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "InstanceId",
      "description": "The ID of the OceanBase cluster.",
      "position": "Body",
      "type": "String",
      "required": true
    },
    {
      "name": "Roles",
      "description": "The role of the user account.  In Oracle mode, this parameter unspecified is left unspecified.  In MySQL mode, the super administrator account has ALL PRIVILEGES, and you can leave this parameter unspecified.  You need to specify the account information for a general user account. By default, the account information is a JSON array that contains the information of the role and the schema (Oracle mode) or database (MySQL mode).  Valid values: ReadWrite: a role that has the read and write privileges, namely ALL PRIVILEGES. ReadOnly: a role that has only the read-only privilege SELECT. DDL: a role that has DDL privileges such as CREATE, DROP, ALTER, SHOW VIEW, and CREATE VIEW. DML: a role that has DML privileges such as SELECT, INSERT, UPDATE, DELETE, and SHOW VIEW.",
      "position": "Body",
      "type": "String",
      "required": false
    },
    {
      "name": "TenantId",
      "description": "The ID of the tenant.",
      "position": "Body",
      "type": "String",
      "required": true
    },
    {
      "name": "UserName",
      "description": "The name of the database account.  You cannot use reserved keywords, such as SYS and root.",
      "position": "Body",
      "type": "String",
      "required": true
    },
    {
      "name": "UserPassword",
      "description": "The password of the database account.  It must be 10 to 32 characters in length and contain three types of the following characters: uppercase letters, lowercase letters, digits, and special characters. The special characters are ! @ # $ % \\ ^ \\ & \\ * ( ) _ + - =",
      "position": "Body",
      "type": "String",
      "required": true
    },
    {
      "name": "UserType",
      "description": "The type of the database account. Valid values: Admin: the super administrator account. Normal: a general account.",
      "position": "Body",
      "type": "String",
      "required": true
    }
  ]
}