{
  "name": "DescribeTraffic",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "EndTime",
      "description": "The end of the time range to query. The value is a UNIX timestamp. Unit: seconds.\n\nIf you do not specify this parameter, the current system time is used as the end time.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "FlowType",
      "description": "The type of the traffic statistics to query. Valid values:\n\n*   **max**: the peak traffic within the specified interval.\n*   **avg**: the average traffic within the specified interval.\n\nEnumerated values:\n\n*   all\n*   avg\n*   max",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "InstanceId",
      "description": "The ID of the Anti-DDoS Origin instance to query.\n\n>  You can call the [DescribeInstanceList](~~118698~~) operation to query the IDs of all Anti-DDoS Origin instances.\n\nIf you specify an on-demand instance, you must configure the **Interval** parameter.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Interval",
      "description": "The interval at which the traffic statistics are calculated. Unit: seconds. Default value: **5**.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "Ip",
      "description": "The public IP address of the asset to query. If you do not specify this parameter, the traffic statistics of all public IP addresses that are protected by the Anti-DDoS Origin instance are queried.\n\n>  The public IP address must be a protected object of the Anti-DDoS Origin instance. You can call the [DescribePackIpList](~~118701~~) operation to query all protected objects of the Anti-DDoS Origin instance.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Ipnet",
      "description": "The Classless Inter-Domain Routing (CIDR) block of the on-demand instance that you want to query.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The ID of the region where the Anti-DDoS Origin instance resides.\n\n>  You can call the [DescribeRegions](~~118703~~) operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ResourceGroupId",
      "description": "The ID of the resource group to which the Anti-DDoS Origin instance belongs in Resource Management.\n\nIf you do not specify this parameter, the instance belongs to the default resource group.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "StartTime",
      "description": "The beginning of the time range to query. The value is a UNIX timestamp. Unit: seconds.",
      "position": "Query",
      "type": "Integer",
      "required": true
    }
  ]
}