{
  "name": "AddShardingNode",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AutoPay",
      "description": "Specifies whether to enable auto-renewal. Valid values:\n\n*   **true**: enables auto-renewal. Make sure that your account has sufficient balance.\n*   **false**: disables auto-renewal. You must manually renew the instance in the console before the instance expires. For more information, see [Instance renewal](~~26352~~).\n\n>  Default value: **true**.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "BusinessInfo",
      "description": "The business information. This is an additional parameter.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "CouponNo",
      "description": "The ID of the coupon.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ForceTrans",
      "description": "Specifies whether to enable forced transmission during a configuration change. Valid values:\n\n*   **false** (default): Before the configuration change, the system checks the minor version of the instance. If the minor version of the instance is outdated, an error is reported. You must update the minor version of the instance and try again.\n*   **true**: The system skips the version check and directly performs the configuration change.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "InstanceId",
      "description": "The ID of the instance.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ShardCount",
      "description": "The number of data shards that you want to add. Default value: **1**.\n\n>  The instance can contain 2 to 256 data shards. You can add up to 64 data shards at a time. Make sure that the number of shards does not exceed this limit.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "SourceBiz",
      "description": "The source of the operation. This parameter is used only for internal maintenance. You do not need to specify this parameter.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "VSwitchId",
      "description": "The vSwitch ID. You can specify a different vSwitch within the same virtual private cloud (VPC). In this case, the new data shards are created in the specified vSwitch. If you do not specify this parameter, the new data shards are created in the original vSwitch.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}