{
  "name": "CreateTairInstance",
  "deprecated": false,
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AutoPay",
      "description": "Specifies whether to enable automatic payment. Set the value to **true**.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "AutoRenew",
      "description": "Specifies whether to enable auto-renewal for the instance. Default value: false. Valid values:\n\n*   **true**: enables auto-renewal.\n*   **false**: disables auto-renewal.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "AutoRenewPeriod",
      "description": "The subscription duration that is supported by auto-renewal. Unit: months. Valid values: **1**, **2**, **3**, **6**, and **12**.\n\n> This parameter is required only if the **AutoRenew** parameter is set to **true**.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "AutoUseCoupon",
      "description": "Specifies whether to use a coupon. Default value: false. Valid values:\n\n*   **true**: uses a coupon.\n*   **false**: does not use a coupon.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "BackupId",
      "description": "The ID of the backup set of the source instance. You can call the [DescribeBackups](~~61081~~) operation to query the ID of the backup set.\n\n> If you want to create an instance based on the backup set of an existing instance, you must specify this parameter after you specify the **SrcDBInstanceId** parameter. The system creates an instance based on the backup set that is specified by this parameter.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "BusinessInfo",
      "description": "The ID of the promotion event or the business information.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ChargeType",
      "description": "The billing method of the instance. Default value: PrePaid. Valid values:\n\n*   **PrePaid**: subscription\n*   **PostPaid**: pay-as-you-go",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request. You can use the client to generate the value, but you must make sure that the token is unique among different requests. The token is case-sensitive. The token can contain only ASCII characters and cannot exceed 64 characters in length.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ClusterBackupId",
      "description": "集群备份集ID。",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "CouponNo",
      "description": "The coupon code.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "DryRun",
      "description": "Specifies whether to perform a dry run. Default value: false. Valid values:\n\n*   **true**: performs a dry run and does not create the instance. The system prechecks the request parameters, request format, service limits, and available resources. If the request fails the dry run, an error code is returned. If the request passes the dry run, the `DryRunOperation` error code is returned.\n*   **false**: performs a dry run and sends the request. If the request passes the dry run, the instance is created.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "EngineVersion",
      "description": "The database engine version of the instance. Default value: **1.0**, which is developed by Alibaba Cloud and compatible with Redis 5.0.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "GlobalInstanceId",
      "description": "The ID of the distributed instance.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "GlobalSecurityGroupIds",
      "description": "The global IP whitelist template of the instance. Separate multiple IP whitelist templates with commas (,) and make sure that each IP whitelist template is unique.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "InstanceClass",
      "description": "The instance type. For more information, see the following topics:\n\n*   [DRAM-based instances](~~443844~~)\n*   [Persistent memory-optimized instances](~~443845~~)\n*   [ESSD-based instances](~~443846~~)",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "InstanceName",
      "description": "The name of the instance. The name must meet the following requirements:\n\n*   The name is 2 to 80 characters in length.\n*   The name starts with a letter and does not contain spaces or special characters. Special characters include `@ / : = \" < > { [ ] }`",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "InstanceType",
      "description": "The storage type of the instance. Valid values:\n\n*   **tair_rdb**: ApsaraDB for Redis Enhanced Edition (Tair) DRAM-based instance\n*   **tair_scm**: ApsaraDB for Redis Enhanced Edition (Tair) persistent memory-optimized instance\n*   **tair_essd**: ApsaraDB for Redis Enhanced Edition (Tair) ESSD-based instance",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ParamGroupId",
      "description": "The ID of the parameter template. The instance is created based on the parameters in the parameter template. The ID must be unique.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Password",
      "description": "The password that is used to connect to the instance. The password must meet the following requirements:\n\n*   The password is 8 to 32 characters in length.\n*   The password contains at least three of the following character types: uppercase letters, lowercase letters, digits, and special characters. Special characters include `! @ # $ % ^ & * ( ) _ + - =`",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Period",
      "description": "The subscription duration. Valid values: **1**, 2, 3, 4, 5, 6, 7, 8, **9**, **12**, **24**,**36**, and **60**. Unit: months.\n\n> This parameter is required only if you set the **ChargeType** parameter to **PrePaid**.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "Port",
      "description": "The port number of the instance. Valid values: **1024** to **65535**. Default value: **6379**.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "PrivateIpAddress",
      "description": "The private IP address of the instance.\n\n> The IP address must be within the CIDR block of the vSwitch to which you want the instance to connect. You can call the [DescribeVSwitches](~~35748~~) operation of the VPC API to query the CIDR block information.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ReadOnlyCount",
      "description": "The number of read-only nodes of the instance. This parameter is available only if you create a read/write splitting instance that uses cloud disks. You can use this parameter to specify a custom number of read-only nodes for the instance. Valid value: 1 to 5.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The ID of the region where you want to create the instance. You can call the [DescribeRegions](~~61012~~) operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ResourceGroupId",
      "description": "The ID of the resource group to which you want to assign the instance.\n\n> \n\n*   You can query resource group IDs by using the ApsaraDB for Redis console or by calling the [ListResourceGroups](~~158855~~) operation. For more information, see [View basic information of a resource group](~~151181~~).\n\n*   Before you modify the resource group to which an instance belongs, you can call the [ListResources](~~158866~~) operation to view the current resource group of the instance.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SecondaryZoneId",
      "description": "The ID of the secondary zone. You can call the [DescribeRegions](~~61012~~) operation to query the ID of the secondary zone.\n\n> You cannot specify multiple zone IDs or set this parameter to a value that is the same as that of the ZoneId parameter.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SecurityToken",
      "description": "",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ShardCount",
      "description": "The number of data nodes in the instance. Valid values:\n\n*   **1**: You can create an instance in the standard architecture that contains only one data node. For more information about the standard architecture, see [Cluster master-replica instances](~~52228~~). This is the default value.\n*   **2** to **32**: You can create an instance in the cluster architecture that contains the specified number of data nodes. For more information about the cluster architecture, see [Cluster master-replica instances](~~52228~~).\n\n> Only persistent memory-optimized instances can use the cluster architecture. Therefore, you can set this parameter to an integer from **2** to **32** only if you set the **InstanceType** parameter to **tair_scm**.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "ShardType",
      "description": "The data shard type of the instance. Default value: MASTER_SLAVE. Valid values:\n\n*   **MASTER_SLAVE**: runs in a master-replica architecture that provides high availability.\n*   **STAND_ALONE**: runs in a standalone architecture. If the only node fails, the system creates a new instance and switches the workloads to the new instance. This may cause data loss. You can set this parameter to this value only if the instance uses the **single-zone** deployment type. If you set this parameter to this value, you cannot create cluster or read/write splitting instances.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SlaveReadOnlyCount",
      "description": "",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "SrcDBInstanceId",
      "description": "The ID of the source instance.\n\n> If you want to create an instance based on the backup set of an existing instance, set this parameter to the ID of the source instance and the **BackupId** parameter to the backup set that you want to use.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Storage",
      "description": "The storage space of cloud disks. Valid values vary based on the instance specifications. For more information, see [ESSD-based instances](~~443846~~).\n\n> This parameter is available and required only if the **InstanceType** parameter is set to **tair_essd**.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "StorageType",
      "description": "The storage type of the instance. Set the value to **essd_pl1**.\n\n> This parameter is available only if the **InstanceType** parameter is set to **tair_essd**.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Tag",
      "description": "The tags to add to the instance.",
      "position": "Query",
      "type": "RepeatList",
      "required": false,
      "sub_parameters": [
        {
          "name": "Key",
          "position": "Query",
          "type": "String",
          "required": false
        },
        {
          "name": "Value",
          "position": "Query",
          "type": "String",
          "required": false
        }
      ]
    },
    {
      "name": "VSwitchId",
      "description": "The ID of the vSwitch that belongs to the VPC. You can call the [DescribeVpcs](~~35739~~) operation to query the ID of the vSwitch.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "VpcId",
      "description": "The ID of the virtual private cloud (VPC). You can call the [DescribeVpcs](~~35739~~) operation to query the ID of the VPC.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "ZoneId",
      "description": "The primary zone ID of the instance. You can call the [DescribeRegions](~~61012~~) operation to query the IDs of available zones.\n\n>  You can also set the SecondaryZoneId parameter to specify the secondary zone. The primary and secondary nodes will then be deployed in the specified primary and secondary zones to implement the master-replica zone-disaster recovery architecture. For example, you can set the ZoneId parameter to cn-hangzhou-h and the SecondaryZoneId parameter to cn-hangzhou-g.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}