{
  "name": "DeleteShardingNode",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "EffectiveTime",
      "description": "The time when you want to delete the proxy nodes for instance in the proxy mode. Valid values:\n\n*   **0 or Immediately** (default): immediately delete the proxy nodes.\n*   **1 or MaintainTime**: delete the proxy nodes during the maintenance window.\n\n>  You can call the [ModifyInstanceMaintainTime](~~473775~~) operation to modify the maintenance window of an instance.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ForceTrans",
      "description": "Specifies whether to enable forced transmission during a configuration change. Valid values:\n\n*   **false** (default): Before the configuration change, the system checks the minor version of the instance. If the minor version of the instance is outdated, an error is reported. You must update the minor version of the instance and try again.\n*   **true**: The system skips the version check and directly performs the configuration change.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "InstanceId",
      "description": "The ID of the instance.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "NodeId",
      "description": "The ID of the data shard that you want to remove. You can specify multiple IDs at a time. Separate multiple IDs with commas (,).\n\n> If you specify both the NodeId and ShardCount parameters, the system prioritizes the NodeId parameter.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ShardCount",
      "description": "The number of data shards that you want to remove. Shard removal starts from the end of the shard list.\n\n> For example, the instance has the following data shards: db-0, db-1, db-2, db-3, and db-4. In this case, if you set this parameter to 2, db-3 and db-4 are removed.",
      "position": "Query",
      "type": "Integer",
      "required": false
    }
  ]
}