{
  "name": "EnableAdditionalBandwidth",
  "deprecated": false,
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AutoPay",
      "description": "Specifies whether to enable automatic payment. Default value: true. Valid values:\n\n*   **true**: enables automatic payment. Make sure that you have sufficient balance within your account.\n*   **false**: disables automatic payment. If automatic payment is disabled, you must perform the following steps to complete the payment in the ApsaraDB for Redis console: In the top navigation bar, choose **Expenses** > **Renewal Management**. In the left-side navigation pane, click **Orders**. On the **Orders** page, find the order and complete the payment.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "AutoRenew",
      "description": "Specifies whether to enable auto-renewal. Valid values:\n\n*   **true**: enables auto-renewal.\n*   **false**: disables auto-renewal. This is the default value.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "AutoRenewPeriod",
      "description": "The auto-renewal cycle based on which ApsaraDB for Redis automatically renews the purchased bandwidth. Unit: months. Valid values: **1**, **2**, **3**, **4**, **5**, **6**, **7**, **8**, **9**, **12**, **24**, **36**, and **60**.\n\n> * This parameter takes effect and must be specified only when you set the **AutoRenew** parameter to **true**.\n> * You cannot query the auto-renewal cycle by calling an API operation. To obtain the auto-renewal cycle, you can perform the following procedure: In the top navigation bar of the ApsaraDB for Redis console, choose **Expenses** > **Renewal Management**. On the page that appears, enter the ID of the instance and the `-bw` suffix in the **Instance ID** field. Example: r-bp1zxszhcgatnx****-bw.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "Bandwidth",
      "description": "The amount of bandwidth that you want to purchase. Unit: MB/s. The value of this parameter must be an integer that is greater than or equal to **0**. You can set this parameter to a value that is up to two times the default bandwidth that is supported by the instance type. For example, if the default bandwidth that is supported by the instance type is 10 MB/s, you can set this parameter to a value within the range of **0** to **20**.\n\n> * You call the [DescribeRoleZoneInfo](~~190794~~) operation to query the default bandwidth that is supported by an instance type. In the response, the default bandwidth is indicated by the **DefaultBandWidth** parameter. For more information about instance types, see [Overview](~~26350~~).\n> * If you specify multiple data shard IDs in the **NodeId** parameter, you must specify the amount of bandwidth that you want to purchase for each specified data shard in the Bandwidth parameter. The bandwidth values that you specify in the Bandwidth parameter must be in the same sequence as the data shard IDs that you specify in the NodeId parameter. In addition, you must separate the bandwidth values with commas (,).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ChargeType",
      "description": "The billing method of the bandwidth instance. Default value: PostPaid. Valid values:\n\n- PrePaid: subscription\n- PostPaid: pay-as-you-go",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "CouponNo",
      "description": "The coupon ID.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "InstanceId",
      "description": "The ID of the instance. You can call the [DescribeInstances](~~60933~~) operation to query the IDs of instances.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "NodeId",
      "description": "The ID of the data shard for which you want to purchase a specific amount of bandwidth. You can call the [DescribeLogicInstanceTopology](~~94665~~) operation to query the IDs of the data shards in an instance. If you specify multiple data shard IDs, separate the data shard IDs with commas (,). You can also set this parameter to **All**, which specifies all the data shards of the instance.\n\n> This parameter is available and required only if the instance is a [cluster master-replica](~~52228~~) or [read/write splitting](~~62870~~) instance.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "OrderTimeLength",
      "description": "The validity period of the bandwidth that you purchase. Unit: day. Valid values: **1**, **2**, **3**, **7**, **14**, **30**, **60**, **90**, **180**, **365**, **730**, **1095**, and **1825**.\n\n> If you want to continue using the purchased bandwidth after the specified period of time elapses, you must call the [RenewAdditionalBandwidth](~~211199~~) operation to submit a renewal order.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SecurityToken",
      "description": "",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SourceBiz",
      "description": "The source of the operation. This parameter is used only for internal maintenance. You do not need to specify this parameter.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}