{
  "name": "MigrateToOtherZone",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "DBInstanceId",
      "description": "The ID of the Tair (Redis OSS-compatible) instance.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "EffectiveTime",
      "description": "The time when the database is switched after the instance is migrated. Valid values:\n\n*   **Immediately**: The database is immediately switched after the instance is migrated.\n*   **MaintainTime**: The database is switched within the maintenance window.\n\n>  Default value: Immediately.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ReadOnlyCount",
      "description": "The number of read replicas in the primary zone.\n\n> \n\n*   The **ReadOnlyCount** and **SlaveReadOnlyCount** parameters are applicable only to cloud-native instances for which read/write splitting is enabled. When you migrate an instance to multiple zones, you can use these parameters to adjust the distribution of read replicas in the primary and secondary zones of the instance. This operation does not allow you to increase or decrease the number of nodes. Therefore, the sum of the values of `ReadOnlyCount and SlaveReadOnlyCount` must be the same as that before the migration.\n\n*   If you do not specify these parameters when you migrate an instance from a single zone to multiple zones, one read replica is migrated to the secondary zone, and all other read replicas remain in the primary zone.\n\n*   If the instance is a cluster instance, the preceding parameters indicate the number of read replicas per shard in the primary and secondary zones of the instance.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "ReplicaCount",
      "description": "The number of replica nodes in the primary zone.\n\n> \n\n*   The **ReplicaCount** and **SlaveReplicaCount** parameters are applicable only to cloud-native instances. When you migrate an instance to multiple zones, you can use these parameters to adjust the distribution of replica nodes in the primary and secondary zones of the instance. This operation does not allow you to increase or decrease the number of nodes. Therefore, the sum of the values of `ReplicaCount and SlaveReplicaCount` must be the same as that before the migration.\n\n*   If you do not specify these parameters when you migrate an instance from a single zone to multiple zones, one replica node is migrated to the secondary zone, and all other replica nodes remain in the primary zone.\n\n*   If the instance is a cluster instance, the preceding parameters indicate the number of replica nodes per shard in the primary and secondary zones of the instance.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "SecondaryZoneId",
      "description": "The ID of the secondary zone to which you want to migrate the instance. You can call the [DescribeZones](~~473764~~) operation to query zone IDs.\n\n>  If you specify this parameter, the master node and replica node of the instance can be deployed in different zones and disaster recovery is implemented across zones. The instance can withstand failures in data centers.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SlaveReadOnlyCount",
      "description": "The number of read replicas in the secondary zone.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "SlaveReplicaCount",
      "description": "The number of replica nodes in the secondary zone.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "VSwitchId",
      "description": "The ID of the vSwitch.\n\n> \n\n*   The zone where the vSwitch resides must be the same as the ID of the destination zone.\n\n*   If the network type of the instance is VPC, this parameter is required.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ZoneId",
      "description": "The ID of the destination primary zone. You can call the [DescribeZones](~~473764~~) operation to query zone IDs.",
      "position": "Query",
      "type": "String",
      "required": true
    }
  ]
}