{
  "name": "ModifyInstanceSpec",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AutoPay",
      "description": "Specifies whether to enable auto-renewal. Default value: true. Valid values:\n\n*   **true**: enables auto-renewal.\n*   **false**: disables auto-renewal. If you set this parameter to **false**, the instance must be manually renewed before it expires. For more information, see [Renew an instance](~~26352~~).",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "BusinessInfo",
      "description": "The ID of the promotional event or business information.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request. You can use the client to generate the value, but you must make sure that it is unique among different requests. The token can contain only ASCII characters and cannot exceed 64 characters in length.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "CouponNo",
      "description": "The coupon code. Default value: `youhuiquan_promotion_option_id_for_blank`.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EffectiveTime",
      "description": "The time when to change the configurations. Default value: Immediately. Valid values:\n\n*   **Immediately**: The configurations are immediately changed.\n*   **MaintainTime**: The configurations are changed within the maintenance window. You can call the [ModifyInstanceMaintainTime](~~61000~~) operation to change the maintenance window.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ForceTrans",
      "description": "Specifies whether to enable forced transmission during a configuration change. Valid values:\n\n*   **false** (default): Before the configuration change, the system checks the minor version of the instance. If the minor version of the instance is outdated, an error is reported. You must update the minor version of the instance and try again.\n*   **true**: The system skips the version check and directly performs the configuration change.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "ForceUpgrade",
      "description": "Specifies whether to forcefully change the configurations of the instance. Default value: true. Valid values:\n\n*   **false**: The system does not forcefully change the configurations.\n*   **true**: The system forcefully changes the configurations.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "InstanceClass",
      "description": "The new instance type. You can call the [DescribeAvailableResource](~~120580~~) operation to query the instance types available for configuration change within the zone to which the instance belongs.\n\n>  For more information about the instance types, see [Overview](~~26350~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "InstanceId",
      "description": "The ID of the instance. You can call the [DescribeInstances](~~60933~~) operation to query the ID of the instance.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "MajorVersion",
      "description": "The major version to which you want to upgrade. When you change the configurations of an instance, you can upgrade the major version of the instance by setting this parameter. Valid values: **4.0** and **5.0**.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "OrderType",
      "description": "The change type. This parameter is required when you change the configurations of a subscription instance. Default value: UPGRADE. Valid values:\n\n*   **UPGRADE**: upgrades the configurations of a subscription instance.\n*   **DOWNGRADE**: downgrades the configurations of a subscription instance.\n\n> *   To downgrade a subscription instance, you must set this parameter to **DOWNGRADE**.\n> *   If the price of an instance increases after its configurations are changed, the instance is upgraded. If the price decreases, the instance is downgraded. For example, the price of an 8 GB read/write splitting instance with five read replicas is higher than that of a 16 GB cluster instance. If you want to change a 16 GB cluster instance to an 8 GB read/write splitting instance with five read replicas, you must upgrade the instance.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ReadOnlyCount",
      "description": "The number of read-only nodes. This parameter is available only for read/write splitting instances that use cloud disks. Valid values: 1 to 5.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID of the instance. You can call the [DescribeRegions](~~61012~~) operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SecurityToken",
      "description": "",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ShardCount",
      "description": "The number of shards. This parameter is available only for cluster instances that use cloud disks.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "SlaveReadOnlyCount",
      "description": "",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "SourceBiz",
      "description": "The source of the operation. This parameter is used only for internal maintenance. You do not need to specify this parameter.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}