{
  "name": "ModifyInstanceSpec",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "AutoPay",
      "description": "Specifies whether to enable automatic payment. Valid values:\n\n*   **true** (default): enables automatic payment.\n*   **false**: disables automatic payment. If you set this parameter to **false**, the instance must be manually renewed before it expires. For more information, see [Renew an instance](~~26352~~).",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "BusinessInfo",
      "description": "The ID of the promotional event or the business information.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ClientToken",
      "description": "The client token that is used to ensure the idempotence of the request. You can use the client to generate the token, but you must make sure that the token is unique among different requests. The token can contain only ASCII characters and cannot exceed 64 characters in length.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "CouponNo",
      "description": "The coupon code. Default value: `youhuiquan_promotion_option_id_for_blank`.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "EffectiveTime",
      "description": "The time when you want the configurations to be changed. Valid values:\n\n*   **Immediately** (default): immediately changes the configurations.\n*   **MaintainTime**: changes the configurations within the maintenance window. You can call the [ModifyInstanceMaintainTime](~~473775~~) operation to change the maintenance window.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ForceTrans",
      "description": "Specifies whether to enable forced transmission during a configuration change. Valid values:\n\n*   **false** (default): Before the configuration change, the system checks the minor version of the instance. If the minor version of the instance is outdated, an error is reported. You must update the minor version of the instance and try again.\n*   **true**: The system skips the version check and directly performs the configuration change.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "ForceUpgrade",
      "description": "Specifies whether to forcibly change the configurations. Valid values:\n\n*   **false**: The system does not forcefully change the configurations.\n*   **true** (default): The system forcefully changes the configurations.",
      "position": "Query",
      "type": "Boolean",
      "required": false
    },
    {
      "name": "InstanceClass",
      "description": "The new instance type. You can call the [DescribeAvailableResource](~~473765~~) operation to query the instance types available for configuration change within the zone to which the instance belongs.\n\n>  For more information about the instance types, see [Overview](~~26350~~).",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "InstanceId",
      "description": "The instance ID. You can call the [DescribeInstances](~~473778~~) operation to query the instance ID.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "MajorVersion",
      "description": "The major version of the classic instance that you want to upgrade. Valid values: **2.8**, **4.0**, and **5.0**.\n\n>  The **InstanceClass** parameter is required when you upgrade the instance version. This parameter indicates that you can upgrade the instance version only when you update the instance specifications. If you only need to upgrade the instance version, call the [ModifyInstanceMajorVersion](~~473776~~) operation.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "NodeType",
      "description": "The type of the node. Valid values:\n\n*   **MASTER_SLAVE**: high availability (master-replica)\n*   **STAND_ALONE**: standalone\n*   **double**: master-replica\n*   **single**: standalone\n\n>  To create a cloud-native instance, set this parameter to **MASTER_SLAVE** or **STAND_ALONE**. To create a classic instance, set this parameter to **double** or **single**.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "OrderType",
      "description": "The change type. This parameter is required when you change the configurations of a subscription instance. Valid values:\n\n*   **UPGRADE** (default): upgrades the configurations of the subscription instance.\n*   **DOWNGRADE**: downgrades the configurations of the subscription instance.\n\n> \n\n*   To downgrade a subscription instance, you must set this parameter to **DOWNGRADE**.\n\n*   If the price of an instance increases after its configurations are changed, the instance is upgraded. If the price decreases, the instance is downgraded. For example, the price of an 8 GB read/write splitting instance with five read replicas is higher than that of a 16 GB cluster instance. If you want to change a 16 GB cluster instance to an 8 GB read/write splitting instance with five read replicas, you must upgrade the instance.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ReadOnlyCount",
      "description": "The number of read replicas in the primary zone. Valid values: 0 to 5. This parameter applies only to the following scenarios:\n\n*   If the instance is a cloud-native standard instance, you can set this parameter to a value greater than 0 to enable the read/write splitting architecture.\n*   If the instance is a cloud-native read/write splitting instance, you can use this parameter to customize the number of read replicas. You can also set this parameter to 0 to disable the read/write splitting architecture and switch the instance to the standard architecture.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "RegionId",
      "description": "The region ID. You can call the [DescribeRegions](~~473763~~) operation to query the most recent region list.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "ReplicaCount",
      "description": "The number of replica nodes in the primary zone. This parameter is applicable only to cloud-native multi-replica cluster instances. Valid values: 1 to 4.\n\n> \n\n*   The sum of the values of this parameter and the SlaveReplicaCount parameter cannot be greater than 4.\n\n*   You can specify either ReplicaCount or ReadOnlyCount.\n\n*   A master-replica instance cannot contain multiple replica nodes.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "ShardCount",
      "description": "The number of shards. This parameter is applicable only to cloud-native cluster instances.\n\n> \n\n*   If you want to change a cloud-native cluster instance to a standard instance, you must explicitly set the ShardCount parameter to 1 and specify the specifications of the master-replica instance.\n\n*   To change a cloud-native standard instance to a cluster instance, you must explicitly set the ShardCount parameter to a value greater than 1 and specify the specifications of the cluster instance.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "SlaveReadOnlyCount",
      "description": "The number of read replicas in the secondary zone when you create a read/write splitting instance that is deployed across multiple zones. Valid values: 1 to 9. The sum of the values of this parameter and the ReadOnlyCount parameter cannot be greater than 9.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "SlaveReplicaCount",
      "description": "The number of replica nodes in the secondary zone when you create a cloud-native multi-replica cluster instance that is deployed across multiple zones. The sum of the values of this parameter and the ReplicaCount parameter cannot be greater than 4.\n\n>  When you create a cloud-native multi-replica cluster instance that is deployed across multiple zones, you must specify both SlaveReplicaCount and SecondaryZoneId.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "SourceBiz",
      "description": "The source of the operation. This parameter is used only for internal maintenance. You do not need to specify this parameter.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "Storage",
      "description": "The storage capacity of the ESSD/SSD-based instance. The valid values vary based on the instance type. For more information, see [ESSD/SSD-based instances](~~2527111~~).\n\n>  This parameter is required only when you set the **InstanceType** parameter to **tair_essd** to create an ESSD-based instance. If you create a Tair **SSD**-based instance, the Storage parameter is automatically specified based on predefined specifications. You do not need to specify this parameter.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "StorageType",
      "description": "The storage type. Valid values: **essd_pl1**, **essd_pl2**, and **essd_pl3**.\n\n>  This parameter is required only when you set the **InstanceType** parameter to **tair_essd** to create an ESSD-based instance.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}