{
  "name": "RestoreInstance",
  "deprecated": false,
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "BackupId",
      "description": "The ID of the backup file. You can call the [DescribeBackups](~~473823~~)operation to query the IDs of backup files.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "FilterKey",
      "description": "The key that you want to restore. You can specify multiple keys. Separate multiple keys with commas (,). Regular expressions are supported.\n\n*   If you do not specify this parameter, the entire instance is restored.\n*   If you specify this parameter, only the involved keys are restored. Only classic instances support this feature.\n\n>  In a regular expression, an asterisk (`*`) matches zero or more occurrences of a subexpression that occurs before. For example, if you set this parameter to `h.*llo`, strings such as `hllo` and `heeeello` are matched.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "InstanceId",
      "description": "The ID of the instance.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "RestoreTime",
      "description": "The point in time to which you want to restore data. Specify the time in the ISO 8601 standard in the *yyyy-MM-dd*T*HH:mm*Z format. The time must be in UTC.\n\n>  The point in time cannot be earlier than the point in time when the data flashback feature is enabled.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "RestoreType",
      "description": "The restoration mode. Valid values:\n\n*   **0** (default): The parameter is invalid.\n*   **1**: restores data to a specified point in time. You can specify this value only if the [data flashback](~~148479~~) feature is enabled for the instance. If you specify this value, you also need to set the **RestoreTime** parameter.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "TimeShift",
      "description": "When you restore a classic instance, regardless of whether you choose to restore all data or specific keys, you can apply an offset to the expiration time of the keys. Specify the time in the ISO 8601 standard in the yyyy-MM-ddTHH:mmZ format. The time must be in UTC. A key expires after the remaining validity period of the key elapses based on the expiration offset time point.\n\n> \n\n*   This feature applies only to keys and does not work on elements in the self-developed data structures of Tair, such as fields in exHash and skeys in TairTS.\n\n*   This time point must be between the specified flashback time point and the submission time of the data restoration task.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}