{
  "name": "SwitchInstanceHA",
  "deprecated": false,
  "security": [
    "AK"
  ],
  "protocol": "HTTP|HTTPS",
  "method": "GET|POST",
  "pathPattern": "",
  "parameters": [
    {
      "name": "InstanceId",
      "description": "The ID of the instance. You can call the [DescribeInstances](~~60933~~) operation to query the ID of the instance.",
      "position": "Query",
      "type": "String",
      "required": true
    },
    {
      "name": "NodeId",
      "description": "The ID of the data shard. You can call the [DescribeRoleZoneInfo](~~190794~~) operation to obtain the value of the CustinsId parameter. Separate multiple data shard IDs with commas (,). `all` indicates that all data shards are specified.\n\n> This parameter is available and required only for read/write splitting and cluster instances.",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SecurityToken",
      "description": "",
      "position": "Query",
      "type": "String",
      "required": false
    },
    {
      "name": "SwitchMode",
      "description": "The time when to perform the switchover. Default value: 0. Valid values:\n\n*   **0**: immediately performs the switchover.\n*   **1**: performs the switchover during the maintenance window.\n\n> You can call the [ModifyInstanceMaintainTime](~~61000~~) operation to modify the maintenance window of an ApsaraDB for Redis instance.",
      "position": "Query",
      "type": "Integer",
      "required": false
    },
    {
      "name": "SwitchType",
      "description": "The switching mode. Valid values:\n\n*   **AvailablePriority**: prioritizes the availability and performs a switchover immediately without considering the latency of data synchronization between the master and replica nodes. This may cause data loss.\n*   **ReliabilityPriority**: prioritizes the reliability and performs a switchover after no latency of data synchronization between the master and replica nodes exists. This ensures data integrity. This mode may cause a switchover failure in scenarios that involve a large volume of data writes and persistent latency of data synchronization.\n\n> You must evaluate the requirements for data and services based on your business scenarios and then select a switching mode.",
      "position": "Query",
      "type": "String",
      "required": false
    }
  ]
}